[{"text": "From Donald Trump: Wishing everyone a wonderful holiday & a happy, healthy, prosperous New Year. Let’s think like champions in 2010!", "created_at": "Wed Dec 23 17:38:18 +0000 2009"}, {"text": "Wishing you and yours a very Happy and Bountiful Thanksgiving!", "created_at": "Thu Nov 26 19:55:38 +0000 2009"}, {"text": "--Work has begun, ahead of schedule, to build the greatest golf course in history: Trump International – Scotland.", "created_at": "Mon Nov 02 14:57:56 +0000 2009"}, {"text": "--From Donald Trump: \"Ivanka and Jared’s wedding was spectacular, and they make a beautiful couple. I’m a very proud father.\"", "created_at": "Tue Oct 27 15:31:48 +0000 2009"}, {"text": "Ivanka is now on Twitter - You can follow her @IvankaTrump - Have a terrific weekend!", "created_at": "Fri Aug 14 14:33:46 +0000 2009"}, {"text": "Here's to a safe and happy Independence Day for one and all - Enjoy it! --Donald J. Trump", "created_at": "Sat Jul 04 23:19:56 +0000 2009"}, {"text": "RE: Michael Jackson: \"He was a great friend and a spectacular entertainer. It’s a devastating loss!\" -Donald J. Trump", "created_at": "Fri Jun 26 16:51:16 +0000 2009"}, {"text": "Thanks to all for your thoughtful birthday wishes – Donald Trump", "created_at": "Mon Jun 15 23:13:05 +0000 2009"}, {"text": "Miss USA Tara Conner will not be fired - \"I've always been a believer in second chances.\" says Donald Trump", "created_at": "Tue May 12 19:21:55 +0000 2009"}, {"text": "\"My persona will never be that of a wallflower - I’d rather build walls than cling to them\" --Donald J. Trump", "created_at": "Tue May 12 14:07:28 +0000 2009"}, {"text": "Donald Trump will be appearing on The View tomorrow morning to discuss Celebrity Apprentice and his new book Think Like A Champion!", "created_at": "Tue May 05 01:00:10 +0000 2009"}, {"text": "Be sure to tune in and watch Donald Trump on Late Night with David Letterman as he presents the Top Ten List tonight!", "created_at": "Mon May 04 18:54:25 +0000 2009"}]