[{"text": "Will be leaving Florida for Washington (D.C.) today at 4:00 P.M. Much work to be done, but it will be a great New Year!", "created_at": "Mon Jan 01 13:37:52 +0000 2018"}, {"text": "HAPPY NEW YEAR! We are MAKING AMERICA GREAT AGAIN, and much faster than anyone thought possible!", "created_at": "Sun Dec 31 23:43:04 +0000 2017"}, {"text": "Retail sales are at record numbers. We’ve got the economy going better than anyone ever dreamt - and you haven’t seen anything yet!", "created_at": "Thu Dec 28 16:18:20 +0000 2017"}, {"text": "Wow, “FBI lawyer James Baker reassigned,” according to @FoxNews.", "created_at": "Sat Dec 23 20:32:42 +0000 2017"}, {"text": "FBI Deputy Director Andrew McCabe is racing the clock to retire with full benefits. 90 days to go?!!!", "created_at": "Sat Dec 23 20:30:06 +0000 2017"}, {"text": "Remember, the most hated part of ObamaCare is the Individual Mandate, which is being terminated under our just signed Tax Cut Bill.", "created_at": "Fri Dec 22 22:11:56 +0000 2017"}, {"text": "The United Nations Security Council just voted 15-0 in favor of additional Sanctions on North Korea. The World wants Peace, not Death!", "created_at": "Fri Dec 22 20:47:15 +0000 2017"}, {"text": "95% of Americans will pay less or, at worst, the same amount of taxes (mostly far less). The Dems only want to raise your taxes!", "created_at": "Fri Dec 22 16:46:49 +0000 2017"}, {"text": "Home Sales hit BEST numbers in 10 years! MAKE AMERICA GREAT AGAIN", "created_at": "Thu Dec 21 13:56:28 +0000 2017"}, {"text": "DOW RISES 5000 POINTS ON THE YEAR FOR THE FIRST TIME EVER - MAKE AMERICA GREAT AGAIN!", "created_at": "Tue Dec 19 11:04:11 +0000 2017"}, {"text": "70 Record Closes for the Dow so far this year! We have NEVER had 70 Dow Records in a one year period. Wow!", "created_at": "Mon Dec 18 22:25:20 +0000 2017"}, {"text": "Ivanka Trump will be interviewed on @foxandfriends.", "created_at": "Mon Dec 18 11:42:18 +0000 2017"}, {"text": "Republican Tax Cuts are looking very good. All are working hard. In the meantime, the Stock Market hit another record high!", "created_at": "Thu Dec 14 12:59:56 +0000 2017"}, {"text": "Thank you Omarosa for your service! I wish you continued success.", "created_at": "Wed Dec 13 23:58:18 +0000 2017"}, {"text": "Great Army - Navy Game. Army wins 14 to 13 and brings home the COMMANDER-IN-CHIEF’S TROPHY! Congratulations!", "created_at": "Sat Dec 09 23:47:55 +0000 2017"}, {"text": "Great Army - Navy Game. Army wins 14 to 13 and brings home the COMMANDER-IN-CHIEF’S TROPHY (last time was 1996). Wow! Congratulations!", "created_at": "Sat Dec 09 23:39:15 +0000 2017"}, {"text": "National Pearl Harbor Remembrance Day - “A day that will live in infamy!” December 7, 1941", "created_at": "Thu Dec 07 15:04:54 +0000 2017"}, {"text": "Go get the new book on Andrew Jackson by Brian Kilmeade...Really good. @foxandfriends", "created_at": "Thu Dec 07 13:08:02 +0000 2017"}, {"text": "MAKE AMERICA GREAT AGAIN!", "created_at": "Wed Dec 06 15:00:03 +0000 2017"}, {"text": "With the great vote on Cutting Taxes, this could be a big day for the Stock Market - and YOU!", "created_at": "Mon Dec 04 12:03:18 +0000 2017"}, {"text": "Report: “ANTI-TRUMP FBI AGENT LED CLINTON EMAIL PROBE”  Now it all starts to make sense!", "created_at": "Sun Dec 03 13:36:45 +0000 2017"}, {"text": "I never asked Comey to stop investigating Flynn. Just more Fake News covering another Comey lie!", "created_at": "Sun Dec 03 11:15:02 +0000 2017"}, {"text": "A disgraceful verdict in the Kate Steinle case! No wonder the people of our Country are so angry with Illegal Immigration.", "created_at": "Fri Dec 01 03:30:42 +0000 2017"}, {"text": "Stock Market hits new Record High. Confidence and enthusiasm abound. More great numbers coming out!", "created_at": "Thu Nov 30 13:05:21 +0000 2017"}, {"text": "Funny to hear the Democrats talking about the National Debt when President Obama doubled it in only 8 years!", "created_at": "Thu Nov 30 02:23:14 +0000 2017"}, {"text": "Looks like another great day for the Stock Market. Consumer Confidence is at Record High. I guess somebody likes me (my policies)!", "created_at": "Wed Nov 29 12:03:38 +0000 2017"}, {"text": "Great day for Tax Cuts and the Republican Party. But the biggest Winner will be our great Country!", "created_at": "Wed Nov 29 03:35:27 +0000 2017"}, {"text": "Just won the lawsuit on leadership of Consumer Financial Protection Bureau, CFPB. A big win for the Consumer!", "created_at": "Wed Nov 29 03:28:33 +0000 2017"}, {"text": "MAKE AMERICA GREAT AGAIN!", "created_at": "Thu Nov 23 11:44:36 +0000 2017"}, {"text": "@ThePlumLineGS MAKE AMERICA GREAT AGAIN!", "created_at": "Thu Nov 23 11:31:09 +0000 2017"}, {"text": "51 Million American to travel this weekend - highest number in twelve years (AAA). Traffic and airports are running very smoothly!  @FoxNews", "created_at": "Wed Nov 22 21:25:11 +0000 2017"}, {"text": "Under President Trump unemployment rate will drop below 4%.  Analysts predict economic boom for 2018!  @foxandfriends and @Varneyco", "created_at": "Mon Nov 20 11:55:57 +0000 2017"}, {"text": "If Democrats were not such obstructionists and understood the power of lower taxes, we would be able to get many of their ideas into Bill!", "created_at": "Fri Nov 17 11:00:43 +0000 2017"}, {"text": "Great numbers on Stocks and the Economy. If we get Tax Cuts and Reform, we'll really see some great results!", "created_at": "Fri Nov 17 10:29:37 +0000 2017"}, {"text": ".And to think that just last week he was lecturing anyone who would listen about sexual harassment and respect for women. Lesley Stahl tape?", "created_at": "Fri Nov 17 03:15:49 +0000 2017"}, {"text": "Big win today in the House for GOP Tax Cuts and Reform, 227-205. Zero Dems, they want to raise taxes much higher, but not for our military!", "created_at": "Fri Nov 17 02:57:19 +0000 2017"}, {"text": "China is sending an Envoy and Delegation to North Korea - A big move, we'll see what happens!", "created_at": "Thu Nov 16 12:43:05 +0000 2017"}, {"text": "....your release possible and, HAVE A GREAT LIFE! Be careful, there are many pitfalls on the long and winding road of life!", "created_at": "Thu Nov 16 11:34:52 +0000 2017"}, {"text": "To the three UCLA basketball players I say:  You're welcome, go out and give a big Thank You to President Xi Jinping of China who made.....", "created_at": "Thu Nov 16 11:30:14 +0000 2017"}, {"text": "Big vote tomorrow in the House. Tax cuts are getting close!", "created_at": "Thu Nov 16 02:14:35 +0000 2017"}, {"text": "Why are Democrats fighting massive tax cuts for the middle class and business (jobs)? The reason: Obstruction and Delay!", "created_at": "Thu Nov 16 02:11:45 +0000 2017"}, {"text": "It is actually hard to believe how naive (or dumb) the Failing @nytimes is when it comes to foreign policy...weak and ineffective!", "created_at": "Wed Nov 15 16:52:33 +0000 2017"}, {"text": "...They should realize that these relationships are a good thing, not a bad thing. The U.S. is being respected again. Watch Trade!", "created_at": "Wed Nov 15 16:39:16 +0000 2017"}, {"text": "The failing @nytimes hates the fact that I have developed a great relationship with World leaders like Xi Jinping, President of China.....", "created_at": "Wed Nov 15 16:35:39 +0000 2017"}, {"text": "Do you think the three UCLA Basketball Players will say thank you President Trump? They were headed for 10 years in jail!", "created_at": "Wed Nov 15 15:11:53 +0000 2017"}, {"text": "While in the Philippines I was forced to watch @CNN, which I have not done in months, and again realized how bad, and FAKE, it is. Loser!", "created_at": "Wed Nov 15 10:45:39 +0000 2017"}, {"text": ".@foxandfriends will be showing much of our successful trip to Asia, and the friendships &amp; benefits that will endure for years to come!", "created_at": "Wed Nov 15 10:40:02 +0000 2017"}, {"text": "Our great country is respected again in Asia. You will see the fruits of our long but successful trip for many years to come!", "created_at": "Wed Nov 15 10:30:58 +0000 2017"}, {"text": "Just returned from Asia after 12 very successful days. Great to be home!", "created_at": "Wed Nov 15 04:42:16 +0000 2017"}, {"text": "May God be with the people of Sutherland Springs, Texas. The FBI and Law Enforcement has arrived.", "created_at": "Wed Nov 15 04:34:46 +0000 2017"}, {"text": "I will be making a major statement from the @WhiteHouse upon my return to D.C. Time and date to be set.", "created_at": "Tue Nov 14 06:23:12 +0000 2017"}, {"text": "Great to see @RandPaul looking well and back on the Senate floor. He will help us with TAX CUTS and REFORM!", "created_at": "Tue Nov 14 05:08:19 +0000 2017"}, {"text": "Excited to be heading home to see the House pass a GREAT Tax Bill with the middle class getting big TAX CUTS!\n\n#MakeAmericaGreatAgain🇺🇸", "created_at": "Tue Nov 14 02:21:14 +0000 2017"}, {"text": "Happy to announce, I am nominating Alex Azar to be the next HHS Secretary. He will be a star for better healthcare and lower drug prices!", "created_at": "Mon Nov 13 14:57:02 +0000 2017"}, {"text": "Just landed in the Philippines after a great day of meetings and events in Hanoi, Vietnam!", "created_at": "Sun Nov 12 10:06:58 +0000 2017"}, {"text": "Will be doing a joint press conference in Hanoi, Vietnam then heading for final destination of trip, the Phillipines.", "created_at": "Sat Nov 11 23:35:39 +0000 2017"}, {"text": "President Xi of China has stated that he is upping the sanctions against #NoKo. Said he wants them to denuclearize. Progress is being made.", "created_at": "Sat Nov 11 23:32:25 +0000 2017"}, {"text": "Just landed in Da Nang, Vietnam to deliver a speech at #APEC2017", "created_at": "Fri Nov 10 05:45:36 +0000 2017"}, {"text": "Leaving South Korea now heading to China. Looking very much forward to meeting and being with President Xi!", "created_at": "Wed Nov 08 04:57:40 +0000 2017"}, {"text": ".@EdWGillespie will totally turn around the high crime and poor economic performance of VA. MS-13 and crime will be gone. Vote today, ASAP!", "created_at": "Tue Nov 07 10:56:55 +0000 2017"}, {"text": "....and has been horrible on Virginia economy. Vote @EdWGillespie today!", "created_at": "Tue Nov 07 10:53:19 +0000 2017"}, {"text": "Ralph Northam will allow crime to be rampant in Virginia. He’s weak on crime, weak on our GREAT VETS, Anti-Second Amendment....", "created_at": "Tue Nov 07 10:53:04 +0000 2017"}, {"text": "....is making. Working very hard on TAX CUTS for the middle class, companies and jobs!", "created_at": "Tue Nov 07 10:37:30 +0000 2017"}, {"text": "Stock market hit yet another all-time record high yesterday. There is great confidence in the moves that my Administration....", "created_at": "Tue Nov 07 10:37:01 +0000 2017"}, {"text": "....Some of those they are harshly treating have been “milking” their country for years!", "created_at": "Mon Nov 06 23:05:14 +0000 2017"}, {"text": "I have great confidence in King Salman and the Crown Prince of Saudi Arabia, they know exactly what they are doing....", "created_at": "Mon Nov 06 23:03:35 +0000 2017"}, {"text": "Getting ready to leave for South Korea and meetings with President Moon, a fine gentleman. We will figure it all out!", "created_at": "Mon Nov 06 21:28:20 +0000 2017"}, {"text": "The state of Virginia economy, under Democrat rule, has been terrible. If you vote Ed Gillespie tomorrow, it will come roaring back!", "created_at": "Mon Nov 06 21:12:15 +0000 2017"}, {"text": "Would very much appreciate Saudi Arabia doing their IPO of Aramco with the New York Stock Exchange. Important to the United States!", "created_at": "Sat Nov 04 12:49:26 +0000 2017"}, {"text": "Unemployment is down to 4.1%, lowest in 17 years. 1.5 million new jobs created since I took office. Highest stock Market ever, up $5.4 trill", "created_at": "Sat Nov 04 12:35:00 +0000 2017"}, {"text": "Getting ready to land in Hawaii. Looking so much forward to meeting with our great Military/Veterans at Pearl Harbor!", "created_at": "Fri Nov 03 22:44:39 +0000 2017"}, {"text": "The decision on Sergeant Bergdahl is a complete and total disgrace to our Country and to our Military.", "created_at": "Fri Nov 03 16:54:59 +0000 2017"}, {"text": "The rigged Dem Primary, one of the biggest political stories in years, got ZERO coverage on Fake News Network TV last night. Disgraceful!", "created_at": "Fri Nov 03 16:09:52 +0000 2017"}, {"text": "I always felt I would be running and winning against Bernie Sanders, not Crooked H, without cheating, I was right.", "created_at": "Fri Nov 03 14:29:55 +0000 2017"}, {"text": "Bernie Sanders supporters have every right to be apoplectic of the complete theft of the Dem primary by Crooked Hillary!", "created_at": "Fri Nov 03 14:28:34 +0000 2017"}, {"text": "...Based on that, the Military has hit ISIS \"much harder\" over the last two days. They will pay a big price for every attack on us!", "created_at": "Fri Nov 03 12:11:33 +0000 2017"}, {"text": "ISIS just claimed the Degenerate Animal who killed, and so badly wounded, the wonderful people on the West Side, was \"their soldier.\" .....", "created_at": "Fri Nov 03 12:03:50 +0000 2017"}, {"text": "....People are angry.  At some point the Justice Department, and the FBI, must do what is right and proper. The American public deserves it!", "created_at": "Fri Nov 03 11:11:33 +0000 2017"}, {"text": "...New Donna B book says she paid for and stole the Dem Primary. What about the deleted E-mails, Uranium, Podesta, the Server, plus, plus...", "created_at": "Fri Nov 03 11:03:59 +0000 2017"}, {"text": "My Twitter account was taken down for 11 minutes by a rogue employee. I guess the word must finally be getting out-and having an impact.", "created_at": "Fri Nov 03 10:51:51 +0000 2017"}, {"text": "I will be interviewed by @IngrahamAngle on @FoxNews at 10:00. Enjoy!", "created_at": "Fri Nov 03 01:29:54 +0000 2017"}, {"text": "The @TuckerCarlson opening statement about our once cherished and great FBI was so sad to watch. James Comey's leadership was a disaster!", "created_at": "Fri Nov 03 01:26:48 +0000 2017"}, {"text": "....This is real collusion and dishonesty. Major violation of Campaign Finance Laws and Money Laundering - where is our Justice Department?", "created_at": "Fri Nov 03 00:48:09 +0000 2017"}, {"text": "Donna Brazile just stated the DNC RIGGED the system to illegally steal the Primary from Bernie Sanders. Bought and paid for by Crooked H....", "created_at": "Fri Nov 03 00:39:57 +0000 2017"}, {"text": "Great Tax Cut rollout today. The lobbyists are storming Capital Hill, but the Republicans will hold strong and do what is right for America!", "created_at": "Fri Nov 03 00:05:07 +0000 2017"}, {"text": "...There is also something appropriate about keeping him in the home of the horrible crime he committed. Should move fast. DEATH PENALTY!", "created_at": "Thu Nov 02 11:54:36 +0000 2017"}, {"text": "Would love to send the NYC terrorist to Guantanamo but statistically that process takes much longer than going through the Federal system...", "created_at": "Thu Nov 02 11:50:46 +0000 2017"}, {"text": "NYC terrorist was happy as he asked to hang ISIS flag in his hospital room. He killed 8 people, badly injured 12. SHOULD GET DEATH PENALTY!", "created_at": "Thu Nov 02 03:43:18 +0000 2017"}, {"text": "Happy birthday to @garyplayer, a truly great Champion and Person!", "created_at": "Thu Nov 02 02:45:57 +0000 2017"}, {"text": "The United States will be immediately implementing much tougher Extreme Vetting Procedures. The safety of our citizens comes first!", "created_at": "Thu Nov 02 02:19:44 +0000 2017"}, {"text": "Just spoke to President Macri of Argentina about the five proud and wonderful men killed in the West Side terror attack. God be with them!", "created_at": "Thu Nov 02 02:09:21 +0000 2017"}, {"text": "@SenateMajLdr @SenateGOP ...and Appeals Court Judges at a record clip! Our courts are rapidly changing for the better!", "created_at": "Wed Nov 01 22:03:27 +0000 2017"}, {"text": "Thanks to @SenateMajLdr McConnell and the @SenateGOP we are appointing high-quality Federal District...", "created_at": "Wed Nov 01 22:03:19 +0000 2017"}, {"text": "@NYGovCuomo @NYCMayor ...fully supports any and all of their efforts with respect to the West Side attack. #NYCStrong", "created_at": "Wed Nov 01 20:14:27 +0000 2017"}, {"text": "Just spoke with @NYGovCuomo and @NYCMayor de Blasio to let them know that the federal government...", "created_at": "Wed Nov 01 20:14:17 +0000 2017"}, {"text": "....for the Middle Class. The House and Senate should consider ASAP as the process of final approval moves along. Push Biggest Tax Cuts EVER", "created_at": "Wed Nov 01 15:03:29 +0000 2017"}, {"text": "Wouldn't it be great to Repeal the very unfair and unpopular Individual Mandate in ObamaCare and use those savings for further Tax Cuts.....", "created_at": "Wed Nov 01 14:59:43 +0000 2017"}, {"text": "\"Senator Chuck Schumer helping to import Europes problems\" said Col.Tony Shaffer. We will stop this craziness!  @foxandfriends", "created_at": "Wed Nov 01 11:40:14 +0000 2017"}, {"text": "We are fighting hard for Merit Based immigration, no more Democrat Lottery Systems. We must get MUCH tougher (and smarter).  @foxandfriends", "created_at": "Wed Nov 01 11:30:48 +0000 2017"}, {"text": "The terrorist came into our country through what is called the \"Diversity Visa Lottery Program,\" a Chuck Schumer beauty. I want merit based.", "created_at": "Wed Nov 01 11:24:32 +0000 2017"}, {"text": "I have just ordered Homeland Security to step up our already Extreme Vetting Program. Being politically correct is fine, but not for this!", "created_at": "Wed Nov 01 01:26:22 +0000 2017"}, {"text": "The Republican House members are working hard (and late) toward the Massive Tax Cuts that they know you deserve. These will be biggest ever!", "created_at": "Wed Nov 01 01:22:20 +0000 2017"}, {"text": "My thoughts, condolences and prayers to the victims and families of the New York City terrorist attack. God and your country are with you!", "created_at": "Tue Oct 31 22:57:40 +0000 2017"}, {"text": "We must not allow ISIS to return, or enter, our country after defeating them in the Middle East and elsewhere. Enough!", "created_at": "Tue Oct 31 22:31:45 +0000 2017"}, {"text": "In NYC, looks like another attack by a very sick and deranged person. Law enforcement is following this closely. NOT IN THE U.S.A.!", "created_at": "Tue Oct 31 21:30:04 +0000 2017"}, {"text": "....earth shattering. He and his brother could Drain The Swamp, which would be yet another campaign promise fulfilled. Fake News weak!", "created_at": "Tue Oct 31 14:10:42 +0000 2017"}, {"text": "The biggest story yesterday, the one that has the Dems in a dither, is Podesta running from his firm. What he know about Crooked Dems is....", "created_at": "Tue Oct 31 14:06:27 +0000 2017"}, {"text": "I hope people will start to focus on our Massive Tax Cuts for Business (jobs) and the Middle Class (in addition to Democrat corruption)!", "created_at": "Tue Oct 31 12:21:06 +0000 2017"}, {"text": "....came to the campaign. Few people knew the young, low level volunteer named George, who has already proven to be a liar. Check the DEMS!", "created_at": "Tue Oct 31 12:16:08 +0000 2017"}, {"text": "The Fake News is working overtime. As Paul Manaforts lawyer said, there was \"no collusion\" and events mentioned took place long before he...", "created_at": "Tue Oct 31 12:09:41 +0000 2017"}, {"text": "....Also, there is NO COLLUSION!", "created_at": "Mon Oct 30 14:28:10 +0000 2017"}, {"text": "Great job by MichaelCaputo on @foxandfriends.", "created_at": "Mon Oct 30 11:50:26 +0000 2017"}, {"text": "Report out that Obama Campaign paid $972,000 to Fusion GPS. The firm also got $12,400,000 (really?) from DNC. Nobody knows who OK'd!", "created_at": "Mon Oct 30 11:37:36 +0000 2017"}, {"text": "...are now fighting back like never before. There is so much GUILT by Democrats/Clinton, and now the facts are pouring out. DO SOMETHING!", "created_at": "Sun Oct 29 14:17:14 +0000 2017"}, {"text": "...\"collusion,\" which doesn't exist. The Dems are using this terrible (and bad for our country) Witch Hunt for evil politics, but the R's...", "created_at": "Sun Oct 29 14:09:51 +0000 2017"}, {"text": "...the Uranium to Russia deal, the  33,000 plus deleted Emails, the Comey fix and so much more. Instead they look at phony Trump/Russia,....", "created_at": "Sun Oct 29 14:02:37 +0000 2017"}, {"text": "JFK Files are released, long ahead of schedule!", "created_at": "Sat Oct 28 23:15:39 +0000 2017"}, {"text": "While not at all presidential I must point out that the Sloppy Michael Moore Show on Broadway was a TOTAL BOMB and was forced to close. Sad!", "created_at": "Sat Oct 28 22:19:42 +0000 2017"}, {"text": "...in order to put any and all conspiracy theories to rest.", "created_at": "Sat Oct 28 21:10:36 +0000 2017"}, {"text": "...addresses of any mentioned person who is still living. I am doing this for reasons of full disclosure, transparency and...", "created_at": "Sat Oct 28 21:09:57 +0000 2017"}, {"text": "After strict consultation with General Kelly, the CIA and other Agencies, I will be releasing ALL #JFKFiles other than the names and...", "created_at": "Sat Oct 28 21:09:00 +0000 2017"}, {"text": "Just read the nice remarks by President Jimmy Carter about me and how badly I am treated by the press (Fake News). Thank you Mr. President!", "created_at": "Sat Oct 28 12:28:28 +0000 2017"}, {"text": "Very little reporting about the GREAT GDP numbers announced yesterday (3.0 despite the big hurricane hits). Best consecutive Q's in years!", "created_at": "Sat Oct 28 12:22:12 +0000 2017"}, {"text": "Diane Black of Tennessee, the highly respected House Budget Committee Chairwoman, did a GREAT job in passing Budget, setting up big Tax Cuts", "created_at": "Fri Oct 27 14:52:42 +0000 2017"}, {"text": "It is now commonly agreed, after many months of COSTLY looking, that there was NO collusion between Russia and Trump. Was collusion with HC!", "created_at": "Fri Oct 27 13:33:40 +0000 2017"}, {"text": "Happy birthday to the great @TheLeeGreenwood. You and your beautiful song have made such a difference. MAKE AMERICA GREAT AGAIN!", "created_at": "Fri Oct 27 12:50:47 +0000 2017"}, {"text": "JFK Files are being carefully released. In the end there will be great transparency. It is my hope to get just about everything to public!", "created_at": "Fri Oct 27 11:38:43 +0000 2017"}, {"text": "Happy birthday to the great @leegreenwood83. You and your beautiful song have made such a difference. MAKE AMERICA GREAT AGAIN!", "created_at": "Fri Oct 27 11:26:40 +0000 2017"}, {"text": "Good luck to @Joy_Villa on her decision to enter the wonderful world of politics. She has many fans!", "created_at": "Fri Oct 27 11:16:40 +0000 2017"}, {"text": "Congratulations to @SpeakerRyan, @GOPLeader, @SteveScalise and to the Republican Party on Budget passage yesterday. Now for biggest Tax Cuts", "created_at": "Fri Oct 27 11:09:03 +0000 2017"}, {"text": "Thank you @foxandfriends. Really great job and show!", "created_at": "Fri Oct 27 10:59:56 +0000 2017"}, {"text": "Big news - Budget just passed!", "created_at": "Thu Oct 26 15:05:36 +0000 2017"}, {"text": "Do not underestimate the UNITY within the Republican Party!", "created_at": "Thu Oct 26 14:30:45 +0000 2017"}, {"text": "Ed Gillespie will be a great Governor of Virginia. His opponent doesn't even show up to meetings/work, and will be VERY weak on crime!", "created_at": "Thu Oct 26 14:11:21 +0000 2017"}, {"text": "Ed Gillespie will turn the really bad Virginia economy #'s around, and fast. Strong on crime, he might even save our great statues/heritage!", "created_at": "Thu Oct 26 14:07:08 +0000 2017"}, {"text": "The long anticipated release of the #JFKFiles will take place tomorrow. So interesting!", "created_at": "Wed Oct 25 19:56:39 +0000 2017"}, {"text": "Just interviewed by @LouDobbs. Will be aired tonight at 7pmE on @FoxBusiness. #Dobbs", "created_at": "Wed Oct 25 17:46:10 +0000 2017"}, {"text": "Jeff Flake, with an 18% approval rating in Arizona, said \"a lot of my colleagues have spoken out.\" Really, they just gave me a standing O!", "created_at": "Wed Oct 25 12:33:30 +0000 2017"}, {"text": "The meeting with Republican Senators yesterday, outside of Flake and Corker, was a love fest with standing ovations and great ideas for USA!", "created_at": "Wed Oct 25 11:30:36 +0000 2017"}, {"text": "\"Clinton campaign &amp; DNC paid for research that led to the anti-Trump Fake News Dossier. The victim here is the President.\" @FoxNews", "created_at": "Wed Oct 25 11:21:30 +0000 2017"}, {"text": "So nice being with Republican Senators today. Multiple standing ovations! Most are great people who want big Tax Cuts and success for U.S.", "created_at": "Tue Oct 24 22:20:42 +0000 2017"}, {"text": "Stock Market just hit another record high! Jobs looking very good.", "created_at": "Tue Oct 24 14:35:32 +0000 2017"}, {"text": "...the entire World WAS laughing and taking advantage of us. People like liddle' Bob Corker have set the U.S. way back. Now we move forward!", "created_at": "Tue Oct 24 14:20:46 +0000 2017"}, {"text": "Isn't it sad that lightweight Senator Bob Corker, who couldn't get re-elected in the Great State of Tennessee, will now fight Tax Cuts plus!", "created_at": "Tue Oct 24 13:30:21 +0000 2017"}, {"text": "...Corker dropped out of the race in Tennesse when I refused to endorse him, and now is only negative on anything Trump. Look at his record!", "created_at": "Tue Oct 24 12:20:35 +0000 2017"}, {"text": "I had a very respectful conversation with the widow of Sgt. La David Johnson, and spoke his name from beginning, without hesitation!", "created_at": "Mon Oct 23 12:30:10 +0000 2017"}, {"text": "There will be NO change to your 401(k). This has always been a great and popular middle class tax break that works, and it stays!", "created_at": "Mon Oct 23 11:42:56 +0000 2017"}, {"text": "It is finally sinking through. 46% OF PEOPLE BELIEVE MAJOR NATIONAL NEWS ORGS FABRICATE STORIES ABOUT ME. FAKE NEWS, even worse! Lost cred.", "created_at": "Sun Oct 22 12:08:47 +0000 2017"}, {"text": "Doing interview today with Maria Bartiromo at 10:00 A.M. on @FoxNews - ENJOY!", "created_at": "Sun Oct 22 11:50:39 +0000 2017"}, {"text": "...2nd Amendment, Strong Military, ISIS, historic VA improvement, Supreme Court Justice, Record Stock Market, lowest unemployment in 17 yrs!", "created_at": "Sun Oct 22 00:09:21 +0000 2017"}, {"text": "...9 months than this Administration. Over 50 Legislation approvals, massive regulation cuts, energy freedom, pipelines, border security....", "created_at": "Sun Oct 22 00:02:45 +0000 2017"}, {"text": "I agree getting Tax Cuts approved  is important (we will also get HealthCare), but perhaps no Administration has done more in its first.....", "created_at": "Sat Oct 21 23:57:41 +0000 2017"}, {"text": "Just out, but lightly reported: \"Fewest jobless claims since 1973 show firm U.S. Job Market\" Lowest since March 1973. @bpolitics", "created_at": "Sat Oct 21 22:51:57 +0000 2017"}, {"text": "Crooked Hillary Clinton spent hundreds of millions of dollars more on Presidential Election than I did. Facebook was on her side, not mine!", "created_at": "Sat Oct 21 21:21:08 +0000 2017"}, {"text": "Keep hearing about \"tiny\" amount of money spent on Facebook ads. What about the billions of dollars of Fake News on CNN, ABC, NBC &amp; CBS?", "created_at": "Sat Oct 21 20:06:00 +0000 2017"}, {"text": "Officials behind the now discredited \"Dossier\" plead the Fifth. Justice Department and/or FBI should immediately release who paid for it.", "created_at": "Sat Oct 21 19:59:23 +0000 2017"}, {"text": "Stock Market hits another all time high on Friday. 5.3 trillion dollars up since Election. Fake News doesn't spent much time on this!", "created_at": "Sat Oct 21 13:14:33 +0000 2017"}, {"text": "Subject to the receipt of further information, I will be allowing, as President, the long blocked and classified JFK FILES to be opened.", "created_at": "Sat Oct 21 12:35:05 +0000 2017"}, {"text": "I hope the Fake News Media keeps talking about Wacky Congresswoman Wilson in that she, as a representative, is killing the Democrat Party!", "created_at": "Sat Oct 21 12:07:16 +0000 2017"}, {"text": "Budget that just passed is a really big deal, especially in terms of what will be the biggest tax cut in U.S. history - MSM barely covered!", "created_at": "Sat Oct 21 11:52:56 +0000 2017"}, {"text": "Great book just out, \"A Place Called Heaven,\" by Dr. Robert Jeffress - A wonderful man!", "created_at": "Fri Oct 20 23:52:17 +0000 2017"}, {"text": "Just out report: \"United Kingdom crime rises 13% annually amid spread of Radical Islamic terror.\" Not good, we must keep America safe!", "created_at": "Fri Oct 20 10:31:50 +0000 2017"}, {"text": "....This now allows for the passage of large scale Tax Cuts (and Reform), which will be the biggest in the history of our country!", "created_at": "Fri Oct 20 10:15:45 +0000 2017"}, {"text": "The Budget passed late last night, 51 to 49. We got ZERO Democrat votes with only Rand Paul (he will vote for Tax Cuts) voting against.....", "created_at": "Fri Oct 20 10:11:15 +0000 2017"}, {"text": "Big ratings getter @seanhannity and Apprentice Champion John Rich are right now going on stage in Las Vegas for #VegasStrong. Great Show!", "created_at": "Fri Oct 20 03:00:42 +0000 2017"}, {"text": "The Fake News is going crazy with wacky Congresswoman Wilson(D), who was SECRETLY on a very personal call, and gave a total lie on content!", "created_at": "Fri Oct 20 02:53:42 +0000 2017"}, {"text": ".@foxandfriends \"Russia sent millions to Clinton Foundation\"", "created_at": "Thu Oct 19 12:21:18 +0000 2017"}, {"text": "Workers of firm involved with the discredited and Fake Dossier take the 5th. Who paid for it, Russia, the FBI or the Dems (or all)?", "created_at": "Thu Oct 19 11:56:15 +0000 2017"}, {"text": "Uranium deal to Russia, with Clinton help and Obama Administration knowledge, is the biggest story that Fake Media doesn't want to follow!", "created_at": "Thu Oct 19 11:17:52 +0000 2017"}, {"text": "Republicans are going for the big Budget approval today, first step toward massive tax cuts. I think we have the votes, but who knows?", "created_at": "Thu Oct 19 10:54:09 +0000 2017"}, {"text": ".@NFL: Too much talk, not enough action. Stand for the National Anthem.", "created_at": "Wed Oct 18 20:42:05 +0000 2017"}, {"text": "Democrat Congresswoman totally fabricated what I said to the wife of a soldier who died in action (and I have proof). Sad!", "created_at": "Wed Oct 18 11:25:24 +0000 2017"}, {"text": "The NFL has decided that it will not force players to stand for the playing of our National Anthem. Total disrespect for our great country!", "created_at": "Wed Oct 18 11:06:06 +0000 2017"}, {"text": "As it has turned out, James Comey lied and leaked and totally protected Hillary Clinton. He was the best thing that ever happened to her!", "created_at": "Wed Oct 18 10:56:36 +0000 2017"}, {"text": "The Democrats will only vote for Tax Increases. Hopefully, all Senate Republicans will vote for the largest Tax Cuts in U.S. history.", "created_at": "Wed Oct 18 10:38:18 +0000 2017"}, {"text": "...people not interviewed, including Clinton herself. Comey stated under oath that he didn't do this-obviously a fix? Where is Justice Dept?", "created_at": "Wed Oct 18 10:27:29 +0000 2017"}, {"text": "Wow, FBI confirms report that James Comey drafted letter exonerating  Crooked Hillary Clinton long before investigation was complete. Many..", "created_at": "Wed Oct 18 10:21:00 +0000 2017"}, {"text": "Any increase in ObamaCare premiums is the fault of the Democrats for giving us a \"product\" that never had a chance of working.", "created_at": "Tue Oct 17 21:56:08 +0000 2017"}, {"text": "So much Fake News being put in dying magazines and newspapers. Only place worse may be @NBCNews, @CBSNews, @ABC and @CNN. Fiction writers!", "created_at": "Tue Oct 17 21:51:34 +0000 2017"}, {"text": "Rep.Tom Marino has informed me that he is withdrawing his name from consideration as drug czar. Tom is a fine man and a great Congressman!", "created_at": "Tue Oct 17 12:39:45 +0000 2017"}, {"text": "I was recently asked if Crooked Hillary Clinton is going to run in 2020? My answer was, \"I hope so!\"", "created_at": "Mon Oct 16 13:12:43 +0000 2017"}, {"text": "The U.S. has gained more than 5.2 trillion dollars in Stock Market Value since Election Day! Also, record business enthusiasm.", "created_at": "Mon Oct 16 12:57:50 +0000 2017"}, {"text": "Dem Senator Schumer hated the Iran deal made by President Obama, but now that I am involved, he is OK with it. Tell that to Israel, Chuck!", "created_at": "Mon Oct 16 12:49:27 +0000 2017"}, {"text": "The Democrats only want to increase taxes and obstruct. That's all they are good at!", "created_at": "Mon Oct 16 12:21:49 +0000 2017"}, {"text": "Art Laffer just said that he doesn't know how a Democrat could vote against the big tax cut/reform bill and live with themselves!  @FoxNews", "created_at": "Mon Oct 16 12:17:10 +0000 2017"}, {"text": "The Democrats in the Southwest part of Virginia have been abandoned by their Party. Republican Ed Gillespie will never let you down!", "created_at": "Sat Oct 14 21:27:22 +0000 2017"}, {"text": "Very proud of my Executive Order which will allow greatly expanded access and far lower costs for HealthCare. Millions of people benefit!", "created_at": "Sat Oct 14 11:27:00 +0000 2017"}, {"text": "Health Insurance stocks, which have gone through the roof during the ObamaCare years, plunged yesterday after I ended their Dems windfall!", "created_at": "Sat Oct 14 11:18:49 +0000 2017"}, {"text": "Such a wonderful statement from the great @LouDobbs. \"We take up what may be the most accomplished presidency in modern American history.\"", "created_at": "Sat Oct 14 01:31:20 +0000 2017"}, {"text": "ObamaCare is causing such grief and tragedy for so many. It is being dismantled but in the meantime, premiums &amp; deductibles are way up!", "created_at": "Sat Oct 14 01:17:54 +0000 2017"}, {"text": "Many people talking, with much agreement, on my Iran speech today. Participants in the deal are making lots of money on trade with Iran!", "created_at": "Sat Oct 14 01:02:48 +0000 2017"}, {"text": "Starting to develop a much better relationship with Pakistan and its leaders. I want to thank them for their cooperation on many fronts.", "created_at": "Sat Oct 14 00:53:59 +0000 2017"}, {"text": "The wonderful people of Puerto Rico, with their unmatched spirit, know how bad things were before the H's. I will always be with them!", "created_at": "Fri Oct 13 12:01:02 +0000 2017"}, {"text": "Hard to believe that the Democrats, who have gone so far LEFT that they are no longer recognizable, are fighting so hard for Sanctuary crime", "created_at": "Fri Oct 13 11:51:30 +0000 2017"}, {"text": "ObamaCare is a broken mess. Piece by piece we will now begin the process of giving America the great HealthCare it deserves!", "created_at": "Fri Oct 13 11:14:12 +0000 2017"}, {"text": "The Democrats ObamaCare is imploding. Massive subsidy payments to their pet insurance companies has stopped. Dems should call me to fix!", "created_at": "Fri Oct 13 09:36:54 +0000 2017"}, {"text": "People are just now starting to find out how dishonest and disgusting (FakeNews) @NBCNews is. Viewers beware. May be worse than even @CNN!", "created_at": "Fri Oct 13 00:12:59 +0000 2017"}, {"text": "The Fake News Is going all out in order to demean and denigrate! Such hatred!", "created_at": "Thu Oct 12 12:45:29 +0000 2017"}, {"text": "...accountability say the Governor. Electric and all infrastructure was disaster before hurricanes. Congress to decide how much to spend....", "created_at": "Thu Oct 12 10:58:53 +0000 2017"}, {"text": "\"Puerto Rico survived the Hurricanes, now a financial crisis looms largely of their own making.\" says Sharyl Attkisson. A total lack of.....", "created_at": "Thu Oct 12 10:49:42 +0000 2017"}, {"text": "Clips from tax speech and @seanhannity on @foxandfriends now. Have a great day!", "created_at": "Thu Oct 12 10:04:11 +0000 2017"}, {"text": "Network news has become so partisan, distorted and fake that licenses must be challenged and, if appropriate, revoked. Not fair to public!", "created_at": "Thu Oct 12 00:09:42 +0000 2017"}, {"text": "I will be interviewed tonight on @FoxNews by @SeanHannity at 9pmE. Enjoy!", "created_at": "Wed Oct 11 21:32:07 +0000 2017"}, {"text": "Happy to announce we are awarding $1M to Las Vegas - in order to help local law enforcement working OT to respond to last Sunday’s tragedy.", "created_at": "Wed Oct 11 19:49:21 +0000 2017"}, {"text": "With all of the Fake News coming out of NBC and the Networks, at what point is it appropriate to challenge their License? Bad for country!", "created_at": "Wed Oct 11 13:55:44 +0000 2017"}, {"text": "Fake @NBCNews made up a story that I wanted a \"tenfold\" increase in our U.S. nuclear arsenal. Pure fiction, made up to demean. NBC = CNN!", "created_at": "Wed Oct 11 13:45:22 +0000 2017"}, {"text": "It is about time that Roger Goodell of the NFL is finally demanding that all players STAND for our great National Anthem-RESPECT OUR COUNTRY", "created_at": "Wed Oct 11 10:47:10 +0000 2017"}, {"text": "It would be really nice if the Fake News Media would report the virtually unprecedented Stock Market growth since the election.Need tax cuts", "created_at": "Wed Oct 11 10:31:18 +0000 2017"}, {"text": "...if Congress gives us the massive tax cuts (and reform) I am asking for, those numbers will grow by leaps and bounds. #MAGA", "created_at": "Wed Oct 11 10:26:50 +0000 2017"}, {"text": "Stock Market has increased by 5.2 Trillion dollars since the election on November 8th, a 25% increase. Lowest unemployment in 16 years and..", "created_at": "Wed Oct 11 10:21:15 +0000 2017"}, {"text": "...fired. This story is totally made up by the dishonest media.The Chief is doing a FANTASTIC job for me and, more importantly, for the USA!", "created_at": "Wed Oct 11 01:21:43 +0000 2017"}, {"text": "The Fake News is at it again, this time trying to hurt one of the finest people I know, General John Kelly, by saying he will soon be.....", "created_at": "Wed Oct 11 01:15:26 +0000 2017"}, {"text": "The Failing @nytimes set Liddle' Bob Corker up by recording his conversation. Was made to sound a fool, and that's what I am dealing with!", "created_at": "Tue Oct 10 12:50:55 +0000 2017"}, {"text": "Highly respected author, Christopher Bedford, just came out with book, \"The Art of the Donald, Lessons from America's....\" Really good book!", "created_at": "Tue Oct 10 12:13:54 +0000 2017"}, {"text": "With Jemele Hill at the mike, it is no wonder ESPN ratings have \"tanked,\" in fact, tanked so badly it is the talk of the industry!", "created_at": "Tue Oct 10 10:42:23 +0000 2017"}, {"text": "Since Congress can't get its act together on HealthCare, I will be using the power of the pen to give great HealthCare to many people - FAST", "created_at": "Tue Oct 10 10:30:28 +0000 2017"}, {"text": "The problem with agreeing to a policy on immigration is that the Democrats don't want secure borders,they don't care about safety for U.S.A.", "created_at": "Tue Oct 10 10:18:34 +0000 2017"}, {"text": "Why is the NFL getting massive tax breaks while at the same time disrespecting our Anthem, Flag and Country? Change tax law!", "created_at": "Tue Oct 10 10:13:47 +0000 2017"}, {"text": "A big salute to Jerry Jones, owner of the Dallas Cowboys, who will BENCH players who disrespect our Flag.\"Stand for Anthem or sit for game!\"", "created_at": "Tue Oct 10 01:51:32 +0000 2017"}, {"text": "The trip by @VP Pence was long planned. He is receiving great praise for leaving game after the players showed such disrespect for country!", "created_at": "Mon Oct 09 11:05:13 +0000 2017"}, {"text": "\"The Republican Party is racking up record amounts of small dollar donations - fueled by Trump supporters.....\"   @nypost  Thank you!", "created_at": "Sun Oct 08 23:58:43 +0000 2017"}, {"text": "FEMA and first responders are working hard (yet again) on Hurricane Nate. Military helping. Very much under control!", "created_at": "Sun Oct 08 19:49:32 +0000 2017"}, {"text": "I asked @VP Pence to leave stadium if any players kneeled, disrespecting our country. I am proud of him and @SecondLady Karen.", "created_at": "Sun Oct 08 18:16:16 +0000 2017"}, {"text": "...Hence, I would fully expect Corker to be a negative voice and stand in the way of our great agenda. Didn't have the guts to run!", "created_at": "Sun Oct 08 14:13:19 +0000 2017"}, {"text": "..my endorsement). He also wanted to be Secretary of State, I said \"NO THANKS.\" He is also largely responsible for the horrendous Iran Deal!", "created_at": "Sun Oct 08 14:09:00 +0000 2017"}, {"text": "Senator Bob Corker \"begged\" me to endorse him for re-election in Tennessee. I said \"NO\" and he dropped out (said he could not win without...", "created_at": "Sun Oct 08 13:59:58 +0000 2017"}, {"text": "Leaving the White House for the Great State of North Carolina. Big progress being made on many fronts!", "created_at": "Sat Oct 07 21:41:01 +0000 2017"}, {"text": "...hasn't worked, agreements violated before the ink was dry, makings fools of U.S. negotiators. Sorry, but only one thing will work!", "created_at": "Sat Oct 07 19:45:10 +0000 2017"}, {"text": "Presidents and their administrations have been talking to North Korea for 25 years, agreements made and massive amounts of money paid......", "created_at": "Sat Oct 07 19:40:17 +0000 2017"}, {"text": ".@NBCNews is so knowingly inaccurate with their reporting. The good news is that the PEOPLE get it, which is really all that matters! Not #1", "created_at": "Sat Oct 07 13:24:48 +0000 2017"}, {"text": "I called Chuck Schumer yesterday to see if the Dems want to do a great HealthCare Bill. ObamaCare is badly broken, big premiums. Who knows!", "created_at": "Sat Oct 07 12:17:47 +0000 2017"}, {"text": "More and more people are suggesting that Republicans (and me) should be given Equal Time on T.V. when you look at the one-sided coverage?", "created_at": "Sat Oct 07 12:04:05 +0000 2017"}, {"text": "...contributions. The RNC is taking in far more $'s than the Dems, and much of it by my wonderful small donors. I am working hard for them!", "created_at": "Sat Oct 07 11:11:50 +0000 2017"}, {"text": "Can't believe I finally got a good story in the @washingtonpost. It discusses the enthusiasm of \"Trump\" voters through campaign....", "created_at": "Sat Oct 07 11:05:56 +0000 2017"}, {"text": "Rex Tillerson never threatened to resign. This is Fake News put out by @NBCNews. Low news and reporting standards. No verification from me.", "created_at": "Thu Oct 05 11:50:56 +0000 2017"}, {"text": "Stock Market hits an ALL-TIME high! Unemployment lowest in 16 years! Business and manufacturing enthusiasm at highest level in decades!", "created_at": "Thu Oct 05 11:09:50 +0000 2017"}, {"text": "Why Isn't the Senate Intel Committee looking into the Fake News Networks in OUR country to see why so much of our news is just made up-FAKE!", "created_at": "Thu Oct 05 10:59:40 +0000 2017"}, {"text": "So wonderful to be in Las Vegas yesterday and meet with people, from police to doctors to the victims themselves, who I will never forget!", "created_at": "Thu Oct 05 10:44:19 +0000 2017"}, {"text": "I will be landing in Las Vegas shortly to pay my respects with @FLOTUS Melania. Everyone remains in our thoughts and prayers.", "created_at": "Wed Oct 04 15:49:17 +0000 2017"}, {"text": "The @NBCNews story has just been totally refuted by Sec. Tillerson and @VP Pence. It is #FakeNews. They should issue an apology to AMERICA!", "created_at": "Wed Oct 04 15:18:28 +0000 2017"}, {"text": "NBC news is #FakeNews and more dishonest than even CNN. They are a disgrace to good reporting. No wonder their news ratings are way down!", "created_at": "Wed Oct 04 14:47:53 +0000 2017"}, {"text": "Wow, so many Fake News stories today. No matter what I do or say, they will not write or speak truth. The Fake News Media is out of control!", "created_at": "Wed Oct 04 11:29:43 +0000 2017"}, {"text": "A great day in Puerto Rico yesterday. While some of the news coverage is Fake, most showed great warmth and friendship.", "created_at": "Wed Oct 04 10:25:58 +0000 2017"}, {"text": "It is a \"miracle\" how fast the Las Vegas Metropolitan Police were able to find the demented shooter and stop him from even more killing!", "created_at": "Wed Oct 04 00:20:48 +0000 2017"}, {"text": "I am so proud of our great Country. God bless America!", "created_at": "Tue Oct 03 11:40:47 +0000 2017"}, {"text": "My warmest condolences and sympathies to the victims and families of the terrible Las Vegas shooting. God bless you!", "created_at": "Mon Oct 02 11:11:37 +0000 2017"}, {"text": "Being nice to Rocket Man hasn't worked in 25 years, why would it work now? Clinton failed, Bush failed, and Obama failed. I won't fail.", "created_at": "Sun Oct 01 19:01:19 +0000 2017"}, {"text": "...Save your energy Rex, we'll do what has to be done!", "created_at": "Sun Oct 01 14:31:15 +0000 2017"}, {"text": "I told Rex Tillerson, our wonderful Secretary of State, that he is wasting his time trying to negotiate with Little Rocket Man...", "created_at": "Sun Oct 01 14:30:59 +0000 2017"}, {"text": "...for safety. Thank you to the Governor of P.R. and to all of those who are working so closely with our First Responders. Fantastic job!", "created_at": "Sun Oct 01 12:30:17 +0000 2017"}, {"text": "...people are now starting to recognize the amazing work that has been done by FEMA and our great Military. All buildings now inspected.....", "created_at": "Sun Oct 01 12:26:26 +0000 2017"}, {"text": "We have done a great job with the almost impossible situation in Puerto Rico. Outside of the Fake News or politically motivated ingrates,...", "created_at": "Sun Oct 01 12:22:14 +0000 2017"}, {"text": "In analyzing the Alabama Primary race,FAKE NEWS always fails to mention that the candidate I endorsed went up MANY points after endorsement!", "created_at": "Sat Sep 30 23:24:18 +0000 2017"}, {"text": "In analyzing the Alabama Primary race, Fake News always fails to mention that the candidate I endorsed went up MANY points after Election!", "created_at": "Sat Sep 30 23:16:31 +0000 2017"}, {"text": "Very important that NFL players STAND tomorrow, and always, for the playing of our National Anthem. Respect our Flag and our Country!", "created_at": "Sat Sep 30 22:26:55 +0000 2017"}, {"text": "Results of recovery efforts will speak much louder than complaints by San Juan Mayor. Doing everything we can to help great people of PR!", "created_at": "Sat Sep 30 20:37:10 +0000 2017"}, {"text": "We must all be united in offering assistance to everyone suffering in Puerto Rico and elsewhere in the wake of this terrible disaster.", "created_at": "Sat Sep 30 19:57:29 +0000 2017"}, {"text": "@ricardorossello ......#FakeNews critics are working overtime, but we're getting great marks from the people that truly matter! \n#PRStrong🇵🇷", "created_at": "Sat Sep 30 19:56:46 +0000 2017"}, {"text": "My Administration, Governor @RicardoRossello, and many others are working together to help the people of Puerto Rico in every way...", "created_at": "Sat Sep 30 19:55:20 +0000 2017"}, {"text": "To the people of Puerto Rico:\nDo not believe the #FakeNews!\n#PRStrong🇵🇷", "created_at": "Sat Sep 30 19:53:51 +0000 2017"}, {"text": "Congresswoman Jennifer Gonzalez-Colon of Puerto Rico has been wonderful to deal with and a great representative of the people. Thank you!", "created_at": "Sat Sep 30 19:43:54 +0000 2017"}, {"text": "Just spoke to Governor Kenneth Mapp of the U.S. Virgin Islands who stated that #FEMA and Military are doing a GREAT job! Thank you Governor!", "created_at": "Sat Sep 30 19:30:17 +0000 2017"}, {"text": "The Governor of Puerto Rico, Ricardo Rossello, is a great guy and leader who is really working hard. Thank you Ricky!", "created_at": "Sat Sep 30 19:19:36 +0000 2017"}, {"text": "Despite the Fake News Media in conjunction with the Dems, an amazing job is being done in Puerto Rico. Great people!", "created_at": "Sat Sep 30 18:04:59 +0000 2017"}, {"text": "The Fake News Networks are working overtime in Puerto Rico doing their best to take the spirit away from our soldiers and first R's. Shame!", "created_at": "Sat Sep 30 12:07:09 +0000 2017"}, {"text": "I will be going to Puerto Rico on Tuesday with Melania. Will hopefully be able to stop at the U.S. Virgin Islands (people working hard).", "created_at": "Sat Sep 30 11:55:46 +0000 2017"}, {"text": "Fake News CNN and NBC are going out of their way to disparage our great First Responders as a way to \"get Trump.\" Not fair to FR or effort!", "created_at": "Sat Sep 30 11:48:36 +0000 2017"}, {"text": "The military and first responders, despite no electric, roads, phones etc., have done an amazing job. Puerto Rico was totally destroyed.", "created_at": "Sat Sep 30 11:33:59 +0000 2017"}, {"text": "...want everything to be done for them when it should be a community effort. 10,000 Federal workers now on Island doing a fantastic job.", "created_at": "Sat Sep 30 11:29:47 +0000 2017"}, {"text": "...Such poor leadership ability by the Mayor of San Juan, and others in Puerto Rico, who are not able to get their workers to help. They....", "created_at": "Sat Sep 30 11:26:16 +0000 2017"}, {"text": "The Mayor of San Juan, who was very complimentary only a few days ago, has now been told by the Democrats that you must be nasty to Trump.", "created_at": "Sat Sep 30 11:19:14 +0000 2017"}, {"text": "RECORD HIGH FOR S &amp; P 500!", "created_at": "Fri Sep 29 13:39:53 +0000 2017"}, {"text": "...The fact is that Puerto Rico has been destroyed by two hurricanes. Big decisions will have to be made as to the cost of its rebuilding!", "created_at": "Fri Sep 29 11:18:55 +0000 2017"}, {"text": "Puerto Rico Governor Ricardo Rossello just stated: \"The Administration and the President, every time we've spoken, they've delivered......", "created_at": "Fri Sep 29 11:14:57 +0000 2017"}, {"text": "GDP was revised upward to 3.1 for last quarter. Many people thought it would be years before that happened. We have just begun!", "created_at": "Fri Sep 29 02:22:36 +0000 2017"}, {"text": "Puerto Rico is devastated. Phone system, electric grid many roads, gone. FEMA and First Responders are amazing. Governor said \"great job!\"", "created_at": "Fri Sep 29 00:03:09 +0000 2017"}, {"text": "...really hard to help but many have lost their homes. Military is now on site and I will be there Tuesday. Wish press would treat fairly!", "created_at": "Thu Sep 28 23:45:24 +0000 2017"}, {"text": "The electric power grid in Puerto Rico is totally shot. Large numbers of generators are now on Island. Food and water on site.", "created_at": "Thu Sep 28 14:01:16 +0000 2017"}, {"text": "Democrats don't want massive tax cuts - how does that win elections? Great reviews for Tax Cut and Reform Bill.", "created_at": "Thu Sep 28 11:55:48 +0000 2017"}, {"text": "..But the people were Pro-Trump! Virtually no President has accomplished what we have accomplished in the first 9 months-and economy roaring", "created_at": "Wed Sep 27 13:41:25 +0000 2017"}, {"text": "We will have the votes for Healthcare but not for the reconciliation deadline of Friday, after which we need 60. Get rid of Filibuster Rule!", "created_at": "Wed Sep 27 11:36:21 +0000 2017"}, {"text": "Spoke to Jerry Jones of the Dallas Cowboys yesterday. Jerry is a winner who knows how to get things done. Players will stand for Country!", "created_at": "Wed Sep 27 11:09:02 +0000 2017"}, {"text": "Spoke to Roy Moore of Alabama last night for the first time. Sounds like a really great guy who ran a fantastic race. He will help to #MAGA!", "created_at": "Wed Sep 27 10:56:53 +0000 2017"}, {"text": "Heading over to the @UN to meet with Ambassador @NikkiHaley and all of her great representatives! #USA🇺🇸", "created_at": "Tue Sep 26 20:43:27 +0000 2017"}, {"text": "ALABAMA, get out and vote for Luther Strange - he has proven to me that he will never let you down! #MAGA", "created_at": "Tue Sep 26 13:31:15 +0000 2017"}, {"text": "The NFL has all sorts of rules and regulations. The only way out for them is to set a rule that you can't kneel during our National Anthem!", "created_at": "Tue Sep 26 13:06:05 +0000 2017"}, {"text": "Thank you to Carmen Yulin Cruz, the Mayor of San Juan, for your kind words on FEMA etc.We are working hard. Much food and water there/on way", "created_at": "Tue Sep 26 12:13:00 +0000 2017"}, {"text": "Great interview on @foxandfriends with the parents of Otto Warmbier: 1994 - 2017. Otto was tortured beyond belief by North Korea.", "created_at": "Tue Sep 26 11:14:41 +0000 2017"}, {"text": "Luther Strange has been shooting up in the Alabama polls since my endorsement. Finish the job - vote today for \"Big Luther.\"", "created_at": "Tue Sep 26 10:55:47 +0000 2017"}, {"text": "But while Dallas dropped to its knees as a team, they all stood up for our National Anthem. Big progress being made-we all love our country!", "created_at": "Tue Sep 26 10:47:49 +0000 2017"}, {"text": "...But while Dallas dropped to it knees as a team, they ALL stood up for our National Anthem. Big progress being made - we love our country!", "created_at": "Tue Sep 26 10:41:50 +0000 2017"}, {"text": "The booing at the NFL football game last night, when the entire Dallas team dropped to its knees, was loudest I have ever heard. Great anger", "created_at": "Tue Sep 26 10:35:43 +0000 2017"}, {"text": "Ratings for NFL football are way down except before game starts, when people tune in to see whether or not our country will be disrespected!", "created_at": "Tue Sep 26 10:28:24 +0000 2017"}, {"text": "Big election tomorrow in the Great State of Alabama. Vote for Senator Luther Strange, tough on crime &amp; border - will never let you down!", "created_at": "Tue Sep 26 01:50:58 +0000 2017"}, {"text": "...owed to Wall Street and the banks which, sadly, must be dealt with. Food, water and medical are top priorities - and doing well. #FEMA", "created_at": "Tue Sep 26 00:58:50 +0000 2017"}, {"text": "...It's old electrical grid, which was in terrible shape, was devastated. Much of the Island was destroyed, with billions of dollars....", "created_at": "Tue Sep 26 00:50:40 +0000 2017"}, {"text": "Tremendous backlash against the NFL and its players for disrespect of our Country.\n#StandForOurAnthem🇺🇸", "created_at": "Mon Sep 25 22:29:18 +0000 2017"}, {"text": "General John Kelly totally agrees w/ my stance on NFL players and the fact that they should not be disrespecting our FLAG or GREAT COUNTRY!", "created_at": "Mon Sep 25 22:28:02 +0000 2017"}, {"text": ".@CNN is #FakeNews. Just reported COS (John Kelly) was opposed to my stance on NFL players disrespecting FLAG, ANTHEM, COUNTRY. Total lie!", "created_at": "Mon Sep 25 22:26:30 +0000 2017"}, {"text": "#StandForOurAnthem", "created_at": "Mon Sep 25 13:02:27 +0000 2017"}, {"text": "The issue of kneeling has nothing to do with race. It is about respect for our Country, Flag and National Anthem. NFL must respect this!", "created_at": "Mon Sep 25 11:39:03 +0000 2017"}, {"text": "Many people booed the players who kneeled yesterday (which was a small percentage of total). These are fans who demand respect for our Flag!", "created_at": "Mon Sep 25 11:31:43 +0000 2017"}, {"text": "So proud of NASCAR and its supporters and fans. They won't put up with disrespecting our Country or our Flag - they said it loud and clear!", "created_at": "Mon Sep 25 11:25:25 +0000 2017"}, {"text": "Sports fans should never condone players that do not stand proud for their National Anthem or their Country. NFL should change policy!", "created_at": "Sun Sep 24 22:25:20 +0000 2017"}, {"text": "Alaska, Arizona, Maine and Kentucky are big winners in the Healthcare proposal. 7 years of Repeal &amp; Replace and some Senators not there.", "created_at": "Sun Sep 24 22:21:43 +0000 2017"}, {"text": "Courageous Patriots have fought and died for our great American Flag --- we MUST honor and respect it!  MAKE AMERICA GREAT AGAIN!", "created_at": "Sun Sep 24 19:32:21 +0000 2017"}, {"text": "Please to inform that the Champion Pittsburgh Penguins of the NHL will be joining me at the White House for Ceremony. Great team!", "created_at": "Sun Sep 24 18:24:36 +0000 2017"}, {"text": "Great solidarity for our National Anthem and for our Country. Standing with locked arms is good, kneeling is not acceptable. Bad ratings!", "created_at": "Sun Sep 24 18:20:35 +0000 2017"}, {"text": "...NFL attendance and ratings are WAY DOWN. Boring games yes, but many stay away because they love our country. League should back U.S.", "created_at": "Sun Sep 24 11:13:11 +0000 2017"}, {"text": "Just heard Foreign Minister of North Korea speak at U.N. If he echoes thoughts of Little Rocket Man, they won't be around much longer!", "created_at": "Sun Sep 24 03:08:07 +0000 2017"}, {"text": "Roger Goodell of NFL just put out a statement trying to justify the total disrespect certain players show to our country.Tell them to stand!", "created_at": "Sat Sep 23 22:25:17 +0000 2017"}, {"text": "Democrats are laughingly saying that McCain had a \"moment of courage.\" Tell that to the people of Arizona who were deceived. 116% increase!", "created_at": "Sat Sep 23 22:20:47 +0000 2017"}, {"text": "Iran just test-fired a Ballistic Missile capable of reaching Israel.They are also working with North Korea.Not much of an agreement we have!", "created_at": "Sat Sep 23 21:59:04 +0000 2017"}, {"text": "...our Great American Flag (or Country) and should stand for the National Anthem. If not, YOU'RE FIRED. Find something else to do!", "created_at": "Sat Sep 23 18:18:19 +0000 2017"}, {"text": "If a player wants the privilege of making millions of dollars in the NFL,or other leagues, he or she should not be allowed to disrespect....", "created_at": "Sat Sep 23 18:11:10 +0000 2017"}, {"text": "Going to the White House is considered a great honor for a championship team.Stephen Curry is hesitating,therefore invitation is withdrawn!", "created_at": "Sat Sep 23 12:45:19 +0000 2017"}, {"text": "It was great being with Luther Strange last night in Alabama. What great people, what a crowd! Vote Luther on Tuesday.", "created_at": "Sat Sep 23 11:17:05 +0000 2017"}, {"text": "Alaska had a 200% plus increase in premiums under ObamaCare, worst in the country. Deductibles high, people angry! Lisa M comes through.", "created_at": "Sat Sep 23 11:13:35 +0000 2017"}, {"text": "I know Rand Paul and I think he may find a way to get there for the good of the Party!", "created_at": "Sat Sep 23 11:04:21 +0000 2017"}, {"text": "Arizona had a 116% increase in ObamaCare premiums last year, with deductibles very high. Chuck Schumer sold John McCain a bill of goods. Sad", "created_at": "Sat Sep 23 10:50:14 +0000 2017"}, {"text": "Heading to Alabama now, big crowd!", "created_at": "Fri Sep 22 21:18:37 +0000 2017"}, {"text": "Thank you to Doug Parker and American Airlines for all of the help you have given to the U.S. with Hurricane flights. Fantastic job!", "created_at": "Fri Sep 22 17:54:59 +0000 2017"}, {"text": "Will be in Alabama tonight. Luther Strange has gained mightily since my endorsement, but will be very close. He loves Alabama, and so do I!", "created_at": "Fri Sep 22 11:39:28 +0000 2017"}, {"text": "The greatest influence over our election was the Fake News Media \"screaming\" for Crooked Hillary Clinton. Next, she was a bad candidate!", "created_at": "Fri Sep 22 11:26:06 +0000 2017"}, {"text": "The Russia hoax continues, now it's ads on Facebook. What about the totally biased and dishonest Media coverage in favor of Crooked Hillary?", "created_at": "Fri Sep 22 10:44:47 +0000 2017"}, {"text": "Kim Jong Un of North Korea, who is obviously a madman who doesn't mind starving or killing his people, will be tested like never before!", "created_at": "Fri Sep 22 10:28:02 +0000 2017"}, {"text": "Rand Paul, or whoever votes against Hcare Bill, will forever (future political campaigns) be known as \"the Republican who saved ObamaCare.\"", "created_at": "Fri Sep 22 10:19:36 +0000 2017"}, {"text": "A big day for the U.S. at the United Nations!", "created_at": "Thu Sep 21 22:26:29 +0000 2017"}, {"text": "Senator Luther Strange has gone up a lot in the polls since I endorsed him a month ago. Now a close runoff. He will be great in D.C.", "created_at": "Thu Sep 21 22:23:44 +0000 2017"}, {"text": "Governor @RicardoRossello- \nWe are with you and the people of Puerto Rico. Stay safe! #PRStrong", "created_at": "Thu Sep 21 03:13:07 +0000 2017"}, {"text": "Senator (Doctor) Bill Cassidy is a class act who really cares about people and their Health(care), he doesn't lie-just wants to help people!", "created_at": "Thu Sep 21 01:06:25 +0000 2017"}, {"text": "The NRA strongly endorses Luther Strange for Senator of Alabama.That means all gun owners should vote for Big Luther. He won't let you down!", "created_at": "Thu Sep 21 00:42:17 +0000 2017"}, {"text": "I would not sign Graham-Cassidy if it did not include coverage of pre-existing conditions. It does! A great Bill. Repeal &amp; Replace.", "created_at": "Wed Sep 20 23:07:55 +0000 2017"}, {"text": "I hope Republican Senators will vote for Graham-Cassidy and fulfill their promise to Repeal &amp; Replace ObamaCare. Money direct to States!", "created_at": "Wed Sep 20 12:16:22 +0000 2017"}, {"text": "Rand Paul is a friend of mine but he is such a negative force when it comes to fixing healthcare. Graham-Cassidy Bill is GREAT! Ends Ocare!", "created_at": "Wed Sep 20 12:09:54 +0000 2017"}, {"text": "Thank you  @foxandfriends - great show!", "created_at": "Wed Sep 20 11:00:34 +0000 2017"}, {"text": "After allowing North Korea to research and build Nukes while Secretary of State (Bill C also), Crooked Hillary now criticizes.", "created_at": "Wed Sep 20 10:40:31 +0000 2017"}, {"text": "Big meetings today at the United Nations. So many interesting leaders. America First will MAKE AMERICA GREAT AGAIN!", "created_at": "Wed Sep 20 10:14:30 +0000 2017"}, {"text": "I was saddened to see how bad the ratings were on the Emmys last night - the worst ever. Smartest people of them all are the \"DEPLORABLES.\"", "created_at": "Wed Sep 20 02:41:13 +0000 2017"}, {"text": "A great and important day at the United Nations.Met with leaders of many nations who agree with much (or all) of what I stated in my speech!", "created_at": "Wed Sep 20 02:31:19 +0000 2017"}, {"text": "Puerto Rico being hit hard by new monster Hurricane. Be careful, our hearts are with you- will be there to help!", "created_at": "Wed Sep 20 02:23:52 +0000 2017"}, {"text": "God bless the people of Mexico City. We are with you and will be there for you.", "created_at": "Tue Sep 19 20:05:32 +0000 2017"}, {"text": "Big day at the United Nations - many good things, and some tricky ones, happening. We have a great team. Big speech at 10:00 A.M.", "created_at": "Tue Sep 19 11:21:30 +0000 2017"}, {"text": "Looking forward to meeting with Prime Minister @Netanyahu shortly. Peace in the Middle East would be a truly great legacy for ALL people!", "created_at": "Mon Sep 18 16:57:27 +0000 2017"}, {"text": "Important meetings and calls scheduled for today. Military and economy are getting stronger by the day, and our enemies know it. #MAGA", "created_at": "Sun Sep 17 13:00:05 +0000 2017"}, {"text": "I spoke with President Moon of South Korea last night. Asked him how Rocket Man is doing. Long gas lines forming in North Korea. Too bad!", "created_at": "Sun Sep 17 11:53:35 +0000 2017"}, {"text": "Attorney General Bill Schuette will be a fantastic Governor for the great State of Michigan. I am bringing back your jobs and Bill will help", "created_at": "Sun Sep 17 11:40:16 +0000 2017"}, {"text": "I will be in Huntsville, Alabama, on Saturday night to support Luther Strange for Senate. \"Big Luther\" is a great guy who gets things done!", "created_at": "Sat Sep 16 23:04:03 +0000 2017"}, {"text": "Attorney General Bill Shuette will be a fantastic Governor for the great State of Michigan. I am bringing back your jobs and Bill will help!", "created_at": "Sat Sep 16 22:59:06 +0000 2017"}, {"text": "A great deal of good things happening for our country. Jobs and Stock Market at all time highs, and I believe will be getting even better!", "created_at": "Sat Sep 16 22:40:23 +0000 2017"}, {"text": "CHAIN MIGRATION cannot be allowed to be part of any legislation on Immigration!", "created_at": "Fri Sep 15 13:00:48 +0000 2017"}, {"text": "ESPN is paying a really big price for its politics (and bad programming). People are dumping it in RECORD numbers. Apologize for untruth!", "created_at": "Fri Sep 15 11:20:08 +0000 2017"}, {"text": "The travel ban into the United States should be far larger, tougher and more specific-but stupidly, that would not be politically correct!", "created_at": "Fri Sep 15 10:54:14 +0000 2017"}, {"text": "Another attack in London by a loser terrorist.These are sick and demented people who were in the sights of Scotland Yard. Must be proactive!", "created_at": "Fri Sep 15 10:42:55 +0000 2017"}, {"text": "With the ridiculous Filibuster Rule in the Senate, Republicans need 60 votes to pass legislation, rather than 51. Can't get votes, END NOW!", "created_at": "Fri Sep 15 10:37:38 +0000 2017"}, {"text": "Bernie Sanders is pushing hard for a single payer healthcare plan - a curse on the U.S. &amp; its people...", "created_at": "Thu Sep 14 19:31:55 +0000 2017"}, {"text": "Spoke to President of Mexico to give condolences on terrible earthquake. Unable to reach for 3 days b/c of his cell phone reception at site.", "created_at": "Thu Sep 14 19:18:14 +0000 2017"}, {"text": "Just left Florida for D.C. The people and spirit in THAT GREAT STATE is unbelievable. Damage horrific but will be better than ever!", "created_at": "Thu Sep 14 19:04:22 +0000 2017"}, {"text": "Am leaving now for Florida to see our GREAT first responders and to thank the U.S. Coast Guard, FEMA etc. A real disaster, much work to do!", "created_at": "Thu Sep 14 11:05:55 +0000 2017"}, {"text": "...They have been in our country for many years through no fault of their own - brought in by parents at young age. Plus BIG border security", "created_at": "Thu Sep 14 10:35:41 +0000 2017"}, {"text": "Does anybody really want to throw out good, educated and accomplished young people who have jobs, some serving in the military? Really!.....", "created_at": "Thu Sep 14 10:28:41 +0000 2017"}, {"text": "The WALL, which is already under construction in the form of new renovation of old and existing fences and walls, will continue to be built.", "created_at": "Thu Sep 14 10:20:58 +0000 2017"}, {"text": "No deal was made last night on DACA. Massive border security would have to be agreed to in exchange for consent. Would be subject to vote.", "created_at": "Thu Sep 14 10:11:36 +0000 2017"}, {"text": "The \"deplorables\" came back to haunt Hillary.They expressed their feelings loud and clear. She spent big money but, in the end, had no game!", "created_at": "Thu Sep 14 02:52:34 +0000 2017"}, {"text": "Crooked Hillary Clinton blames everybody (and every thing) but herself for her election loss. She lost the debates and lost her direction!", "created_at": "Thu Sep 14 02:47:23 +0000 2017"}, {"text": "China has a business tax rate of 15%. We should do everything possible to match them in order to win with our economy. Jobs and wages!", "created_at": "Thu Sep 14 02:22:57 +0000 2017"}, {"text": "With Irma and Harvey devastation, Tax Cuts and Tax Reform is needed more than ever before. Go Congress, go!", "created_at": "Wed Sep 13 12:36:52 +0000 2017"}, {"text": "I will be traveling to Florida tomorrow to meet with our great Coast Guard, FEMA and many of the brave first responders &amp; others.", "created_at": "Wed Sep 13 11:34:16 +0000 2017"}, {"text": "The approval process for the biggest Tax Cut &amp; Tax Reform package in the history of our country will soon begin. Move fast Congress!", "created_at": "Wed Sep 13 11:28:10 +0000 2017"}, {"text": "The devastation left by Hurricane Irma was far greater, at least in certain locations,than anyone thought - but amazing people working hard!", "created_at": "Tue Sep 12 13:11:19 +0000 2017"}, {"text": "Fascinating to watch people writing books and major articles about me and yet they know nothing about me &amp; have zero access. #FAKE NEWS!", "created_at": "Tue Sep 12 12:56:47 +0000 2017"}, {"text": "The U.S. Coast Guard, FEMA and all Federal and State brave people are ready. Here comes Irma. God bless everyone!", "created_at": "Sun Sep 10 02:56:37 +0000 2017"}, {"text": "Churches in Texas should be entitled to reimbursement from FEMA Relief Funds for helping victims of Hurricane Harvey (just like others).", "created_at": "Sat Sep 09 00:56:47 +0000 2017"}, {"text": "Republicans must start the Tax Reform/Tax Cut legislation ASAP. Don't wait until the end of September. Needed now more than ever. Hurry!", "created_at": "Fri Sep 08 12:57:11 +0000 2017"}, {"text": "...never allow the Republicans to pass even great legislation. 8 Dems control - will rarely get 60 (vs. 51) votes. It is a Repub Death Wish!", "created_at": "Fri Sep 08 12:46:35 +0000 2017"}, {"text": "Our incredible U.S. Coast Guard saved more than 15,000 lives last week with Harvey. Irma could be even tougher. We love our Coast Guard!", "created_at": "Fri Sep 08 12:37:14 +0000 2017"}, {"text": "Hurricane Irma is of epic proportion, perhaps bigger than we have ever seen. Be safe and get out of its way,if possible. Federal G is ready!", "created_at": "Fri Sep 08 12:34:13 +0000 2017"}, {"text": "We will confront ANY challenge, no matter how strong the winds or high the water. I’m proud to stand with Presidents for #OneAmericaAppeal.", "created_at": "Fri Sep 08 01:33:38 +0000 2017"}, {"text": "For all of those (DACA) that are concerned about your status during the 6 month period, you have nothing to worry about - No action!", "created_at": "Thu Sep 07 13:42:52 +0000 2017"}, {"text": "Hurricane Irma is raging but we have great teams of talented and brave people already in place and ready to help. Be careful, be safe! #FEMA", "created_at": "Thu Sep 07 12:33:12 +0000 2017"}, {"text": "Hurricane looks like largest ever recorded in the Atlantic!", "created_at": "Wed Sep 06 10:53:45 +0000 2017"}, {"text": "Watching Hurricane closely. My team, which has done, and is doing, such a good job in Texas, is already in Florida. No rest for the weary!", "created_at": "Wed Sep 06 10:51:52 +0000 2017"}, {"text": "Will be going to North Dakota today to discuss tax reform and tax cuts. We are the highest taxed nation in the world - that will change.", "created_at": "Wed Sep 06 10:47:01 +0000 2017"}, {"text": "Congress now has 6 months to legalize DACA (something the Obama Administration was unable to do). If they can't, I will revisit this issue!", "created_at": "Wed Sep 06 00:38:27 +0000 2017"}, {"text": "I look forward to working w/ D's + R's in Congress to address immigration reform in a way that puts hardworking citizens of our country 1st.", "created_at": "Tue Sep 05 20:45:27 +0000 2017"}, {"text": "Congress, get ready to do your job - DACA!", "created_at": "Tue Sep 05 12:04:43 +0000 2017"}, {"text": "Big week coming up!", "created_at": "Tue Sep 05 02:49:26 +0000 2017"}, {"text": "The United States is considering, in addition to other options, stopping all trade with any country doing business with North Korea.", "created_at": "Sun Sep 03 16:14:31 +0000 2017"}, {"text": "I will be meeting General Kelly, General Mattis and other military leaders at the White House to discuss North Korea. Thank you.", "created_at": "Sun Sep 03 16:07:32 +0000 2017"}, {"text": "South Korea is finding, as I have told them, that their talk of appeasement with North Korea will not work, they only understand one thing!", "created_at": "Sun Sep 03 11:46:07 +0000 2017"}, {"text": "..North Korea is a rogue nation which has become a great threat and embarrassment to China, which is trying to help but with little success.", "created_at": "Sun Sep 03 11:39:38 +0000 2017"}, {"text": "North Korea has conducted a major Nuclear Test. Their words and actions continue to be very hostile and dangerous to the United States.....", "created_at": "Sun Sep 03 11:30:41 +0000 2017"}, {"text": "Remember, Sunday is National Prayer Day (by Presidential Proclamation)!", "created_at": "Sun Sep 03 03:02:31 +0000 2017"}, {"text": "The Manufacturing Index rose to 59%, the highest level since early 2011 - and we can do much better!", "created_at": "Sun Sep 03 02:50:58 +0000 2017"}, {"text": "I will be going to Texas and Louisiana tomorrow with First Lady. Great progress being made! Spending weekend working at White House.", "created_at": "Sat Sep 02 00:03:00 +0000 2017"}, {"text": "Stock Market up 5 months in a row!", "created_at": "Fri Sep 01 23:47:38 +0000 2017"}, {"text": "...get things done at a record clip. Many big decisions to be made over the coming days and weeks. AMERICA FIRST!", "created_at": "Fri Sep 01 12:47:46 +0000 2017"}, {"text": "General John Kelly is doing a great job as Chief of Staff. I could not be happier or more impressed - and this Administration continues to..", "created_at": "Fri Sep 01 12:35:27 +0000 2017"}, {"text": "Wow, looks like James Comey exonerated Hillary Clinton long before the investigation was over...and so much more. A rigged system!", "created_at": "Fri Sep 01 11:56:45 +0000 2017"}, {"text": "Will be leaving for Missouri soon for a speech on tax cuts and tax reform - so badly needed!", "created_at": "Wed Aug 30 13:42:20 +0000 2017"}, {"text": "After reading the false reporting and even ferocious anger in some dying magazines, it makes me wonder, WHY? All I want to do is #MAGA!", "created_at": "Wed Aug 30 13:27:47 +0000 2017"}, {"text": "The U.S. has been talking to North Korea, and paying them extortion money, for 25 years. Talking is not the answer!", "created_at": "Wed Aug 30 12:47:52 +0000 2017"}, {"text": ".@foxandfriends   We are not looking to fill all of those positions. Don't need many of them - reduce size of government. @IngrahamAngle", "created_at": "Tue Aug 29 12:26:55 +0000 2017"}, {"text": "Leaving now for Texas!", "created_at": "Tue Aug 29 12:10:30 +0000 2017"}, {"text": "HISTORIC rainfall in Houston, and all over Texas. Floods are unprecedented, and more rain coming. Spirit of the people is incredible.Thanks!", "created_at": "Sun Aug 27 23:01:06 +0000 2017"}, {"text": "Major rescue operations underway!", "created_at": "Sun Aug 27 14:39:32 +0000 2017"}, {"text": "Going to a Cabinet Meeting (tele-conference) at 11:00 A.M. on #Harvey. Even experts have said they've never seen one like this!", "created_at": "Sun Aug 27 14:31:35 +0000 2017"}, {"text": "With Mexico being one of the highest crime Nations in the world, we must have THE WALL. Mexico will pay for it through reimbursement/other.", "created_at": "Sun Aug 27 13:44:11 +0000 2017"}, {"text": "Wow - Now experts are calling #Harvey a once in 500 year flood! We have an all out effort going, and going well!", "created_at": "Sun Aug 27 13:25:50 +0000 2017"}, {"text": "I will also be going to a wonderful state, Missouri, that I won by a lot in '16. Dem C.M. is opposed to big tax cuts. Republican will win S!", "created_at": "Sun Aug 27 13:15:18 +0000 2017"}, {"text": "I will be going to Texas as soon as that trip can be made without causing disruption. The focus must be life and safety.", "created_at": "Sun Aug 27 12:59:56 +0000 2017"}, {"text": "Many people are now saying that this is the worst storm/hurricane they have ever seen. Good news is that we have great talent on the ground.", "created_at": "Sun Aug 27 12:25:54 +0000 2017"}, {"text": "Great coordination between agencies at all levels of government. Continuing rains and flash floods are being dealt with. Thousands rescued.", "created_at": "Sun Aug 27 12:04:05 +0000 2017"}, {"text": "Wonderful coordination between Federal, State and Local Governments in the Great State of Texas - TEAMWORK! Record setting rainfall.", "created_at": "Sat Aug 26 22:57:22 +0000 2017"}, {"text": "Closely monitoring #HurricaneHarvey from Camp David. We are leaving nothing to chance. City, State and Federal Govs. working great together!", "created_at": "Sat Aug 26 11:52:19 +0000 2017"}, {"text": ".@ChuckGrassley - got your message loud and clear. We have fantastic people on the ground, got there long before #Harvey. So far, so good!", "created_at": "Sat Aug 26 11:32:44 +0000 2017"}, {"text": "I am pleased to inform you that I have just granted a full Pardon to 85 year old American patriot Sheriff Joe Arpaio. He kept Arizona safe!", "created_at": "Sat Aug 26 02:00:33 +0000 2017"}, {"text": "At the request of the Governor of Texas, I have signed the Disaster Proclamation, which unleashes the full force of government help!", "created_at": "Sat Aug 26 01:46:26 +0000 2017"}, {"text": "Storm turned Hurricane is getting much bigger and more powerful than projected. Federal Government is on site and ready to respond. Be safe!", "created_at": "Fri Aug 25 22:12:11 +0000 2017"}, {"text": "Just arrived at Camp David, where I am monitoring the path and doings of Hurricane Harvey (as it strengthens to a Class 3). 125 MPH winds!", "created_at": "Fri Aug 25 21:12:08 +0000 2017"}, {"text": "Just arrived at Camp David where I am closely watching the path and doings of Hurricane Harvey, as it strengthens to a Category 3. BE SAFE!", "created_at": "Fri Aug 25 21:03:11 +0000 2017"}, {"text": "Strange statement by Bob Corker considering that he is constantly asking me whether or not he should run again in '18. Tennessee not happy!", "created_at": "Fri Aug 25 12:25:10 +0000 2017"}, {"text": "Nick Adams, \"Retaking America\"  \"Best things of this presidency aren't reported about. Convinced this will be perhaps best presidency ever.\"", "created_at": "Fri Aug 25 11:32:23 +0000 2017"}, {"text": "Few, if any, Administrations have done more in just 7 months than the Trump A. Bills passed, regulations killed, border, military, ISIS, SC!", "created_at": "Fri Aug 25 10:44:17 +0000 2017"}, {"text": "General John Kelly is doing a fantastic job as Chief of Staff. There is tremendous spirit and talent in the W.H. Don't believe the Fake News", "created_at": "Fri Aug 25 10:40:32 +0000 2017"}, {"text": "If Senate Republicans don't get rid of the Filibuster Rule and go to a 51% majority, few bills will be passed. 8 Dems control the Senate!", "created_at": "Fri Aug 25 10:33:32 +0000 2017"}, {"text": "James Clapper, who famously got caught lying to Congress, is now an authority on Donald Trump. Will he show you his beautiful letter to me?", "created_at": "Thu Aug 24 13:15:22 +0000 2017"}, {"text": "..(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong). Too bad the Dems have no one who can change tones!", "created_at": "Thu Aug 24 13:15:00 +0000 2017"}, {"text": "James Clapper, who famously got caught lying to Congress, is now an authority on Donald Trump. Will he show you his beautiful letter to me?", "created_at": "Thu Aug 24 13:10:20 +0000 2017"}, {"text": "...(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong). To bad the Dems have no one who can change tones!", "created_at": "Thu Aug 24 13:07:49 +0000 2017"}, {"text": "The Fake News is now complaining about my different types of back to back speeches. Well, there was Afghanistan (somber), the big Rally.....", "created_at": "Thu Aug 24 13:07:34 +0000 2017"}, {"text": "...(enthusiastic, dynamic and fun) and the American Legion - V.A. (respectful and strong).To bad the Dems have no one who can change tones!", "created_at": "Thu Aug 24 12:51:03 +0000 2017"}, {"text": "The Fake News is now complaining about my different types of back to back speeches. Well, their was Afghanistan (somber), the big Rally.....", "created_at": "Thu Aug 24 12:41:14 +0000 2017"}, {"text": "...didn't do it so now we have a big deal with Dems holding them up (as usual) on Debt Ceiling approval. Could have been so easy-now a mess!", "created_at": "Thu Aug 24 12:25:03 +0000 2017"}, {"text": "Last night in Phoenix I read the things from my statements on Charlottesville that the Fake News Media didn't cover fairly. People got it!", "created_at": "Wed Aug 23 13:40:31 +0000 2017"}, {"text": "Was with great people last night in Fort Myer, Virginia. The future of our country is strong!", "created_at": "Tue Aug 22 10:46:29 +0000 2017"}, {"text": "Jerry Falwell of Liberty University was fantastic on @foxandfriends. The Fake News should listen to what he had to say. Thanks Jerry!", "created_at": "Mon Aug 21 13:27:12 +0000 2017"}, {"text": "Heading back to Washington after working hard and watching some of the worst and most dishonest Fake News reporting I have ever seen!", "created_at": "Sun Aug 20 23:22:07 +0000 2017"}, {"text": "I want to applaud the many protestors in Boston who are speaking out against bigotry and hate. Our country will soon come together as one!", "created_at": "Sat Aug 19 20:41:49 +0000 2017"}, {"text": "Great job by all law enforcement officers and Boston Mayor @Marty_Walsh.", "created_at": "Sat Aug 19 19:29:29 +0000 2017"}, {"text": "Looks like many anti-police agitators in Boston. Police are looking tough and smart! Thank you.", "created_at": "Sat Aug 19 19:22:47 +0000 2017"}, {"text": "Steve Bannon will be a tough and smart new voice at @BreitbartNews...maybe even better than ever before. Fake News needs the competition!", "created_at": "Sat Aug 19 17:47:26 +0000 2017"}, {"text": "Important day spent at Camp David with our very talented Generals and military leaders. Many decisions made, including on Afghanistan.", "created_at": "Sat Aug 19 11:47:31 +0000 2017"}, {"text": "I want to thank Steve Bannon for his service. He came to the campaign during my run against Crooked Hillary Clinton - it was great! Thanks S", "created_at": "Sat Aug 19 11:33:51 +0000 2017"}, {"text": "My thoughts and prayers are with the @KissimmeePolice and their loved ones. We are with you!\n#LESM", "created_at": "Sat Aug 19 04:59:01 +0000 2017"}, {"text": "Heading to Camp David for major meeting on National Security, the Border and the Military (which we are rapidly building to strongest ever).", "created_at": "Fri Aug 18 14:09:24 +0000 2017"}, {"text": "Radical Islamic Terrorism must be stopped by whatever means necessary! The courts must give us back our protective rights. Have to be tough!", "created_at": "Fri Aug 18 13:06:13 +0000 2017"}, {"text": "The Obstructionist Democrats make Security for our country very difficult. They use the courts and associated delay at all times. Must stop!", "created_at": "Fri Aug 18 12:55:33 +0000 2017"}, {"text": "Study what General Pershing of the United States did to terrorists when caught. There was no more Radical Islamic Terror for 35 years!", "created_at": "Thu Aug 17 18:45:14 +0000 2017"}, {"text": "...the beauty that is being taken out of our cities, towns and parks will be greatly missed and never able to be comparably replaced!", "created_at": "Thu Aug 17 13:21:45 +0000 2017"}, {"text": "...can't change history, but you can learn from it. Robert E Lee, Stonewall Jackson - who's next, Washington, Jefferson? So foolish! Also...", "created_at": "Thu Aug 17 13:15:58 +0000 2017"}, {"text": "Sad to see the history and culture of our great country being ripped apart with the removal of our beautiful statues and monuments. You.....", "created_at": "Thu Aug 17 13:07:28 +0000 2017"}, {"text": "Many meetings today in Bedminster including with Secretary Linda M and Small Business. Job numbers are looking great!", "created_at": "Thu Aug 17 12:59:02 +0000 2017"}, {"text": "Great to see that Dr. Kelli Ward is running against Flake Jeff Flake, who is WEAK on borders, crime and a non-factor in Senate. He's toxic!", "created_at": "Thu Aug 17 10:56:33 +0000 2017"}, {"text": "The public is learning (even more so) how dishonest the Fake News is. They totally misrepresent what I say about hate, bigotry etc. Shame!", "created_at": "Thu Aug 17 10:32:11 +0000 2017"}, {"text": "...and people like Ms. Heyer. Such a disgusting lie. He just can't forget his election trouncing.The people of South Carolina will remember!", "created_at": "Thu Aug 17 10:24:05 +0000 2017"}, {"text": "Memorial service today for beautiful and incredible Heather Heyer, a truly special young woman. She will be long remembered by all!", "created_at": "Wed Aug 16 14:58:14 +0000 2017"}, {"text": "Wow, Senator Luther Strange picked up a lot of additional support since my endorsement. Now in September runoff. Strong on Wall &amp; Crime!", "created_at": "Wed Aug 16 14:51:36 +0000 2017"}, {"text": "MAKE AMERICA GREAT AGAIN!", "created_at": "Wed Aug 16 12:39:07 +0000 2017"}, {"text": "Kim Jong Un of North Korea made a very wise and well reasoned decision. The alternative would have been both catastrophic and unacceptable!", "created_at": "Wed Aug 16 11:39:34 +0000 2017"}, {"text": "Congratulation to Roy Moore and Luther Strange for being the final two and heading into a September runoff in Alabama. Exciting race!", "created_at": "Wed Aug 16 10:18:14 +0000 2017"}, {"text": "Amazon is doing great damage to tax paying retailers. Towns, cities and states throughout the U.S. are being hurt - many jobs being lost!", "created_at": "Wed Aug 16 10:12:45 +0000 2017"}, {"text": "For every CEO that drops out of the Manufacturing Council, I have many to take their place. Grandstanders should not have gone on. JOBS!", "created_at": "Tue Aug 15 15:21:08 +0000 2017"}, {"text": "Big day in Alabama. Vote for Luther Strange, he will be great!", "created_at": "Tue Aug 15 12:08:01 +0000 2017"}, {"text": "@foxandfriends According to report just out, President Obama knew about Russian interference 3 years ago but he didn't want to anger Russia!", "created_at": "Tue Aug 15 10:54:32 +0000 2017"}, {"text": "Senator Luther Strange, who is doing a great job for the people of Alabama, will be on @foxandfriends at 7:15. Tough on crime, borders etc.", "created_at": "Tue Aug 15 10:30:55 +0000 2017"}, {"text": "Feels good to be home after seven months, but the White House is very special, there is no place like it... and the U.S. is really my home!", "created_at": "Tue Aug 15 03:06:52 +0000 2017"}, {"text": "Made additional remarks on Charlottesville and realize once again that the #Fake News Media will never be satisfied...truly bad people!", "created_at": "Mon Aug 14 22:29:00 +0000 2017"}, {"text": "Leaving for New York City and meetings on military purchases and trade.", "created_at": "Mon Aug 14 22:22:17 +0000 2017"}, {"text": "Big day in Washington, D.C., even though White House &amp; Oval Office are being renovated. Great trade deals coming for American workers!", "created_at": "Mon Aug 14 22:17:11 +0000 2017"}, {"text": "Now that Ken Frazier of Merck Pharma has resigned from President's Manufacturing Council,he will have more time to LOWER RIPOFF DRUG PRICES!", "created_at": "Mon Aug 14 12:54:47 +0000 2017"}, {"text": "The Obstructionist Democrats have given us (or not fixed) some of the worst trade deals in World History. I am changing that fast!", "created_at": "Mon Aug 14 10:54:08 +0000 2017"}, {"text": "Heading to Washington this morning. Much work to do. Focus on trade and military. #MAGA", "created_at": "Mon Aug 14 10:26:09 +0000 2017"}, {"text": "Condolences to the family of the young woman killed today, and best regards to all of those injured, in Charlottesville, Virginia. So sad!", "created_at": "Sat Aug 12 23:25:25 +0000 2017"}, {"text": "Military solutions are now fully in place,locked and loaded,should North Korea act unwisely.  Hopefully Kim Jong Un will find another path!", "created_at": "Fri Aug 11 11:29:31 +0000 2017"}, {"text": ".@IvankaTrump will lead the U.S. delegation to India this fall, supporting women’s entrepreneurship globally.\n#GES2017 @narendramodi", "created_at": "Thu Aug 10 20:18:30 +0000 2017"}, {"text": "...Hopefully we will never have to use this power, but there will never be a time that we are not the most powerful nation in the world!", "created_at": "Wed Aug 09 12:03:21 +0000 2017"}, {"text": "My first order as President was to renovate and modernize our nuclear arsenal. It is now far stronger and more powerful than ever before....", "created_at": "Wed Aug 09 11:56:33 +0000 2017"}, {"text": "Senator Luther Strange has done a great job representing the people of the Great State of Alabama. He has my complete and total endorsement!", "created_at": "Wed Aug 09 01:16:33 +0000 2017"}, {"text": "After 200 days, rarely has any Administration achieved what we have achieved..not even close! Don't believe the Fake News Suppression Polls!", "created_at": "Tue Aug 08 18:10:18 +0000 2017"}, {"text": "E-mails show that the AmazonWashingtonPost and the FailingNewYorkTimes were reluctant to cover the Clinton/Lynch secret meeting in plane.", "created_at": "Tue Aug 08 18:00:30 +0000 2017"}, {"text": "I will be holding a major briefing on the Opioid crisis, a major problem for our country, today at 3:00 P.M. in Bedminster, N.J.", "created_at": "Tue Aug 08 11:11:49 +0000 2017"}, {"text": "I think Senator Blumenthal should take a nice long vacation in Vietnam, where he lied about his service, so he can at least say he was there", "created_at": "Mon Aug 07 20:48:54 +0000 2017"}, {"text": "How much longer will the failing nytimes, with its big losses and massive unfunded liability (and non-existent sources), remain in business?", "created_at": "Mon Aug 07 20:39:46 +0000 2017"}, {"text": "The Fake News Media will not talk about the importance of the United Nations Security Council's 15-0 vote in favor of sanctions on N. Korea!", "created_at": "Mon Aug 07 20:15:18 +0000 2017"}, {"text": "...conquests, how brave he was, and it was all a lie. He cried like a baby and begged for forgiveness like a child. Now he judges collusion?", "created_at": "Mon Aug 07 12:01:20 +0000 2017"}, {"text": "Never in U.S.history has anyone lied or defrauded voters like Senator Richard Blumenthal. He told stories about his Vietnam battles and....", "created_at": "Mon Aug 07 11:52:32 +0000 2017"}, {"text": "Interesting to watch Senator Richard Blumenthal of Connecticut talking about hoax Russian collusion when he was a  phony Vietnam con artist!", "created_at": "Mon Aug 07 11:47:36 +0000 2017"}, {"text": "Working hard from New Jersey while White House goes through long planned renovation. Going to New York next week for more meetings.", "created_at": "Mon Aug 07 11:32:56 +0000 2017"}, {"text": "Hard to believe that with 24/7 #Fake News on CNN, ABC, NBC, CBS, NYTIMES &amp; WAPO, the Trump base is getting stronger!", "created_at": "Mon Aug 07 11:18:05 +0000 2017"}, {"text": "...and West Virginia. The fact is the Fake News Russian collusion story, record Stock Market, border security, military strength, jobs.....", "created_at": "Mon Aug 07 11:04:19 +0000 2017"}, {"text": "The failing @nytimes, which has made every wrong prediction about me including my big election win (apologized), is totally inept!", "created_at": "Mon Aug 07 10:38:32 +0000 2017"}, {"text": "Just completed call with President Moon of South Korea. Very happy and impressed with 15-0 United Nations vote on North Korea sanctions.", "created_at": "Mon Aug 07 01:22:08 +0000 2017"}, {"text": "United Nations Resolution is the single largest economic sanctions package ever on North Korea. Over one billion dollars in cost to N.K.", "created_at": "Sat Aug 05 23:14:18 +0000 2017"}, {"text": "After many years of LEAKS going on in Washington, it is great to see the A.G. taking action! For National Security, the tougher the better!", "created_at": "Sat Aug 05 22:58:17 +0000 2017"}, {"text": "The United Nations Security Council just voted 15-0 to sanction North Korea. China and Russia voted with us. Very big financial impact!", "created_at": "Sat Aug 05 22:44:34 +0000 2017"}, {"text": "Working in Bedminster, N.J., as long planned construction is being done at the White House. This is not a vacation - meetings and calls!", "created_at": "Sat Aug 05 22:36:51 +0000 2017"}, {"text": "Excellent Jobs Numbers just released - and I have only just begun. Many job stifling regulations continue to fall. Movement back to USA!", "created_at": "Fri Aug 04 12:45:50 +0000 2017"}, {"text": "West Virginia was incredible last night. Crowds and enthusiasm were beyond, GDP at 3%, wow!Dem Governor became a Republican last night.", "created_at": "Fri Aug 04 10:35:31 +0000 2017"}, {"text": "....and don't forget that Foxconn will be spending up to 10 billion dollars on a top of the line plant/plants in Wisconsin.", "created_at": "Fri Aug 04 10:21:34 +0000 2017"}, {"text": "Just arrived in West Virginia for a MAKE AMERICA GREAT AGAIN rally in Huntington at 7:00pmE. Massive crowd expected - tune in! #MAGA🇺🇸", "created_at": "Thu Aug 03 22:52:16 +0000 2017"}, {"text": "Business is looking better than ever with business enthusiasm at record levels. Stock Market at an all-time high. That doesn't just happen!", "created_at": "Thu Aug 03 12:08:54 +0000 2017"}, {"text": "I love the White House, one of the most beautiful buildings (homes) I have ever seen. But Fake News said I called it a dump - TOTALLY UNTRUE", "created_at": "Thu Aug 03 01:29:46 +0000 2017"}, {"text": "Only the Fake News Media and Trump enemies want me to stop using Social Media (110 million people). Only way for me to get the truth out!", "created_at": "Tue Aug 01 13:55:19 +0000 2017"}, {"text": "\"Corporations have NEVER made as much money as they are making now.\" Thank you Stuart Varney @foxandfriends Jobs are starting to roar,watch!", "created_at": "Tue Aug 01 13:03:59 +0000 2017"}, {"text": "Stock Market could hit all-time high (again) 22,000 today. Was 18,000 only 6 months ago on Election Day. Mainstream media seldom mentions!", "created_at": "Tue Aug 01 12:49:22 +0000 2017"}, {"text": "A great day at the White House!", "created_at": "Mon Jul 31 22:19:11 +0000 2017"}, {"text": "Highest Stock Market EVER, best economic numbers in years, unemployment lowest in 17 years, wages raising, border secure, S.C.: No WH chaos!", "created_at": "Mon Jul 31 12:28:00 +0000 2017"}, {"text": "...they do NOTHING for us with North Korea, just talk. We will no longer allow this to continue. China could easily solve this problem!", "created_at": "Sat Jul 29 23:35:13 +0000 2017"}, {"text": "I am very disappointed in China. Our foolish past leaders have allowed them to make hundreds of billions of dollars a year in trade, yet...", "created_at": "Sat Jul 29 23:29:05 +0000 2017"}, {"text": "I love reading about all of the \"geniuses\" who were so instrumental in my election success. Problem is, most don't exist. #Fake News! MAGA", "created_at": "Sat Jul 29 23:15:57 +0000 2017"}, {"text": "Unless the Republican Senators are total quitters, Repeal &amp; Replace is not dead! Demand another vote before voting on any other bill!", "created_at": "Sat Jul 29 20:36:52 +0000 2017"}, {"text": "U.S. Stock Market up almost 20% since Election!", "created_at": "Sat Jul 29 17:04:20 +0000 2017"}, {"text": "If a new HealthCare Bill is not approved quickly, BAILOUTS for Insurance Companies and BAILOUTS for Members of Congress will end very soon!", "created_at": "Sat Jul 29 16:27:39 +0000 2017"}, {"text": "If the Senate Democrats ever got the chance, they would switch to a 51 majority vote in first minute. They are laughing at R's. MAKE CHANGE!", "created_at": "Sat Jul 29 11:47:13 +0000 2017"}, {"text": "....8 Dems totally control the U.S. Senate. Many great Republican bills will never pass, like Kate's Law and complete Healthcare. Get smart!", "created_at": "Sat Jul 29 11:39:25 +0000 2017"}, {"text": "Republicans in the Senate will NEVER win if they don't go to a 51 vote majority NOW. They look like fools and are just wasting time......", "created_at": "Sat Jul 29 11:32:52 +0000 2017"}, {"text": "The very outdated filibuster rule must go. Budget reconciliation is killing R's in Senate. Mitch M, go to 51 Votes NOW and WIN. IT'S TIME!", "created_at": "Sat Jul 29 11:28:57 +0000 2017"}, {"text": "Republican Senate must get rid of 60 vote NOW! It is killing the R Party, allows 8 Dems to control country. 200 Bills sit in Senate. A JOKE!", "created_at": "Sat Jul 29 11:20:29 +0000 2017"}, {"text": "I would like to thank Reince Priebus for his service and dedication to his country. We accomplished a lot together and I am proud of him!", "created_at": "Fri Jul 28 21:00:19 +0000 2017"}, {"text": "...and a Great Leader. John has also done a spectacular job at Homeland Security. He has been a true star of my Administration", "created_at": "Fri Jul 28 20:54:43 +0000 2017"}, {"text": "I am pleased to inform you that I have just named General/Secretary John F Kelly as White House Chief of Staff. He is a Great American....", "created_at": "Fri Jul 28 20:49:51 +0000 2017"}, {"text": "If Republicans are going to pass great future legislation in the Senate, they must immediately go to a 51 vote majority, not senseless 60...", "created_at": "Fri Jul 28 13:46:28 +0000 2017"}, {"text": "3 Republicans and 48 Democrats let the American people down. As I said from the beginning, let ObamaCare implode, then deal. Watch!", "created_at": "Fri Jul 28 06:25:33 +0000 2017"}, {"text": "Go Republican Senators, Go! Get there after waiting for 7 years. Give America great healthcare!", "created_at": "Fri Jul 28 02:43:30 +0000 2017"}, {"text": "Big progress being made in ridding our country of MS-13 gang members and gang members in general. MAKE AMERICA SAFE AGAIN!", "created_at": "Thu Jul 27 18:37:44 +0000 2017"}, {"text": "...about then candidate Trump.\" Catherine Herridge @FoxNews. So why doesn't Fake News report this? Witch Hunt! Purposely phony reporting.", "created_at": "Thu Jul 27 13:45:22 +0000 2017"}, {"text": "\"One of the things that has been lost in the politics of this situation is that the Russians collected and spread negative information.....", "created_at": "Thu Jul 27 13:35:35 +0000 2017"}, {"text": "Come on Republican Senators, you can do it on Healthcare. After 7 years, this is your chance to shine! Don't let the American people down!", "created_at": "Thu Jul 27 11:24:52 +0000 2017"}, {"text": "Wow, the Failing @nytimes said about @foxandfriends \"....the most powerful T.V. show in America.\"", "created_at": "Thu Jul 27 10:48:53 +0000 2017"}, {"text": "...big dollars ($700,000) for his wife's political run from Hillary Clinton and her representatives. Drain the Swamp!", "created_at": "Wed Jul 26 13:52:57 +0000 2017"}, {"text": "Why didn't A.G. Sessions replace Acting FBI Director Andrew McCabe, a Comey friend who was in charge of Clinton investigation but got....", "created_at": "Wed Jul 26 13:48:02 +0000 2017"}, {"text": "....victory and cannot be burdened with the tremendous medical costs and disruption that transgender in the military would entail. Thank you", "created_at": "Wed Jul 26 13:08:21 +0000 2017"}, {"text": "....Transgender individuals to  serve in any capacity in the U.S. Military. Our military must be focused on decisive and overwhelming.....", "created_at": "Wed Jul 26 13:04:39 +0000 2017"}, {"text": "After consultation with my Generals and military experts, please be advised that the United States Government will not accept or allow......", "created_at": "Wed Jul 26 12:55:58 +0000 2017"}, {"text": "Senator @lisamurkowski of the Great State of Alaska really let the Republicans, and our country, down yesterday. Too bad!", "created_at": "Wed Jul 26 11:13:28 +0000 2017"}, {"text": "The crowd in Ohio was amazing last night - broke all records. We all had a great time in a great State. Will be back soon!", "created_at": "Wed Jul 26 10:49:28 +0000 2017"}, {"text": ".@SenJohnMcCain-Thank you for coming to D.C. for such a vital vote. Congrats to all Rep. We can now deliver grt healthcare to all Americans!", "created_at": "Tue Jul 25 19:24:40 +0000 2017"}, {"text": "Will be traveling to the Great State of Ohio tonight. Big crowd expected. See you there!", "created_at": "Tue Jul 25 12:29:03 +0000 2017"}, {"text": "This will be a very interesting day for HealthCare.The Dems are obstructionists but the Republicans can have a great victory for the people!", "created_at": "Tue Jul 25 12:19:29 +0000 2017"}, {"text": "Jared Kushner did very well yesterday in proving he did not collude with the Russians. Witch Hunt. Next up, 11 year old Barron Trump!", "created_at": "Tue Jul 25 10:52:27 +0000 2017"}, {"text": "So great that John McCain is coming back to vote. Brave - American hero! Thank you John.", "created_at": "Tue Jul 25 10:44:06 +0000 2017"}, {"text": "Big day for HealthCare. After 7 years of talking, we will soon see whether or not Republicans are willing to step up to the plate!", "created_at": "Tue Jul 25 10:27:47 +0000 2017"}, {"text": "Ukrainian efforts to sabotage Trump campaign - \"quietly working to boost Clinton.\" So where is the investigation A.G. @seanhannity", "created_at": "Tue Jul 25 10:03:33 +0000 2017"}, {"text": "Is Fake News Washington Post being used as a lobbyist weapon against Congress to keep Politicians from looking into Amazon no-tax monopoly?", "created_at": "Tue Jul 25 02:36:17 +0000 2017"}, {"text": "So many stories about me in the @washingtonpost are Fake News. They are as bad as ratings challenged @CNN. Lobbyist for Amazon and taxes?", "created_at": "Tue Jul 25 02:28:44 +0000 2017"}, {"text": "The Amazon Washington Post fabricated the facts on my ending massive, dangerous, and wasteful payments to Syrian rebels fighting Assad.....", "created_at": "Tue Jul 25 02:23:18 +0000 2017"}, {"text": "Republicans have a last chance to do the right thing on Repeal &amp; Replace after years of talking &amp; campaigning on it.", "created_at": "Mon Jul 24 13:18:07 +0000 2017"}, {"text": "Sleazy Adam Schiff, the totally biased Congressman looking into \"Russia,\" spends all of his time on television pushing the Dem loss excuse!", "created_at": "Mon Jul 24 13:12:59 +0000 2017"}, {"text": "After 1 year of investigation with Zero evidence being found, Chuck Schumer just stated that \"Democrats should blame ourselves,not Russia.\"", "created_at": "Mon Jul 24 10:52:39 +0000 2017"}, {"text": "Drain the Swamp should be changed to Drain the Sewer - it's actually much worse than anyone ever thought, and it begins with the Fake News!", "created_at": "Mon Jul 24 10:40:28 +0000 2017"}, {"text": "Thank you to @LOUDOBBS for giving the first six months of the Trump Administration an A+. S.C.,reg cutting,Stock M, jobs,border etc. = TRUE!", "created_at": "Mon Jul 24 00:23:40 +0000 2017"}, {"text": "If Republicans don't Repeal and Replace the disastrous ObamaCare, the repercussions will be far greater than any of them understand!", "created_at": "Mon Jul 24 00:01:47 +0000 2017"}, {"text": "It's hard to read the Failing New York Times or the Amazon Washington Post because every story/opinion, even if should be positive, is bad!", "created_at": "Sun Jul 23 23:57:36 +0000 2017"}, {"text": "It's very sad that Republicans, even some that were carried over the line on my back, do very little to protect their President.", "created_at": "Sun Jul 23 20:14:32 +0000 2017"}, {"text": "As the phony Russian Witch Hunt continues, two groups are laughing at this excuse for a lost election taking hold, Democrats and Russians!", "created_at": "Sun Jul 23 20:09:05 +0000 2017"}, {"text": "ObamaCare is dead and the Democrats are obstructionists, no ideas or votes, only obstruction. It is solely up to the 52 Republican Senators!", "created_at": "Sat Jul 22 12:23:30 +0000 2017"}, {"text": "The Republican Senators must step up to the plate and, after 7 years, vote to Repeal and Replace. Next, Tax Reform and Infrastructure. WIN!", "created_at": "Sat Jul 22 12:17:54 +0000 2017"}, {"text": "In all fairness to Anthony Scaramucci, he wanted to endorse me 1st, before the Republican Primaries started, but didn't think I was running!", "created_at": "Sat Jul 22 12:10:41 +0000 2017"}, {"text": "...What about all of the Clinton ties to Russia, including Podesta Company, Uranium deal, Russian Reset, big dollar speeches etc.", "created_at": "Sat Jul 22 11:47:53 +0000 2017"}, {"text": "So many people are asking why isn't the A.G. or Special Council looking at the many Hillary Clinton or Comey crimes. 33,000 e-mails deleted?", "created_at": "Sat Jul 22 11:44:29 +0000 2017"}, {"text": "While all agree the U. S. President has the complete power to pardon, why think of that when only crime so far is LEAKS against us.FAKE NEWS", "created_at": "Sat Jul 22 11:35:34 +0000 2017"}, {"text": "This morning I will be going to the Commissioning Ceremony for the largest aircraft carrier in the world, The Gerald R. Ford.  Norfolk, Va.", "created_at": "Sat Jul 22 10:52:00 +0000 2017"}, {"text": "The Failing New York Times foiled U.S. attempt to kill the single most wanted terrorist,Al-Baghdadi.Their sick agenda over National Security", "created_at": "Sat Jul 22 10:45:05 +0000 2017"}, {"text": "A new INTELLIGENCE LEAK from the Amazon Washington Post,this time against A.G. Jeff Sessions.These illegal leaks, like Comey's, must stop!", "created_at": "Sat Jul 22 10:33:01 +0000 2017"}, {"text": "Sean Spicer is a wonderful person who took tremendous abuse from the Fake News Media - but his future is bright!", "created_at": "Sat Jul 22 01:46:33 +0000 2017"}, {"text": "I will be having lunch at the White House today with Republican Senators concerning healthcare. They MUST keep their promise to America!", "created_at": "Wed Jul 19 12:30:22 +0000 2017"}, {"text": "The Fake News is becoming more and more dishonest! Even a dinner arranged for top 20 leaders in Germany is made to look sinister!", "created_at": "Wed Jul 19 00:59:56 +0000 2017"}, {"text": "Fake News story of secret dinner with Putin is \"sick.\" All G 20 leaders, and spouses, were invited by the Chancellor of Germany. Press knew!", "created_at": "Wed Jul 19 00:53:12 +0000 2017"}, {"text": "The Senate must go to a 51 vote majority instead of current 60 votes. Even parts of full Repeal need 60. 8 Dems control Senate. Crazy!", "created_at": "Tue Jul 18 13:26:47 +0000 2017"}, {"text": "As I have always said, let ObamaCare fail and then come together and do a great healthcare plan. Stay tuned!", "created_at": "Tue Jul 18 11:58:22 +0000 2017"}, {"text": "Most politicians would have gone to a meeting like the one Don jr attended in order to get info on an opponent. That's politics!", "created_at": "Mon Jul 17 14:07:55 +0000 2017"}, {"text": "Heading back to Washington, D.C. Much will be accomplished this week on trade, the military and security!", "created_at": "Mon Jul 17 00:24:28 +0000 2017"}, {"text": "Congratulations to Sung Hyun Park on winning the 2017 @USGA #USWomensOpen🇺🇸", "created_at": "Mon Jul 17 00:22:50 +0000 2017"}, {"text": "I am at the @USGA  #USWomensOpen. An amateur player is co-leading for the first time in many decades - very exciting!", "created_at": "Sun Jul 16 21:00:03 +0000 2017"}, {"text": "The ABC/Washington Post Poll, even though almost 40% is not bad at this time, was just about the most inaccurate poll around election time!", "created_at": "Sun Jul 16 14:10:25 +0000 2017"}, {"text": "Thank you to former campaign adviser Michael Caputo for saying so powerfully that there was no Russian collusion in our winning campaign.", "created_at": "Sun Jul 16 11:04:07 +0000 2017"}, {"text": "Thank you to all of the supporters, who far out-numbered the protesters, yesterday at the Women's U.S. Open. Very cool!", "created_at": "Sun Jul 16 10:51:12 +0000 2017"}, {"text": "Just got to the #USWomensOpen in Bedminster, New Jersey. People are really happy with record high stock market - up over 17% since election!", "created_at": "Sat Jul 15 20:29:54 +0000 2017"}, {"text": "Will be at the Women's U.S. Open today!", "created_at": "Sat Jul 15 16:33:34 +0000 2017"}, {"text": "Stock Market hit another all-time high yesterday - despite the Russian hoax story! Also, jobs numbers are starting to look very good!", "created_at": "Sat Jul 15 16:30:23 +0000 2017"}, {"text": "Stock Market at new all-time high! Working on new trade deals that will be great for U.S. and its workers!", "created_at": "Sat Jul 15 16:21:12 +0000 2017"}, {"text": "Just landed from Paris, France. It was an incredible visit with President @EmmanuelMacron. A lot discussed and accomplished in two days!", "created_at": "Fri Jul 14 22:22:58 +0000 2017"}, {"text": "Left Paris for U.S.A. Will be heading to New Jersey and attending the\n#USWomensOpen, their most important tournament, this afternoon.", "created_at": "Fri Jul 14 14:16:34 +0000 2017"}, {"text": "Great conversations with President @EmmanuelMacron and his representatives on trade, military and security.", "created_at": "Fri Jul 14 13:47:19 +0000 2017"}, {"text": ".@VP Mike Pence is working hard on HealthCare and getting our wonderful Republican Senators to do what is right for the people.", "created_at": "Fri Jul 14 08:09:05 +0000 2017"}, {"text": "After all of these years of suffering thru ObamaCare, Republican Senators must come through as they have promised!", "created_at": "Fri Jul 14 08:07:29 +0000 2017"}, {"text": "So impt Rep Senators, under leadership of @SenateMajLdr McConnell get healthcare plan approved. After 7yrs of O'Care disaster, must happen!", "created_at": "Fri Jul 14 08:05:36 +0000 2017"}, {"text": "Republicans Senators are working hard to get their failed ObamaCare replacement approved. I will be at my desk, pen in hand!", "created_at": "Fri Jul 14 07:57:33 +0000 2017"}, {"text": "The W.H. is functioning perfectly, focused on HealthCare, Tax Cuts/Reform &amp; many other things. I have very little time for watching T.V.", "created_at": "Wed Jul 12 13:39:25 +0000 2017"}, {"text": "Why aren't the same standards placed on the Democrats. Look what Hillary Clinton may have gotten away with. Disgraceful!", "created_at": "Wed Jul 12 13:27:03 +0000 2017"}, {"text": ".@WashTimes states \"Democrats have willfully used Moscow disinformation to influence the presidential election against Donald Trump.\"", "created_at": "Wed Jul 12 12:12:42 +0000 2017"}, {"text": "Remember, when you hear the words \"sources say\" from the Fake Media, often times those sources are made up and do not exist.", "created_at": "Wed Jul 12 10:32:56 +0000 2017"}, {"text": "My son Donald did a good job last night. He was open, transparent and innocent. This is the greatest Witch Hunt in political history. Sad!", "created_at": "Wed Jul 12 10:19:32 +0000 2017"}, {"text": "My son, Donald, will be interviewed by @seanhannity tonight at 10:00 P.M. He is a great person who loves our country!", "created_at": "Wed Jul 12 00:24:10 +0000 2017"}, {"text": "Big wins against ISIS!", "created_at": "Tue Jul 11 12:23:45 +0000 2017"}, {"text": "Marine Plane crash in Mississippi is heartbreaking. Melania and I send our deepest condolences to all!", "created_at": "Tue Jul 11 12:09:22 +0000 2017"}, {"text": "Working hard to get the Olympics for the United States (L.A.). Stay tuned!", "created_at": "Tue Jul 11 11:46:00 +0000 2017"}, {"text": "The Senate Democrats have only confirmed 48 of 197 Presidential Nominees. They  can't win so all they do is slow things down &amp; obstruct!", "created_at": "Tue Jul 11 10:59:58 +0000 2017"}, {"text": "If Chelsea Clinton were asked to hold the seat for her mother,as her mother gave our country away, the Fake News would say CHELSEA FOR PRES!", "created_at": "Mon Jul 10 11:47:49 +0000 2017"}, {"text": "When I left Conference Room for short meetings with Japan and other countries, I asked Ivanka to hold seat. Very standard. Angela M agrees!", "created_at": "Mon Jul 10 11:31:33 +0000 2017"}, {"text": "I cannot imagine that Congress would dare to leave Washington without a beautiful new HealthCare bill fully approved and ready to go!", "created_at": "Mon Jul 10 10:47:33 +0000 2017"}, {"text": "James Comey leaked CLASSIFIED INFORMATION to the media. That is so illegal!", "created_at": "Mon Jul 10 10:40:16 +0000 2017"}, {"text": "Syrian ceasefire seems to be holding. Many lives can be saved. Came out of meeting. Good!", "created_at": "Sun Jul 09 20:09:52 +0000 2017"}, {"text": "For years, even as a \"civilian,\" I listened as Republicans pushed the Repeal and Replace of ObamaCare. Now they finally have their chance!", "created_at": "Sun Jul 09 20:07:11 +0000 2017"}, {"text": "Sanctions were not discussed at my meeting with President Putin. Nothing will be done until the Ukrainian &amp; Syrian problems are solved!", "created_at": "Sun Jul 09 12:31:23 +0000 2017"}, {"text": "...have it. Fake News said 17 intel agencies when actually 4 (had to apologize). Why did Obama do NOTHING when he had info before election?", "created_at": "Sun Jul 09 12:06:30 +0000 2017"}, {"text": "...We negotiated a ceasefire in parts of Syria which will save lives. Now it is time to move forward in working constructively with Russia!", "created_at": "Sun Jul 09 11:37:42 +0000 2017"}, {"text": "I strongly pressed President Putin twice about Russian meddling in our election. He vehemently denied it. I've already given my opinion.....", "created_at": "Sun Jul 09 11:31:22 +0000 2017"}, {"text": "The G 20 Summit was a great success for the U.S. - Explained that the U.S. must fix the many bad trade deals it has made. Will get done!", "created_at": "Sun Jul 09 11:15:58 +0000 2017"}, {"text": "The #G20Summit was a wonderful success and carried out beautifully by Chancellor Angela Merkel. Thank you!", "created_at": "Sat Jul 08 18:20:56 +0000 2017"}, {"text": "I will represent our country well and fight for its interests! Fake News Media will never cover me accurately but who cares! We will #MAGA!", "created_at": "Fri Jul 07 07:44:07 +0000 2017"}, {"text": "I look forward to all meetings today with world leaders, including my meeting with Vladimir Putin. Much to discuss.\n#G20Summit #USA🇺🇸", "created_at": "Fri Jul 07 07:42:37 +0000 2017"}, {"text": "Everyone here is talking about why John Podesta refused to give the DNC server to the FBI and the CIA. Disgraceful!", "created_at": "Fri Jul 07 07:40:42 +0000 2017"}, {"text": "After Poland had a great meeting with Chancellor Merkel and then with PM Shinzō Abe of Japan &amp; President Moon of South Korea.", "created_at": "Fri Jul 07 07:07:20 +0000 2017"}, {"text": "My experience yesterday in Poland was a great one. Thank you to everyone, including the haters, for the great reviews of the speech!", "created_at": "Fri Jul 07 06:59:02 +0000 2017"}, {"text": "Trade between China and North Korea grew almost 40% in the first quarter. So much for China working with us - but we had to give it a try!", "created_at": "Wed Jul 05 11:21:23 +0000 2017"}, {"text": "The United States made some of the worst Trade Deals in world history.Why should we continue these deals with countries that do not help us?", "created_at": "Wed Jul 05 11:14:11 +0000 2017"}, {"text": "Getting ready to leave for Poland, after which I will travel to Germany for the G-20. Will be back on Saturday.", "created_at": "Wed Jul 05 10:51:59 +0000 2017"}, {"text": "Gas prices are the lowest in the U.S. in over ten years! I would like to see them go even lower.", "created_at": "Tue Jul 04 19:55:28 +0000 2017"}, {"text": "Getting ready to celebrate the 4th of July with a big crowd at the White House. Happy 4th to everyone. Our country will grow and prosper!", "created_at": "Tue Jul 04 19:49:16 +0000 2017"}, {"text": "....and Japan will put up with this much longer. Perhaps China will put a heavy move on North Korea and end this nonsense once and for all!", "created_at": "Tue Jul 04 02:24:39 +0000 2017"}, {"text": "North Korea has just launched another missile. Does this guy have anything better to do with his life? Hard to believe that South Korea.....", "created_at": "Tue Jul 04 02:19:02 +0000 2017"}, {"text": "Dow hit a new intraday all-time high! I wonder whether or not the Fake News Media will so report?", "created_at": "Mon Jul 03 21:10:25 +0000 2017"}, {"text": "Thank you to Shawn Steel for the nice words on @FoxNews.", "created_at": "Mon Jul 03 20:44:27 +0000 2017"}, {"text": "If we can help little #CharlieGard, as per our friends in the U.K. and the Pope, we would be delighted to do so.", "created_at": "Mon Jul 03 14:00:21 +0000 2017"}, {"text": "Will be speaking with Italy this morning!", "created_at": "Mon Jul 03 11:38:20 +0000 2017"}, {"text": "Spoke yesterday with the King of Saudi Arabia about peace in the Middle-East. Interesting things are happening!", "created_at": "Mon Jul 03 11:19:08 +0000 2017"}, {"text": "Will be speaking with Germany and France this morning.", "created_at": "Mon Jul 03 11:00:56 +0000 2017"}, {"text": "Stock Market at all time high, unemployment at lowest level in years (wages will start going up) and our base has never been stronger!", "created_at": "Sun Jul 02 23:55:23 +0000 2017"}, {"text": "My use of social media is not Presidential - it’s MODERN DAY PRESIDENTIAL. Make America Great Again!", "created_at": "Sat Jul 01 22:41:58 +0000 2017"}, {"text": "I am thinking about changing the name #FakeNews CNN to #FraudNewsCNN!", "created_at": "Sat Jul 01 22:08:37 +0000 2017"}, {"text": "....the 2016 election with interviews, speeches and social media. I had to beat #FakeNews, and did. We will continue to WIN!", "created_at": "Sat Jul 01 22:02:27 +0000 2017"}, {"text": "Crazy Joe Scarborough and dumb as a rock Mika are not bad people, but their low rated show is dominated by their NBC bosses. Too bad!", "created_at": "Sat Jul 01 13:20:35 +0000 2017"}, {"text": "I am extremely pleased to see that @CNN has finally been exposed as #FakeNews and garbage journalism. It's about time!", "created_at": "Sat Jul 01 13:12:40 +0000 2017"}, {"text": "Numerous states are refusing to give information to the very distinguished VOTER FRAUD PANEL. What are they trying to hide?", "created_at": "Sat Jul 01 13:07:05 +0000 2017"}, {"text": "Happy Canada Day to all of the great people of Canada and to your Prime Minister and my new found friend @JustinTrudeau. #Canada150", "created_at": "Sat Jul 01 12:44:23 +0000 2017"}, {"text": "Watched low rated @Morning_Joe for first time in long time. FAKE NEWS. He called me to stop a National Enquirer article. I said no! Bad show", "created_at": "Fri Jun 30 12:55:08 +0000 2017"}, {"text": "Crime and killings in Chicago have reached such epidemic proportions that I am sending in Federal help. 1714 shootings in Chicago this year!", "created_at": "Fri Jun 30 10:48:38 +0000 2017"}, {"text": "If Republican Senators are unable to pass what they are working on now, they should immediately REPEAL, and then REPLACE at a later date!", "created_at": "Fri Jun 30 10:37:57 +0000 2017"}, {"text": "Just finished a very good meeting with the President of South Korea. Many subjects discussed including North Korea and new trade deal!", "created_at": "Fri Jun 30 01:44:01 +0000 2017"}, {"text": "Good news out of the House with the passing of 'No Sanctuary for Criminals Act.' Hopefully Senate will follow.", "created_at": "Thu Jun 29 22:28:23 +0000 2017"}, {"text": "Good news, House just passed #KatesLaw. Hopefully Senate will follow.", "created_at": "Thu Jun 29 21:37:02 +0000 2017"}, {"text": "...to Mar-a-Lago 3 nights in a row around New Year's Eve, and insisted on joining me. She was bleeding badly from a face-lift. I said no!", "created_at": "Thu Jun 29 12:58:23 +0000 2017"}, {"text": "I heard poorly rated @Morning_Joe speaks badly of me (don't watch anymore). Then how come low I.Q. Crazy Mika, along with Psycho Joe, came..", "created_at": "Thu Jun 29 12:52:17 +0000 2017"}, {"text": "New Sugar deal negotiated with Mexico is a very good one for both Mexico and the U.S. Had no deal for many years which hurt U.S. badly.", "created_at": "Thu Jun 29 12:27:35 +0000 2017"}, {"text": "The #AmazonWashingtonPost, sometimes referred to as the guardian of Amazon not paying internet taxes (which they should) is FAKE NEWS!", "created_at": "Wed Jun 28 13:06:14 +0000 2017"}, {"text": "The failing @nytimes writes false story after false story about me. They don't even call to verify the facts of a story. A Fake News Joke!", "created_at": "Wed Jun 28 10:49:22 +0000 2017"}, {"text": "I just finished a great meeting with the Republican Senators concerning HealthCare. They really want to get it right, unlike OCare!", "created_at": "Tue Jun 27 22:27:48 +0000 2017"}, {"text": "With ZERO Democrats to help, and a failed, expensive and dangerous ObamaCare as the Dems legacy, the Republican Senators are working hard!", "created_at": "Tue Jun 27 22:22:55 +0000 2017"}, {"text": "Fake News CNN is looking at big management changes now that they got caught falsely pushing their phony Russian stories. Ratings way down!", "created_at": "Tue Jun 27 12:30:38 +0000 2017"}, {"text": "Wow, CNN had to retract big story on \"Russia,\" with 3 employees forced to resign. What about all the other phony stories they do? FAKE NEWS!", "created_at": "Tue Jun 27 10:33:42 +0000 2017"}, {"text": "From @FoxNews \"Bombshell: In 2016, Obama dismissed idea that anyone could rig an American election.\"  Check out his statement - Witch Hunt!", "created_at": "Tue Jun 27 02:24:30 +0000 2017"}, {"text": "Very grateful for the 9-O decision from the U. S. Supreme Court. We must keep America SAFE!", "created_at": "Mon Jun 26 18:25:18 +0000 2017"}, {"text": "Republican Senators are working very hard to get there, with no help from the Democrats. Not easy! Perhaps just let OCare crash &amp; burn!", "created_at": "Mon Jun 26 13:14:24 +0000 2017"}, {"text": "The real story is that President Obama did NOTHING after being informed in August about Russian meddling. With 4 months looking at Russia...", "created_at": "Mon Jun 26 12:59:31 +0000 2017"}, {"text": "...and did not want to \"rock the boat.\" He didn't \"choke,\" he colluded or obstructed, and it did the Dems and Crooked Hillary no good.", "created_at": "Mon Jun 26 12:50:15 +0000 2017"}, {"text": "The reason that President Obama did NOTHING about Russia after being notified by the CIA of meddling is that he expected Clinton would win..", "created_at": "Mon Jun 26 12:37:16 +0000 2017"}, {"text": "The Democrats have become nothing but OBSTRUCTIONISTS, they have no policies or ideas. All they do is delay and complain.They own ObamaCare!", "created_at": "Mon Jun 26 12:30:12 +0000 2017"}, {"text": "I am on @foxandfriends - Enjoy!", "created_at": "Sun Jun 25 12:07:41 +0000 2017"}, {"text": "Hillary Clinton colluded with the Democratic Party in order to beat Crazy Bernie Sanders. Is she allowed to so collude? Unfair to Bernie!", "created_at": "Sun Jun 25 12:00:37 +0000 2017"}, {"text": "MAKE AMERICA GREAT AGAIN!", "created_at": "Sat Jun 24 21:23:52 +0000 2017"}, {"text": "I cannot imagine that these very fine Republican Senators would allow the American people to suffer a broken ObamaCare any longer!", "created_at": "Sat Jun 24 20:50:56 +0000 2017"}, {"text": "Obama Administration official said they \"choked\" when it came to acting on Russian meddling of election. They didn't want to hurt Hillary?", "created_at": "Sat Jun 24 20:44:36 +0000 2017"}, {"text": "Since the Obama Administration was told way before the 2016 Election that the Russians were meddling, why no action? Focus on them, not T!", "created_at": "Sat Jun 24 20:28:46 +0000 2017"}, {"text": "Just out: The Obama Administration knew far in advance of November 8th about election meddling by Russia. Did nothing about it. WHY?", "created_at": "Sat Jun 24 00:43:48 +0000 2017"}, {"text": "I've helped pass and signed 38 Legislative Bills, mostly with no Democratic support, and gotten rid of massive amounts of regulations. Nice!", "created_at": "Fri Jun 23 10:39:50 +0000 2017"}, {"text": "Will be on @foxandfriends. Enjoy!", "created_at": "Fri Jun 23 10:07:50 +0000 2017"}, {"text": "I am very supportive of the Senate #HealthcareBill. Look forward to making it really special! Remember, ObamaCare is dead.", "created_at": "Thu Jun 22 22:40:27 +0000 2017"}, {"text": "Mexico was just ranked the second deadliest country in the world, after only Syria. Drug trade is largely the cause. We will BUILD THE WALL!", "created_at": "Thu Jun 22 22:15:39 +0000 2017"}, {"text": "...whether there are \"tapes\" or recordings of my conversations with James Comey, but I did not make, and do not have, any such recordings.", "created_at": "Thu Jun 22 16:55:02 +0000 2017"}, {"text": "With all of the recently reported electronic surveillance, intercepts, unmasking and illegal leaking of information, I have no idea...", "created_at": "Thu Jun 22 16:54:50 +0000 2017"}, {"text": "I certainly hope the Democrats do not force Nancy P out. That would be very bad for the Republican Party - and please let Cryin' Chuck stay!", "created_at": "Thu Jun 22 14:15:48 +0000 2017"}, {"text": "...Why did the DNC REFUSE to turn over its Server to the FBI, and still hasn't? It's all a big Dem scam and excuse for losing the election!", "created_at": "Thu Jun 22 14:08:50 +0000 2017"}, {"text": "...Why did Democratic National Committee turn down the DHS offer to protect against hacks (long prior to election). It's all a big Dem HOAX!", "created_at": "Thu Jun 22 14:01:10 +0000 2017"}, {"text": "By the way, if Russia was working so hard on the 2016 Election, it all took place during the Obama Admin. Why didn't they stop them?", "created_at": "Thu Jun 22 13:22:04 +0000 2017"}, {"text": "Great night in Iowa - special people. Thank you!", "created_at": "Thu Jun 22 11:11:25 +0000 2017"}, {"text": "Just landed in Iowa. See everyone soon! #MAGA🇺🇸", "created_at": "Wed Jun 21 23:04:54 +0000 2017"}, {"text": "Democrats would do much better as a party if they got together with Republicans on Healthcare,Tax Cuts,Security. Obstruction doesn't work!", "created_at": "Wed Jun 21 10:32:46 +0000 2017"}, {"text": "Well, the Special Elections are over and those that want to MAKE AMERICA GREAT AGAIN are 5 and O! All the Fake News, all the money spent = 0", "created_at": "Wed Jun 21 03:48:37 +0000 2017"}, {"text": "Ralph Norman ran a fantastic race to win in the Great State of South Carolina's 5th District. We are all honored by your success tonight!", "created_at": "Wed Jun 21 03:12:00 +0000 2017"}, {"text": "Congratulations to Karen Handel on her big win in Georgia 6th. Fantastic job, we are all very proud of you!", "created_at": "Wed Jun 21 02:41:23 +0000 2017"}, {"text": "Thank you @FoxNews \"Huge win for President Trump and GOP in Georgia Congressional Special Election.\"", "created_at": "Wed Jun 21 02:33:40 +0000 2017"}, {"text": "Things are looking great for Karen H!", "created_at": "Wed Jun 21 02:21:36 +0000 2017"}, {"text": "KAREN HANDEL FOR CONGRESS. She will fight for lower taxes, great healthcare strong security-a hard worker who will never give up! VOTE TODAY", "created_at": "Tue Jun 20 10:02:06 +0000 2017"}, {"text": "Democrat Jon Ossoff, who wants to raise your taxes to the highest level and is weak on crime and security, doesn't even live in district.", "created_at": "Tue Jun 20 09:49:50 +0000 2017"}, {"text": "Big day tomorrow in Georgia and South Carolina. ObamaCare is dead. Dems want to raise taxes big! They can only obstruct, no ideas. Vote \"R\"", "created_at": "Tue Jun 20 00:45:00 +0000 2017"}, {"text": "....because he doesn't even live there! He wants to raise taxes and kill healthcare. On Tuesday, #VoteKarenHandel.", "created_at": "Mon Jun 19 20:35:37 +0000 2017"}, {"text": "Karen Handel's opponent in #GA06 can't even vote in the district he wants to represent....", "created_at": "Mon Jun 19 20:34:11 +0000 2017"}, {"text": "....because he doesn't live there! He wants to raise taxes &amp; kill healthcare. On Tuesday, #VoteKarenHandel.", "created_at": "Mon Jun 19 20:29:59 +0000 2017"}, {"text": "Karen Handle's opponent in #GA06 can't even vote in the district he wants to represent....", "created_at": "Mon Jun 19 20:29:38 +0000 2017"}, {"text": "....getting great border security and healthcare. #VoteRalphNorman tomorrow!", "created_at": "Mon Jun 19 20:27:27 +0000 2017"}, {"text": "Ralph Norman, who is running for Congress in SC's 5th District, will be a fantastic help to me in cutting taxes, and....", "created_at": "Mon Jun 19 20:27:10 +0000 2017"}, {"text": "The Dems want to stop tax cuts, good healthcare and Border Security.Their ObamaCare is dead with 100% increases in P's. Vote now for Karen H", "created_at": "Mon Jun 19 12:27:01 +0000 2017"}, {"text": "Jay Sekulow on @foxandfriends now.", "created_at": "Mon Jun 19 11:59:56 +0000 2017"}, {"text": "Camp David is a very special place. An honor to have spent the weekend there. Military runs it so well and are so proud of what they do!", "created_at": "Sun Jun 18 21:51:39 +0000 2017"}, {"text": "The new Rasmussen Poll, one of the most accurate in the 2016 Election, just out with a Trump 50% Approval Rating.That's higher than O's #'s!", "created_at": "Sun Jun 18 11:02:04 +0000 2017"}, {"text": "...massive regulation cuts, 36 new legislative bills signed, great new S.C.Justice, and Infrastructure, Healthcare and Tax Cuts in works!", "created_at": "Sun Jun 18 10:46:35 +0000 2017"}, {"text": "The MAKE AMERICA GREAT AGAIN agenda is doing very well despite the distraction of the Witch Hunt. Many new jobs, high business enthusiasm,..", "created_at": "Sun Jun 18 10:38:51 +0000 2017"}, {"text": "Back from Miami where my Cuban/American friends are very happy with what I signed today. Another campaign promise that I did not forget!", "created_at": "Sat Jun 17 01:30:08 +0000 2017"}, {"text": "I am being investigated for firing the FBI Director by the man who told me to fire the FBI Director! Witch Hunt", "created_at": "Fri Jun 16 13:07:55 +0000 2017"}, {"text": "The Fake News Media hates when I use what has turned out to be my very powerful Social Media - over 100 million people! I can go around them", "created_at": "Fri Jun 16 12:23:08 +0000 2017"}, {"text": "Why is that Hillary Clintons family and Dems dealings with Russia are not looked at, but my non-dealings are?", "created_at": "Thu Jun 15 19:43:31 +0000 2017"}, {"text": "You are witnessing the single greatest WITCH HUNT in American political history - led by some very bad and conflicted people!  #MAGA", "created_at": "Thu Jun 15 11:57:57 +0000 2017"}, {"text": "They made up a phony collusion with the Russians story, found zero proof, so now they go for obstruction of justice on the phony story. Nice", "created_at": "Thu Jun 15 10:55:37 +0000 2017"}, {"text": "Just left hospital. Rep. Steve Scalise, one of the truly great people, is in very tough shape - but he is a real fighter. Pray for Steve!", "created_at": "Thu Jun 15 01:41:45 +0000 2017"}, {"text": "Happy birthday to U.S. ARMY and our soldiers. Thank you for your bravery, sacrifices, &amp; dedication. Proud to be your Commander-in-Chief!", "created_at": "Wed Jun 14 14:07:31 +0000 2017"}, {"text": "Rep. Steve Scalise of Louisiana, a true friend and patriot, was badly injured but will fully recover. Our thoughts and prayers are with him.", "created_at": "Wed Jun 14 12:48:26 +0000 2017"}, {"text": "Just got back from Wisconsin. Great day, great people!", "created_at": "Wed Jun 14 02:53:45 +0000 2017"}, {"text": "2 million more people just dropped out of ObamaCare. It is in a death spiral. Obstructionist Democrats gave up, have no answer = resist!", "created_at": "Tue Jun 13 13:56:20 +0000 2017"}, {"text": "Heading to the Great State of Wisconsin to talk about JOBS, JOBS, JOBS! Big progress being made as the Real News is reporting.", "created_at": "Tue Jun 13 13:29:59 +0000 2017"}, {"text": "Fake News is at an all time high. Where is their apology to me for all of the incorrect stories???", "created_at": "Tue Jun 13 12:48:44 +0000 2017"}, {"text": "A.G. Lynch made law enforcement decisions for political purposes...gave Hillary Clinton a free pass and protection. Totally illegal!", "created_at": "Tue Jun 13 12:45:11 +0000 2017"}, {"text": "Well, as predicted, the 9th Circuit did it again - Ruled against the TRAVEL BAN at such a dangerous time in the history of our country. S.C.", "created_at": "Tue Jun 13 10:44:16 +0000 2017"}, {"text": "The Fake News Media has never been so wrong or so dirty. Purposely incorrect stories and phony sources to meet their agenda of hate. Sad!", "created_at": "Tue Jun 13 10:35:55 +0000 2017"}, {"text": "Ivanka on @foxandfriends now!", "created_at": "Mon Jun 12 10:55:27 +0000 2017"}, {"text": "My daughter, Ivanka, will be on @foxandfriends tomorrow morning. Enjoy!", "created_at": "Mon Jun 12 02:02:23 +0000 2017"}, {"text": "The Democrats have no message,  not on economics, not on taxes,  not on jobs, not on failing #Obamacare. They are only OBSTRUCTIONISTS!", "created_at": "Sun Jun 11 12:49:00 +0000 2017"}, {"text": "I believe the James Comey leaks will be far more prevalent than anyone ever thought possible. Totally illegal? Very 'cowardly!'", "created_at": "Sun Jun 11 12:29:46 +0000 2017"}, {"text": "...way up. Regulations way down. 600,000+ new jobs added. Unemployment down to 4.3%. Business and economic enthusiasm way up- record levels!", "created_at": "Sun Jun 11 12:23:01 +0000 2017"}, {"text": "The #FakeNews MSM doesn't report the great economic news since Election Day. #DOW up 16%. #NASDAQ up 19.5%. Drilling &amp; energy sector...", "created_at": "Sun Jun 11 12:22:20 +0000 2017"}, {"text": "Great reporting by @foxandfriends and so many others. Thank you!", "created_at": "Fri Jun 09 10:54:43 +0000 2017"}, {"text": "Despite so many false statements and lies, total and complete vindication...and WOW, Comey is a leaker!", "created_at": "Fri Jun 09 10:10:37 +0000 2017"}, {"text": "I will be nominating Christopher A. Wray, a man of impeccable credentials, to be the new Director of the FBI. Details to follow.", "created_at": "Wed Jun 07 11:44:37 +0000 2017"}, {"text": "Senate passed the VA Accountability Act. The House should get this bill to my desk ASAP! We can’t tolerate substandard care for our vets.", "created_at": "Wed Jun 07 01:07:39 +0000 2017"}, {"text": "...extremism, and all reference was pointing to Qatar. Perhaps this will be the beginning of the end to the horror of terrorism!", "created_at": "Tue Jun 06 13:44:55 +0000 2017"}, {"text": "So good to see the Saudi Arabia visit with the King and 50 countries already paying off. They said they would take a hard line on funding...", "created_at": "Tue Jun 06 13:36:50 +0000 2017"}, {"text": "Sorry folks, but if I would have relied on the Fake News of CNN, NBC, ABC, CBS, washpost or nytimes, I would have had ZERO chance winning WH", "created_at": "Tue Jun 06 12:15:36 +0000 2017"}, {"text": "During my recent trip to the Middle East I stated that there can no longer be funding of Radical Ideology. Leaders pointed to Qatar - look!", "created_at": "Tue Jun 06 12:06:35 +0000 2017"}, {"text": "The FAKE MSM is working so hard trying to get me not to use Social Media. They hate that I can get the honest and unfiltered message out.", "created_at": "Tue Jun 06 11:58:00 +0000 2017"}, {"text": "Big meeting today with Republican leadership concerning Tax Cuts and Healthcare. We are all pushing hard - must get it right!", "created_at": "Tue Jun 06 10:51:39 +0000 2017"}, {"text": "That's right, we need a TRAVEL BAN for certain DANGEROUS countries, not some politically correct term that won't help us protect our people!", "created_at": "Tue Jun 06 01:20:17 +0000 2017"}, {"text": "Pathetic excuse by London Mayor Sadiq Khan who had to think fast on his \"no reason to be alarmed\" statement. MSM is working hard to sell it!", "created_at": "Mon Jun 05 13:49:56 +0000 2017"}, {"text": ".@foxandfriends  Dems are taking forever to approve my people, including Ambassadors. They are nothing but OBSTRUCTIONISTS! Want approvals.", "created_at": "Mon Jun 05 13:35:00 +0000 2017"}, {"text": "In any event we are EXTREME VETTING people coming into the U.S. in order to help keep our country safe. The courts are slow and political!", "created_at": "Mon Jun 05 10:44:18 +0000 2017"}, {"text": "The Justice Dept. should have stayed with the original Travel Ban, not the watered down, politically correct version they submitted to S.C.", "created_at": "Mon Jun 05 10:29:08 +0000 2017"}, {"text": "People, the lawyers and the courts can call it whatever they want, but I am calling it what we need and what it is, a TRAVEL BAN!", "created_at": "Mon Jun 05 10:25:02 +0000 2017"}, {"text": "Do you notice we are not having a gun debate right now? That's because they used knives and a truck!", "created_at": "Sun Jun 04 11:43:30 +0000 2017"}, {"text": "At least 7 dead and 48 wounded in terror attack and Mayor of London says there is \"no reason to be alarmed!\"", "created_at": "Sun Jun 04 11:31:00 +0000 2017"}, {"text": "We must stop being politically correct and get down to the business of security for our people. If we don't get smart it will only get worse", "created_at": "Sun Jun 04 11:19:47 +0000 2017"}, {"text": "Whatever the United States can do to help out in London and the U. K., we will be there - WE ARE WITH YOU. GOD BLESS!", "created_at": "Sat Jun 03 23:24:45 +0000 2017"}, {"text": "We need to be smart, vigilant and tough. We need the courts to give us back our rights. We need the Travel Ban as an extra level of safety!", "created_at": "Sat Jun 03 23:17:13 +0000 2017"}, {"text": "MAKE AMERICA GREAT AGAIN!", "created_at": "Fri Jun 02 01:00:35 +0000 2017"}, {"text": "The big story is the \"unmasking and surveillance\" of people that took place during the Obama Administration.", "created_at": "Thu Jun 01 11:05:21 +0000 2017"}, {"text": "I will be announcing my decision on Paris Accord, Thursday at 3:00 P.M.  The White House Rose Garden.  MAKE AMERICA GREAT AGAIN!", "created_at": "Thu Jun 01 01:05:17 +0000 2017"}, {"text": "I will be announcing my decision on the Paris Accord over the next few days. MAKE AMERICA GREAT AGAIN!", "created_at": "Wed May 31 13:08:41 +0000 2017"}, {"text": "Kathy Griffin should be ashamed of herself. My children, especially my 11 year old son, Barron, are having a hard time with this. Sick!", "created_at": "Wed May 31 11:14:48 +0000 2017"}, {"text": "So now it is reported that the Democrats, who have excoriated Carter Page about Russia, don't want him to testify. He blows away their....", "created_at": "Wed May 31 10:37:42 +0000 2017"}, {"text": "Who can figure out the true meaning of \"covfefe\" ???  Enjoy!", "created_at": "Wed May 31 10:09:22 +0000 2017"}, {"text": "Despite the constant negative press covfefe", "created_at": "Wed May 31 04:06:25 +0000 2017"}, {"text": "The U.S. Senate should switch to 51 votes, immediately, and get Healthcare and TAX CUTS approved, fast and easy. Dems would do it, no doubt!", "created_at": "Tue May 30 13:59:28 +0000 2017"}, {"text": "Russian officials must be laughing at the U.S. &amp; how a lame excuse for why the Dems lost the election has taken over the Fake News.", "created_at": "Tue May 30 11:04:48 +0000 2017"}, {"text": "I look forward to paying my respects to our brave men and women on this Memorial Day at Arlington National Cemetery later this morning.", "created_at": "Mon May 29 12:36:37 +0000 2017"}, {"text": "Today we remember the men and women who made the ultimate sacrifice in serving. Thank you, God bless your families &amp; God bless the USA!", "created_at": "Mon May 29 12:35:34 +0000 2017"}, {"text": "North Korea has shown great disrespect for their neighbor, China, by shooting off yet another ballistic missile...but China is trying hard!", "created_at": "Mon May 29 12:18:52 +0000 2017"}, {"text": "Honoring the men and women who made the ultimate sacrifice in service to America. Home of the free, because of the brave. #MemorialDay🇺🇸", "created_at": "Mon May 29 12:11:59 +0000 2017"}, {"text": "The Fake News Media works hard at disparaging &amp; demeaning my use of social media because they don't want America to hear the real story!", "created_at": "Mon May 29 00:20:11 +0000 2017"}, {"text": "The massive TAX CUTS/REFORM that I have submitted is moving along in the process very well, actually ahead of schedule. Big benefits to all!", "created_at": "Mon May 29 00:07:01 +0000 2017"}, {"text": "I suggest that we add more dollars to Healthcare and make it the best anywhere. ObamaCare is dead - the Republicans will do much better!", "created_at": "Sun May 28 23:57:19 +0000 2017"}, {"text": "British Prime Minister May was very angry that the info the U.K. gave to U.S. about Manchester was leaked. Gave me full details!", "created_at": "Sun May 28 14:43:53 +0000 2017"}, {"text": "....it is very possible that those sources don't exist but are made up by fake news writers. #FakeNews is the enemy!", "created_at": "Sun May 28 12:45:16 +0000 2017"}, {"text": "....it is very possible that those sources don't exsist but are made up by fake news writers. #FakeNews is the enemy!", "created_at": "Sun May 28 12:35:29 +0000 2017"}, {"text": "Whenever you see the words 'sources say' in the fake news media, and they don't mention names....", "created_at": "Sun May 28 12:34:44 +0000 2017"}, {"text": "It is my opinion that many of the leaks coming out of the White House are fabricated lies made up by the #FakeNews media.", "created_at": "Sun May 28 12:33:03 +0000 2017"}, {"text": "Just returned from Europe. Trip was a great success for America. Hard work but big results!", "created_at": "Sun May 28 12:10:43 +0000 2017"}, {"text": "Big win in Montana for Republicans!", "created_at": "Sun May 28 12:02:05 +0000 2017"}, {"text": "Big win in Montana for Republicans! We", "created_at": "Sun May 28 11:57:20 +0000 2017"}, {"text": "Just arrived in Italy after having a very successful NATO meeting in Brussels. Told other nations they must pay more, not fair to  U.S.", "created_at": "Sun May 28 11:57:20 +0000 2017"}, {"text": "Bringing hundreds of billions of dollars back to the U.S.A. from the Middle East - which will mean JOBS, JOBS, JOBS!", "created_at": "Sat May 27 17:19:37 +0000 2017"}, {"text": "I look forward to reading the @CommerceGov 232 analysis of steel and aluminum- to be released in June. Will take major action if necessary.", "created_at": "Sat May 27 16:22:01 +0000 2017"}, {"text": "....\"we push for the removal of all trade-distorting practices....to foster a truly level playing field.\"", "created_at": "Sat May 27 16:17:30 +0000 2017"}, {"text": "Just left the #G7Summit. Had great meetings on everything, especially on trade where....", "created_at": "Sat May 27 16:16:47 +0000 2017"}, {"text": "I will make my final decision on the Paris Accord next week!", "created_at": "Sat May 27 12:17:51 +0000 2017"}, {"text": "Many NATO countries have agreed to step up payments considerably, as they should. Money is beginning to pour in- NATO will be much stronger.", "created_at": "Sat May 27 10:03:12 +0000 2017"}, {"text": "Big G7 meetings today. Lots of very important matters under discussion. First on the list, of course, is terrorism. #G7Taormina", "created_at": "Sat May 27 09:58:37 +0000 2017"}, {"text": "Getting ready to engage G7 leaders on many issues including economic growth, terrorism, and security.", "created_at": "Fri May 26 10:14:12 +0000 2017"}, {"text": "Just arrived in Italy for the G7. Trip has been very successful. We made and saved the USA many billions of dollars and millions of jobs.", "created_at": "Fri May 26 10:13:41 +0000 2017"}, {"text": "All civilized nations must join together to protect human life and the sacred right of our citizens to live in safety and in peace.", "created_at": "Tue May 23 15:58:37 +0000 2017"}, {"text": "Israel, Saudi Arabia and the Middle East were great. Trying hard for PEACE. Doing well. Heading to Vatican &amp; Pope, then #G7 and #NATO.", "created_at": "Tue May 23 15:47:21 +0000 2017"}, {"text": "Thank you for such a wonderful and unforgettable visit, Prime Minister @Netanyahu and @PresidentRuvi.", "created_at": "Tue May 23 15:43:16 +0000 2017"}, {"text": "Getting ready for my big foreign trip. Will be strongly protecting American interests - that's what I like to do!", "created_at": "Fri May 19 14:24:08 +0000 2017"}, {"text": "This is the single greatest witch hunt of a politician in American history!", "created_at": "Thu May 18 11:52:14 +0000 2017"}, {"text": "As President I wanted to share with Russia (at an openly scheduled W.H. meeting) which I have the absolute right to do, facts pertaining....", "created_at": "Tue May 16 11:03:36 +0000 2017"}, {"text": "Wishing @FLOTUS Melania and all of the great mothers out there a wonderful day ahead with family and friends! \n\nHappy #MothersDay", "created_at": "Sun May 14 15:13:45 +0000 2017"}, {"text": "Will be interviewed by @JudgeJeanine on @FoxNews at 9:00 P.M. (Saturday night). Enjoy!", "created_at": "Sat May 13 17:54:31 +0000 2017"}, {"text": "We", "created_at": "Sat May 13 17:31:14 +0000 2017"}, {"text": "China just agreed that the U.S. will be allowed to sell beef, and other major products, into China once again. This is REAL news!", "created_at": "Fri May 12 13:20:04 +0000 2017"}, {"text": "When James Clapper himself, and virtually everyone else with knowledge of the witch hunt, says there is no collusion, when does it end?", "created_at": "Fri May 12 12:54:54 +0000 2017"}, {"text": "James Comey better hope that there are no \"tapes\" of our conversations before he starts leaking to the press!", "created_at": "Fri May 12 12:26:15 +0000 2017"}, {"text": "...Maybe the best thing to do would be to cancel all future \"press briefings\" and hand out written responses for the sake of accuracy???", "created_at": "Fri May 12 12:07:36 +0000 2017"}, {"text": "As a very active President with lots of things happening, it is not possible for my surrogates to stand at podium with perfect accuracy!....", "created_at": "Fri May 12 11:59:00 +0000 2017"}, {"text": "The Fake Media is working overtime today!", "created_at": "Fri May 12 11:53:48 +0000 2017"}, {"text": "Russia must be laughing up their sleeves watching as the U.S. tears itself apart over a Democrat EXCUSE for losing the election.", "created_at": "Thu May 11 20:34:25 +0000 2017"}, {"text": "The Roger Stone report on @CNN is false - Fake News. Have not spoken to Roger in a long time - had nothing to do with my decision.", "created_at": "Wed May 10 12:57:16 +0000 2017"}, {"text": "years, as a pol in Connecticut, Blumenthal would talk of his great bravery and conquests in Vietnam - except he was never there. When....", "created_at": "Wed May 10 12:30:51 +0000 2017"}, {"text": "Watching Senator Richard Blumenthal speak of Comey is a joke. \"Richie\" devised one of the greatest military frauds in U.S. history. For....", "created_at": "Wed May 10 12:24:32 +0000 2017"}, {"text": "Comey lost the confidence of almost everyone in Washington, Republican and Democrat alike. When things calm down, they will be thanking me!", "created_at": "Wed May 10 11:27:13 +0000 2017"}, {"text": "James Comey will be replaced by someone who will do a far better job, bringing back the spirit and prestige of the FBI.", "created_at": "Wed May 10 11:19:04 +0000 2017"}, {"text": "The Democrats have said some of the worst things about James Comey, including the fact that he should be fired, but now they play so sad!", "created_at": "Wed May 10 11:10:48 +0000 2017"}, {"text": "Cryin' Chuck Schumer stated recently, \"I do not have confidence in him (James Comey) any longer.\" Then acts so indignant.  #draintheswamp", "created_at": "Wed May 10 02:42:52 +0000 2017"}, {"text": "Biggest story today between Clapper &amp; Yates is on surveillance. Why doesn't the media report on this? #FakeNews!", "created_at": "Mon May 08 22:50:45 +0000 2017"}, {"text": "The Russia-Trump collusion story is a total hoax, when will this taxpayer funded charade end?", "created_at": "Mon May 08 22:46:00 +0000 2017"}, {"text": "Sally Yates made the fake media extremely unhappy today --- she said nothing but old news!", "created_at": "Mon May 08 22:43:39 +0000 2017"}, {"text": "Director Clapper reiterated what everybody, including the fake media already knows- there is \"no evidence\" of collusion w/ Russia and Trump.", "created_at": "Mon May 08 22:41:12 +0000 2017"}, {"text": "Ask Sally Yates, under oath, if she knows how classified information got into the newspapers soon after she explained it to W.H. Counsel.", "created_at": "Mon May 08 14:43:35 +0000 2017"}, {"text": "Ask Sally Yates, under oath, if she knows how classified information got into the newspapers soon after she explained it to W.H. Council.", "created_at": "Mon May 08 12:14:21 +0000 2017"}, {"text": "General Flynn was given the highest security clearance by the Obama Administration - but the Fake News seldom likes talking about that.", "created_at": "Mon May 08 11:57:42 +0000 2017"}, {"text": "Congratulations to @PGA_JohnDaly on his big win yesterday. John is a great guy who never gave up - and now a winner again!", "created_at": "Mon May 08 11:32:24 +0000 2017"}, {"text": "Rexnord of Indiana made a deal during the Obama Administration to move to Mexico. Fired their employees. Tax product big that's sold in U.S.", "created_at": "Sun May 07 22:58:47 +0000 2017"}, {"text": "Congratulations to Emmanuel Macron on his big win today as the next President of France. I look very much forward to working with him!", "created_at": "Sun May 07 19:22:17 +0000 2017"}, {"text": "Republican Senators will not let the American people down! ObamaCare premiums and deductibles are way up - it was a lie and it is dead!", "created_at": "Sun May 07 12:49:39 +0000 2017"}, {"text": "The reason I am staying in Bedminster, N. J., a beautiful community, is that staying in NYC is much more expensive and disruptive. Meetings!", "created_at": "Sat May 06 22:39:42 +0000 2017"}, {"text": "Great jobs report today - It is all beginning to work!", "created_at": "Fri May 05 23:34:36 +0000 2017"}, {"text": "Why is it that the Fake News rarely reports Ocare is on its last legs and that insurance companies are fleeing for their lives? It's dead!", "created_at": "Fri May 05 23:29:45 +0000 2017"}, {"text": "Wow,the Fake News media did everything in its power to make the Republican Healthcare victory look as bad as possible.Far better than Ocare!", "created_at": "Fri May 05 23:22:22 +0000 2017"}, {"text": "Of course the Australians have better healthcare than we do --everybody does. ObamaCare is dead! But our healthcare will soon be great.", "created_at": "Fri May 05 19:13:54 +0000 2017"}, {"text": "Rather than causing a big disruption in N.Y.C., I will be working out of my home in Bedminster, N.J. this weekend. Also saves country money!", "created_at": "Fri May 05 13:02:46 +0000 2017"}, {"text": "Big win in the House - very exciting! But when everything comes together with the inclusion of Phase 2, we will have truly great healthcare!", "created_at": "Fri May 05 12:52:36 +0000 2017"}, {"text": "If victorious, Republicans will be having a big press conference at the beautiful Rose Garden of the White House immediately after vote!", "created_at": "Thu May 04 18:07:29 +0000 2017"}, {"text": "Insurance companies are fleeing ObamaCare - it is dead. Our healthcare plan will lower premiums &amp; deductibles - and be great healthcare!", "created_at": "Thu May 04 17:56:51 +0000 2017"}, {"text": "Congratulations to @foxandfriends on its unbelievable ratings hike.", "created_at": "Thu May 04 11:07:35 +0000 2017"}, {"text": "The Fake News media is officially out of control. They will do or say anything in order to get attention - never been a time like this!", "created_at": "Thu May 04 11:02:54 +0000 2017"}, {"text": "...allegations of unmasking Trump transition officials. Not good!", "created_at": "Thu May 04 10:49:10 +0000 2017"}, {"text": "Susan Rice, the former National Security Advisor to President Obama, is refusing to testify before a Senate Subcommittee next week on.....", "created_at": "Thu May 04 10:40:33 +0000 2017"}, {"text": "...Trump/Russia story was an excuse used by the Democrats as justification for losing the election. Perhaps Trump just ran a great campaign?", "created_at": "Wed May 03 03:06:16 +0000 2017"}, {"text": "FBI Director Comey was the best thing that ever happened to Hillary Clinton in that he gave her a free pass for many bad deeds! The phony...", "created_at": "Wed May 03 02:51:07 +0000 2017"}, {"text": "either elect more Republican Senators in 2018 or change the rules now to 51%. Our country needs a good \"shutdown\" in September to fix mess!", "created_at": "Tue May 02 13:07:10 +0000 2017"}, {"text": "The reason for the plan negotiated between the Republicans and Democrats is that we need 60 votes in the Senate which are not there! We....", "created_at": "Tue May 02 13:01:41 +0000 2017"}, {"text": "President Andrew Jackson, who died 16 years before the Civil War started, saw it coming and was angry. Would never have let it happen!", "created_at": "Tue May 02 00:55:54 +0000 2017"}, {"text": "You can't compare anything to ObamaCare because ObamaCare is dead. Dems want billions to go to Insurance Companies to bail out donors....New", "created_at": "Sun Apr 30 12:28:04 +0000 2017"}, {"text": "The Democrats, without a leader, have become the party of obstruction.They are only interested in themselves and not in what's best for U.S.", "created_at": "Sun Apr 30 12:09:04 +0000 2017"}, {"text": "Big excitement last night in the Great State of Pennsylvania! Fantastic crowd and people. MAKE AMERICA GREAT AGAIN!", "created_at": "Sun Apr 30 12:05:31 +0000 2017"}, {"text": "I will be interviewed on @FaceTheNation this morning at 10:00 A.M. Have a great day!", "created_at": "Sun Apr 30 11:33:12 +0000 2017"}, {"text": "Looking forward to RALLY in the Great State of Pennsylvania tonight at 7:30. Big crowd, big energy!", "created_at": "Sat Apr 29 15:35:26 +0000 2017"}, {"text": ".@LouDobbs just stated that \"President Trump's successes are unmatched in recent presidential history\"  Thank you Lou!", "created_at": "Sat Apr 29 02:40:11 +0000 2017"}, {"text": "I will be interviewed by @MarthaMaccallum on @FoxNews tonight at 7pm. Enjoy!", "created_at": "Fri Apr 28 22:31:25 +0000 2017"}, {"text": "We are making tremendous progress with the V. A. There has never been so much done so quickly, and we have just started. We love our VETS!", "created_at": "Fri Apr 28 12:15:59 +0000 2017"}, {"text": "As families prepare for summer vacations in our National Parks - Democrats threaten to close them and shut down the government. Terrible!", "created_at": "Thu Apr 27 14:39:25 +0000 2017"}, {"text": "Democrats used to support border security — now they want illegals to pour through our borders.", "created_at": "Thu Apr 27 14:39:04 +0000 2017"}, {"text": "Democrats jeopardizing the safety of our troops to bail out their donors from insurance companies. It is time to put #AmericaFirst🇺🇸", "created_at": "Thu Apr 27 14:38:14 +0000 2017"}, {"text": "What's more important? Rebuilding our military - or bailing out insurance companies? Ask the Democrats.", "created_at": "Thu Apr 27 14:37:51 +0000 2017"}, {"text": "I promise to rebuild our military and secure our border. Democrats want to shut down the government. Politics!", "created_at": "Thu Apr 27 14:37:30 +0000 2017"}, {"text": "I want to help our miners while the Democrats are blocking their healthcare.", "created_at": "Thu Apr 27 14:37:09 +0000 2017"}, {"text": "The Democrats want to shut government if we don't bail out Puerto Rico and give billions to their insurance companies for OCare failure. NO!", "created_at": "Thu Apr 27 11:30:20 +0000 2017"}, {"text": "...subject to the fact that if we do not reach a fair deal for all, we will then terminate NAFTA. Relationships are good-deal very possible!", "created_at": "Thu Apr 27 11:21:20 +0000 2017"}, {"text": "I received calls from the President of Mexico and the Prime Minister of Canada asking to renegotiate NAFTA rather than terminate. I agreed..", "created_at": "Thu Apr 27 11:12:12 +0000 2017"}, {"text": "Democrats are trying to bail out insurance companies from disastrous #ObamaCare, and Puerto Rico with your tax dollars. Sad!", "created_at": "Wed Apr 26 23:06:16 +0000 2017"}, {"text": "The U.S. recorded its slowest economic growth in five years (2016). GDP up only 1.6%. Trade deficits hurt the economy very badly.", "created_at": "Wed Apr 26 10:51:06 +0000 2017"}, {"text": "...the Ninth Circuit, which has a terrible record of being overturned (close to 80%). They used to call this \"judge shopping!\" Messy system.", "created_at": "Wed Apr 26 10:38:51 +0000 2017"}, {"text": "Out of our very big country, with many choices, does everyone notice that both the \"ban\" case and now the \"sanctuary\" case is brought in ...", "created_at": "Wed Apr 26 10:30:54 +0000 2017"}, {"text": "Don't let the fake media tell you that I have changed my position on the WALL. It will get built and help stop drugs, human trafficking etc.", "created_at": "Tue Apr 25 12:36:28 +0000 2017"}, {"text": "Canada has made business for our dairy farmers in Wisconsin and other border states very difficult. We will not stand for this. Watch!", "created_at": "Tue Apr 25 12:30:15 +0000 2017"}, {"text": "If our healthcare plan is approved, you will see real healthcare and premiums will start tumbling down. ObamaCare is in a death spiral!", "created_at": "Mon Apr 24 17:18:32 +0000 2017"}, {"text": "....the wall is not built, which it will be, the drug situation will NEVER be fixed the way it should be!\n#BuildTheWall", "created_at": "Mon Apr 24 15:31:57 +0000 2017"}, {"text": "The Wall is a very important tool in stopping drugs from pouring into our country and poisoning our youth (and many others)! If", "created_at": "Mon Apr 24 12:28:01 +0000 2017"}, {"text": "The two fake news polls released yesterday, ABC &amp; NBC, while containing some very positive info, were totally wrong in General E. Watch!", "created_at": "Mon Apr 24 12:15:45 +0000 2017"}, {"text": "New polls out today are very good considering that much of the media is FAKE and almost always negative. Would still beat Hillary in .....", "created_at": "Sun Apr 23 19:48:16 +0000 2017"}, {"text": "Eventually, but at a later date so we can get started early, Mexico will be paying, in some form, for the badly needed border wall.", "created_at": "Sun Apr 23 15:44:59 +0000 2017"}, {"text": "The Democrats don't want money from budget going to border wall despite the fact that it will stop drugs and very bad MS 13 gang members.", "created_at": "Sun Apr 23 15:42:07 +0000 2017"}, {"text": "ObamaCare is in serious trouble. The Dems need big money to keep it going - otherwise it dies far sooner than anyone would have thought.", "created_at": "Sun Apr 23 14:20:12 +0000 2017"}, {"text": "Thank you Lake Worth, Florida. @foxandfriends", "created_at": "Sun Apr 23 14:07:52 +0000 2017"}, {"text": "Very interesting election currently taking place in France.", "created_at": "Sun Apr 23 14:05:07 +0000 2017"}, {"text": "I am committed to keeping our air and water clean but always remember that economic growth enhances environmental protection. Jobs matter!", "created_at": "Sat Apr 22 21:49:10 +0000 2017"}, {"text": "Today on Earth Day, we celebrate our beautiful forests, lakes and land. We stand committed to preserving the natural beauty of our nation.", "created_at": "Sat Apr 22 19:01:59 +0000 2017"}, {"text": "Big TAX REFORM AND TAX REDUCTION will be announced next Wednesday.", "created_at": "Sat Apr 22 16:15:01 +0000 2017"}, {"text": "Next Saturday night I will be holding a BIG rally in Pennsylvania. Look forward to it!", "created_at": "Sat Apr 22 16:10:26 +0000 2017"}, {"text": "Getting ready to visit Walter Reed Medical Center with Melania. Looking forward to seeing our bravest and greatest Americans!", "created_at": "Sat Apr 22 16:05:37 +0000 2017"}, {"text": "China is very much the economic lifeline to North Korea so, while nothing is easy, if they want to solve the North Korean problem, they will", "created_at": "Fri Apr 21 13:04:19 +0000 2017"}, {"text": "Another terrorist attack in Paris. The people of France will not take much more of this. Will have a big effect on presidential election!", "created_at": "Fri Apr 21 10:32:01 +0000 2017"}, {"text": "Failing @nytimes, which has been calling me wrong for two years, just got caught in a big lie concerning New England Patriots visit to W.H.", "created_at": "Thu Apr 20 13:48:14 +0000 2017"}, {"text": "Dems failed in Kansas and are now failing in Georgia. Great job Karen Handel! It is now Hollywood vs. Georgia on June 20th.", "created_at": "Wed Apr 19 12:43:18 +0000 2017"}, {"text": "Despite major outside money, FAKE media support and eleven Republican candidates, BIG \"R\" win with runoff in Georgia. Glad to be of help!", "created_at": "Wed Apr 19 04:09:17 +0000 2017"}, {"text": "Just learned that Jon @Ossoff, who is running for Congress in Georgia, doesn't even live in the district. Republicans, get out and vote!", "created_at": "Tue Apr 18 20:38:25 +0000 2017"}, {"text": "Democrat Jon Ossoff would be a disaster in Congress. VERY weak on crime and illegal immigration, bad for jobs and wants higher taxes. Say NO", "created_at": "Tue Apr 18 10:38:59 +0000 2017"}, {"text": "I will be interviewed on @foxandfriends by @ainsleyearhardt starting at 6:00 A.M. Enjoy!", "created_at": "Tue Apr 18 09:48:10 +0000 2017"}, {"text": "The weak illegal immigration policies of the Obama Admin. allowed bad MS 13 gangs to form in cities across U.S. We are removing them fast!", "created_at": "Tue Apr 18 09:39:25 +0000 2017"}, {"text": "The super Liberal Democrat in the Georgia Congressioal race tomorrow wants to protect criminals, allow illegal immigration and raise taxes!", "created_at": "Mon Apr 17 13:31:03 +0000 2017"}, {"text": "The Fake Media (not Real Media) has gotten even worse since the election. Every story is badly slanted. We have to hold them to the truth!", "created_at": "Mon Apr 17 12:17:59 +0000 2017"}, {"text": "A great book for your reading enjoyment: \"REASONS TO VOTE FOR DEMOCRATS\" by Michael J. Knowles.", "created_at": "Mon Apr 17 12:13:17 +0000 2017"}, {"text": "\"The first 90 days of my presidency has exposed the total failure of the last eight years of foreign policy!\" So true. @foxandfriends", "created_at": "Mon Apr 17 12:07:16 +0000 2017"}, {"text": "The recent Kansas election (Congress) was a really big media event, until the Republicans won. Now they play the same game with Georgia-BAD!", "created_at": "Mon Apr 17 00:45:01 +0000 2017"}, {"text": "Our military is building and is rapidly becoming stronger than ever before. Frankly, we have no choice!", "created_at": "Sun Apr 16 13:41:47 +0000 2017"}, {"text": "Someone should look into who paid for the small organized rallies yesterday. The election is over!", "created_at": "Sun Apr 16 13:13:26 +0000 2017"}, {"text": "I did what was an almost an impossible thing to do for a Republican-easily won the Electoral College! Now Tax Returns are brought up again?", "created_at": "Sun Apr 16 13:07:11 +0000 2017"}, {"text": "Happy Easter to everyone!", "created_at": "Sun Apr 16 12:24:49 +0000 2017"}, {"text": "Why would I call China a currency manipulator when they are working with us on the North Korean problem? We will see what happens!", "created_at": "Sun Apr 16 12:18:40 +0000 2017"}, {"text": "I have great confidence that China will properly deal with North Korea. If they are unable to do so, the U.S., with its allies, will! U.S.A.", "created_at": "Thu Apr 13 13:08:20 +0000 2017"}, {"text": "Jobs are returning, illegal immigration is plummeting, law, order and justice are being restored. We are truly making America great again!", "created_at": "Thu Apr 13 00:32:25 +0000 2017"}, {"text": "One by one we are keeping our promises - on the border, on energy, on jobs, on regulations. Big changes are happening!", "created_at": "Wed Apr 12 23:10:37 +0000 2017"}, {"text": "Economic confidence is soaring as we unleash the power of private sector job creation and stand up for the American Workers. #AmericaFirst", "created_at": "Wed Apr 12 23:09:56 +0000 2017"}, {"text": "Had a very good call last night with the President of China concerning the menace of North Korea.", "created_at": "Wed Apr 12 12:22:22 +0000 2017"}, {"text": "I will be interviewed by @MariaBartiromo at 6:00 A.M. @FoxBusiness. Enjoy!", "created_at": "Wed Apr 12 03:16:00 +0000 2017"}, {"text": "North Korea is looking for trouble. If China decides to help, that would be great. If not, we will solve the problem without them!  U.S.A.", "created_at": "Tue Apr 11 12:03:43 +0000 2017"}, {"text": "I explained to the President of China that a trade deal with the U.S. will be far better for them if they solve the North Korean problem!", "created_at": "Tue Apr 11 11:59:04 +0000 2017"}, {"text": "Happy Passover to everyone celebrating in the United States of America, Israel, and around the world. #ChagSameach", "created_at": "Mon Apr 10 23:56:35 +0000 2017"}, {"text": "...confidence that President Al Sisi will handle situation properly.", "created_at": "Sun Apr 09 15:21:07 +0000 2017"}, {"text": "So sad to hear of the terrorist attack in Egypt. U.S. strongly condemns. I have great...", "created_at": "Sun Apr 09 15:20:39 +0000 2017"}, {"text": "Judge Gorsuch will be sworn in at the Rose Garden of the White House on Monday at 11:00 A.M. He will be a great Justice. Very proud of him!", "created_at": "Sat Apr 08 19:58:32 +0000 2017"}, {"text": "The reason you don't generally hit runways is that they are easy and inexpensive to quickly fix (fill in and top)!", "created_at": "Sat Apr 08 19:00:08 +0000 2017"}, {"text": "Congratulations to our great military men and women for representing the United States, and the world, so well in the Syria attack.", "created_at": "Sat Apr 08 14:54:24 +0000 2017"}, {"text": "...goodwill and friendship was formed, but only time will tell on trade.", "created_at": "Sat Apr 08 14:51:10 +0000 2017"}, {"text": "It was a great honor to have President Xi Jinping and Madame Peng Liyuan of China as our guests in the United States. Tremendous...", "created_at": "Sat Apr 08 14:50:59 +0000 2017"}, {"text": "Getting ready to meet President al-Sisi of Egypt. On behalf of the United States, I look forward to a long and wonderful relationship.", "created_at": "Mon Apr 03 16:00:33 +0000 2017"}, {"text": ".@FoxNews from multiple sources: \"There was electronic surveillance of Trump, and people close to Trump. This is unprecedented.\" @FBI", "created_at": "Mon Apr 03 12:51:01 +0000 2017"}, {"text": "Did Hillary Clinton ever apologize for receiving the answers to the debate? Just asking!", "created_at": "Mon Apr 03 11:21:11 +0000 2017"}, {"text": "Was the brother of John Podesta paid big money to get the sanctions on Russia lifted? Did Hillary know?", "created_at": "Mon Apr 03 11:16:52 +0000 2017"}, {"text": "Such amazing reporting on unmasking and the crooked scheme against us by @foxandfriends. \"Spied on before nomination.\" The real story.", "created_at": "Mon Apr 03 10:15:17 +0000 2017"}, {"text": "The real story turns out to be SURVEILLANCE and LEAKING! Find the leakers.", "created_at": "Sun Apr 02 13:34:16 +0000 2017"}, {"text": "Talks on Repealing and Replacing ObamaCare are, and have been, going on, and will continue until such time as a deal is hopefully struck.", "created_at": "Sun Apr 02 13:03:43 +0000 2017"}, {"text": "..not associated with Russia. Trump team spied on before he was nominated.\" If this is true, does not get much bigger. Would be sad for U.S.", "created_at": "Sat Apr 01 17:02:29 +0000 2017"}, {"text": "Wow, @FoxNews just reporting big news. Source: \"Official behind unmasking is high up. Known Intel official is responsible. Some unmasked....", "created_at": "Sat Apr 01 16:50:36 +0000 2017"}, {"text": "...use subsidies to buy health plans.\" In other words, Ocare is dead. Good things will happen, however, either with Republicans or Dems.", "created_at": "Sat Apr 01 16:06:14 +0000 2017"}, {"text": "The failing @nytimes finally gets it - \"In places where no insurance company offers plans, there will be no way for ObamaCare customers to..", "created_at": "Sat Apr 01 15:59:36 +0000 2017"}, {"text": "It is the same Fake News Media that said there is \"no path to victory for Trump\" that is now pushing the phony Russia story. A total scam!", "created_at": "Sat Apr 01 13:02:32 +0000 2017"}, {"text": "When will Sleepy Eyes Chuck Todd and @NBCNews start talking about the Obama SURVEILLANCE SCANDAL and stop with the Fake Trump/Russia story?", "created_at": "Sat Apr 01 12:43:32 +0000 2017"}, {"text": "Mike Flynn should ask for immunity in that this is a witch hunt (excuse for big election loss), by media &amp; Dems, of historic proportion!", "created_at": "Fri Mar 31 11:04:32 +0000 2017"}, {"text": "...and job losses. American companies must be prepared to look at other alternatives.", "created_at": "Thu Mar 30 22:16:50 +0000 2017"}, {"text": "The meeting next week with China will be a very difficult one in that we can no longer have massive trade deficits...", "created_at": "Thu Mar 30 22:16:17 +0000 2017"}, {"text": "Where are @RepMarkMeadows, @Jim_Jordan and @Raul_Labrador?\n#RepealANDReplace #Obamacare", "created_at": "Thu Mar 30 21:21:50 +0000 2017"}, {"text": "If @RepMarkMeadows, @Jim_Jordan and @Raul_Labrador would get on board we would have both great healthcare and massive tax cuts &amp; reform.", "created_at": "Thu Mar 30 21:20:44 +0000 2017"}, {"text": "If @RepMarkMeadows, @Jim_Jordan and Raul_Labrador would get on board we would have both great healthcare and massive tax cuts &amp; reform.", "created_at": "Thu Mar 30 21:18:57 +0000 2017"}, {"text": "If the people of our great country could only see how viciously and inaccurately my administration is covered by certain media!", "created_at": "Wed Mar 29 12:21:02 +0000 2017"}, {"text": "Remember when the failing @nytimes apologized to its subscribers, right after the election, because their coverage was so wrong. Now worse!", "created_at": "Wed Mar 29 12:01:52 +0000 2017"}, {"text": "Why doesn't Fake News talk about Podesta ties to Russia as covered by @FoxNews or money from Russia to Clinton - sale of  Uranium?", "created_at": "Tue Mar 28 22:41:09 +0000 2017"}, {"text": "Watch @foxandfriends now on Podesta and Russia!", "created_at": "Tue Mar 28 11:16:44 +0000 2017"}, {"text": "Big announcement by Ford today. Major investment to be made in three Michigan plants. Car companies coming back to U.S.  JOBS! JOBS! JOBS!", "created_at": "Tue Mar 28 10:36:02 +0000 2017"}, {"text": "The Democrats will make a deal with me on healthcare as soon as ObamaCare folds - not long. Do not worry, we are in very  good shape!", "created_at": "Tue Mar 28 02:03:17 +0000 2017"}, {"text": "The Republican House Freedom Caucus was able to snatch defeat from the jaws of victory. After so many bad years they were ready for a win!", "created_at": "Tue Mar 28 01:41:15 +0000 2017"}, {"text": "...money to Bill, the Hillary Russian \"reset,\" praise of Russia by Hillary, or Podesta Russian Company. Trump Russia story is a hoax. #MAGA!", "created_at": "Tue Mar 28 01:35:35 +0000 2017"}, {"text": "General Kelly is doing a great job at the border. Numbers are way down. Many are not even trying to come in anymore.", "created_at": "Mon Mar 27 01:04:42 +0000 2017"}, {"text": "Thanks you for all of the Trump Rallies today. Amazing support. We will all MAKE AMERICA GREAT AGAIN!", "created_at": "Sat Mar 25 22:37:02 +0000 2017"}, {"text": "Watch @JudgeJeanine on @FoxNews tonight at 9:00 P.M.", "created_at": "Sat Mar 25 14:41:14 +0000 2017"}, {"text": "ObamaCare will explode and we will all get together and piece together a great healthcare plan for THE PEOPLE. Do not worry!", "created_at": "Sat Mar 25 14:37:52 +0000 2017"}, {"text": "The irony is that the Freedom Caucus, which is very pro-life and against Planned Parenthood, allows P.P. to continue if they stop this plan!", "created_at": "Fri Mar 24 12:23:00 +0000 2017"}, {"text": "A great American, Kurt Cochran, was killed in the London terror attack. My prayers and condolences are with his family and friends.", "created_at": "Thu Mar 23 15:16:24 +0000 2017"}, {"text": "Just watched the totally biased and fake news reports of the so-called Russia story on NBC and ABC. Such dishonesty!", "created_at": "Thu Mar 23 12:18:33 +0000 2017"}, {"text": "Spoke to U.K. Prime Minister Theresa May today to offer condolences on the terrorist attack in London. She is strong and doing very well.", "created_at": "Thu Mar 23 01:33:54 +0000 2017"}, {"text": "Big day for healthcare. Working hard!", "created_at": "Wed Mar 22 13:09:35 +0000 2017"}, {"text": "What about all of the contact with the Clinton campaign and the Russians? Also, is it true that the DNC would not let the FBI in to look?", "created_at": "Mon Mar 20 13:14:49 +0000 2017"}, {"text": "Just heard Fake News CNN is doing polls again despite the fact that their election polls were a WAY OFF disaster. Much higher ratings at Fox", "created_at": "Mon Mar 20 12:35:14 +0000 2017"}, {"text": "The real story that Congress, the FBI and all others should be looking into is the leaking of Classified information. Must find leaker now!", "created_at": "Mon Mar 20 11:02:57 +0000 2017"}, {"text": "James Clapper and others stated that there is no evidence Potus colluded with Russia. This story is FAKE NEWS and everyone knows it!", "created_at": "Mon Mar 20 10:35:28 +0000 2017"}, {"text": "Despite what you have heard from the FAKE NEWS, I had a GREAT meeting with German Chancellor Angela Merkel. Nevertheless, Germany owes.....", "created_at": "Sat Mar 18 13:15:41 +0000 2017"}, {"text": "North Korea is behaving very badly. They have been \"playing\" the United States for years. China has done little to help!", "created_at": "Fri Mar 17 13:07:15 +0000 2017"}, {"text": "Happy Lá Fheile Phadraig to all of my great Irish friends!", "created_at": "Fri Mar 17 12:12:04 +0000 2017"}, {"text": "Great progress on healthcare. Improvements being made - Republicans coming together!", "created_at": "Thu Mar 16 21:54:02 +0000 2017"}, {"text": "I will be interviewed by @TuckerCarlson tonight at 9:00 P.M. on @FoxNews. Enjoy!", "created_at": "Wed Mar 15 20:55:52 +0000 2017"}, {"text": "CEO's most optimistic since 2009. It will only get better as we continue to slash unnecessary regulations and when we begin our big tax cut!", "created_at": "Wed Mar 15 12:14:20 +0000 2017"}, {"text": "Looking forward to a big rally in Nashville, Tennessee, tonight. Big crowd of great people expected. Will be fun!", "created_at": "Wed Mar 15 11:29:05 +0000 2017"}, {"text": "Will be going to Detroit, Michigan (love), today for a big meeting on bringing back car production to State &amp; U.S. Already happening!", "created_at": "Wed Mar 15 11:13:58 +0000 2017"}, {"text": "Can you imagine what the outcry would be if @SnoopDogg, failing career and all, had aimed and fired the gun at President Obama? Jail time!", "created_at": "Wed Mar 15 11:02:40 +0000 2017"}, {"text": "Does anybody really believe that a reporter, who nobody ever heard of, \"went to his mailbox\" and found my tax returns? @NBCNews  FAKE NEWS!", "created_at": "Wed Mar 15 10:55:30 +0000 2017"}, {"text": "ObamaCare is imploding. It is a disaster and 2017 will be the worst year yet, by far! Republicans will come together and save the day.", "created_at": "Mon Mar 13 13:11:17 +0000 2017"}, {"text": "It is amazing how rude much of the media is to my very hard working representatives. Be nice, you will do much better!", "created_at": "Mon Mar 13 12:52:29 +0000 2017"}, {"text": "We are making great progress with healthcare. ObamaCare is imploding and will only get worse. Republicans coming together to get job done!", "created_at": "Sat Mar 11 14:39:07 +0000 2017"}, {"text": "Despite what you hear in the press, healthcare is coming along great. We are talking to many groups and it will end in a beautiful picture!", "created_at": "Thu Mar 09 17:01:17 +0000 2017"}, {"text": "Met with @RepCummings today at the @WhiteHouse. Great discussion!", "created_at": "Wed Mar 08 23:50:25 +0000 2017"}, {"text": "LinkedIn Workforce Report: January and February were the strongest consecutive months for hiring since August and September 2015", "created_at": "Wed Mar 08 12:11:25 +0000 2017"}, {"text": "On International Women's Day, join me in honoring the critical role of women here in America &amp; around the world.", "created_at": "Wed Mar 08 11:13:44 +0000 2017"}, {"text": "I have tremendous respect for women and the many roles they serve that are vital to the fabric of our society and our economy.", "created_at": "Wed Mar 08 11:12:39 +0000 2017"}, {"text": "I feel sure that my friend @RandPaul will come along with the new and great health care program because he knows Obamacare is a disaster!", "created_at": "Wed Mar 08 00:14:30 +0000 2017"}, {"text": "Don't let the FAKE NEWS tell you that there is big infighting in the Trump Admin. We are getting along great, and getting major things done!", "created_at": "Tue Mar 07 14:14:03 +0000 2017"}, {"text": "I am working on a new system where there will be competition in the Drug Industry. Pricing for the American people will come way down!", "created_at": "Tue Mar 07 13:46:28 +0000 2017"}, {"text": "Don't worry, getting rid of state lines, which will promote competition, will be in phase 2 &amp; 3 of healthcare rollout. @foxandfriends", "created_at": "Tue Mar 07 13:41:58 +0000 2017"}, {"text": "For eight years Russia \"ran over\" President Obama, got stronger and stronger, picked-off Crimea and added missiles. Weak! @foxandfriends", "created_at": "Tue Mar 07 13:13:20 +0000 2017"}, {"text": "Our wonderful new Healthcare Bill is now out for review and negotiation. ObamaCare is a complete and total disaster - is imploding fast!", "created_at": "Tue Mar 07 12:13:59 +0000 2017"}, {"text": "122 vicious prisoners, released by the Obama Administration from Gitmo, have returned to the battlefield. Just another terrible decision!", "created_at": "Tue Mar 07 12:04:13 +0000 2017"}, {"text": "Thank you to @exxonmobil for your $20 billion investment that is creating more than 45,000 manufacturing &amp; construction jobs in the USA!", "created_at": "Tue Mar 07 03:50:49 +0000 2017"}, {"text": "Buy American &amp; hire American are the principles at the core of my agenda, which is: JOBS, JOBS, JOBS! Thank you @exxonmobil.", "created_at": "Tue Mar 07 03:49:54 +0000 2017"}, {"text": "45,000 construction &amp; manufacturing jobs in the U.S. Gulf Coast region. $20 billion investment. We are already winning again, America!", "created_at": "Mon Mar 06 21:22:15 +0000 2017"}, {"text": "Buy American &amp; hire American are the principals at the core of my agenda, which is: JOBS, JOBS, JOBS! Thank you @exxonmobil.", "created_at": "Mon Mar 06 21:21:32 +0000 2017"}, {"text": "Thank you for the great rallies all across the country. Tremendous support. Make America Great Again!", "created_at": "Sun Mar 05 17:30:11 +0000 2017"}, {"text": "Who was it that secretly said to Russian President, \"Tell Vladimir that after the election I'll have more flexibility?\" @foxandfriends", "created_at": "Sun Mar 05 11:40:20 +0000 2017"}, {"text": "Is it true the DNC would not allow the FBI access to check server or other equipment after learning it was hacked? Can that be possible?", "created_at": "Sun Mar 05 11:32:22 +0000 2017"}, {"text": "Arnold Schwarzenegger isn't voluntarily leaving the Apprentice, he was fired by his bad (pathetic) ratings, not by me. Sad end to great show", "created_at": "Sat Mar 04 13:19:29 +0000 2017"}, {"text": "How low has President Obama gone to tapp my phones during the very sacred election process. This is Nixon/Watergate. Bad (or sick) guy!", "created_at": "Sat Mar 04 12:02:48 +0000 2017"}, {"text": "I'd bet a good lawyer could make a great case out of the fact that President Obama was tapping my phones in October, just prior to Election!", "created_at": "Sat Mar 04 11:52:54 +0000 2017"}, {"text": "Is it legal for a sitting President to be \"wire tapping\" a race for president prior to an election? Turned down by court earlier. A NEW LOW!", "created_at": "Sat Mar 04 11:49:00 +0000 2017"}, {"text": "Just out: The same Russian Ambassador that met Jeff Sessions visited the Obama White House 22 times, and 4 times last year alone.", "created_at": "Sat Mar 04 11:42:59 +0000 2017"}, {"text": "Terrible! Just found out that Obama had my \"wires tapped\" in Trump Tower just before the victory. Nothing found. This is McCarthyism!", "created_at": "Sat Mar 04 11:35:20 +0000 2017"}, {"text": "The first meeting Jeff Sessions had with the Russian Amb was set up by the Obama Administration under education program for 100 Ambs......", "created_at": "Sat Mar 04 11:26:47 +0000 2017"}, {"text": "It is so pathetic that the Dems have still not approved my full Cabinet.", "created_at": "Fri Mar 03 12:19:12 +0000 2017"}, {"text": "Nick Adams new book, Green Card Warrior, is a must read. The merit-based system is the way to go. Canada, Australia! @foxandfriends", "created_at": "Fri Mar 03 12:00:39 +0000 2017"}, {"text": "...is all of the illegal leaks of classified and other information. It is a total \"witch hunt!\"", "created_at": "Fri Mar 03 02:38:48 +0000 2017"}, {"text": "...to win. The Democrats are overplaying their hand. They lost the election, and now they have lost their grip on reality. The real story...", "created_at": "Fri Mar 03 02:35:33 +0000 2017"}, {"text": "...intentional. This whole narrative is a way of saving face for Democrats losing an election that everyone thought they were supposed.....", "created_at": "Fri Mar 03 02:27:29 +0000 2017"}, {"text": "Jeff Sessions is an honest man. He did not say anything wrong. He could have stated his response more accurately, but it was clearly not....", "created_at": "Fri Mar 03 02:22:49 +0000 2017"}, {"text": "Since November 8th, Election Day, the Stock Market has posted $3.2 trillion in GAINS and consumer confidence is at a 15 year high. Jobs!", "created_at": "Thu Mar 02 11:00:41 +0000 2017"}, {"text": "THANK YOU!", "created_at": "Wed Mar 01 13:38:44 +0000 2017"}, {"text": "I will be interviewed on @foxandfriends at 6:00 A.M. Enjoy!", "created_at": "Tue Feb 28 02:43:03 +0000 2017"}, {"text": "Big dinner with Governors tonight at White House. Much to be discussed, including healthcare.", "created_at": "Sun Feb 26 20:13:52 +0000 2017"}, {"text": "Russia talk is FAKE NEWS put out by the Dems, and played up by the media, in order to mask the big election defeat and the illegal leaks!", "created_at": "Sun Feb 26 18:16:41 +0000 2017"}, {"text": "For first time the failing @nytimes will take an ad (a bad one) to help save its failing reputation. Try reporting accurately &amp; fairly!", "created_at": "Sun Feb 26 11:42:39 +0000 2017"}, {"text": "The race for DNC Chairman was, of course, totally \"rigged.\" Bernie's guy, like Bernie himself, never had a chance. Clinton demanded Perez!", "created_at": "Sun Feb 26 11:33:16 +0000 2017"}, {"text": "Congratulations to Thomas Perez, who has just been named Chairman of the DNC. I could not be happier for him, or for the Republican Party!", "created_at": "Sat Feb 25 22:02:22 +0000 2017"}, {"text": "I will not be attending the White House Correspondents' Association Dinner this year. Please wish everyone well and have a great evening!", "created_at": "Sat Feb 25 21:53:21 +0000 2017"}, {"text": "The media has not reported that the National Debt in my first month went down by $12 billion vs a $200 billion increase in Obama first mo.", "created_at": "Sat Feb 25 13:19:18 +0000 2017"}, {"text": "Maybe the millions of people who voted to MAKE AMERICA GREAT AGAIN should have their own rally. It would be the biggest of them all!", "created_at": "Sat Feb 25 12:25:24 +0000 2017"}, {"text": "FAKE NEWS media knowingly doesn't tell the truth. A great danger to our country. The failing @nytimes has become a joke. Likewise @CNN. Sad!", "created_at": "Sat Feb 25 03:09:18 +0000 2017"}, {"text": "Going to CPAC!", "created_at": "Fri Feb 24 13:49:27 +0000 2017"}, {"text": "find the leakers within the FBI itself. Classified information is being given to media that could have a devastating effect on U.S. FIND NOW", "created_at": "Fri Feb 24 12:36:34 +0000 2017"}, {"text": "The FBI is totally unable to stop the national security \"leakers\" that have permeated our government for a long time. They can't even......", "created_at": "Fri Feb 24 12:31:49 +0000 2017"}, {"text": "Big interview tonight by Henry Kravis at The Business Council of Washington. Looking forward to it!", "created_at": "Fri Feb 24 00:06:44 +0000 2017"}, {"text": "Seven people shot and killed yesterday in Chicago. What is going on there - totally out of control. Chicago needs help!", "created_at": "Fri Feb 24 00:01:40 +0000 2017"}, {"text": "Very much enjoyed my tour of the Smithsonian's National Museum of African American History and Culture...A great job done by amazing people!", "created_at": "Wed Feb 22 12:50:56 +0000 2017"}, {"text": "One thing I will say about Rep. Keith Ellison, in his fight to lead the DNC, is that he was the one who predicted early that I would win!", "created_at": "Wed Feb 22 12:20:40 +0000 2017"}, {"text": "The so-called angry crowds in home districts of some Republicans are actually, in numerous cases, planned out by liberal activists. Sad!", "created_at": "Tue Feb 21 23:23:13 +0000 2017"}, {"text": "Just named General H.R. McMaster National Security Advisor.", "created_at": "Mon Feb 20 21:00:37 +0000 2017"}, {"text": "Meeting with Generals at Mar-a-Lago in Florida. Very interesting!", "created_at": "Mon Feb 20 19:33:35 +0000 2017"}, {"text": "HAPPY PRESIDENTS DAY - MAKE AMERICA GREAT AGAIN!", "created_at": "Mon Feb 20 14:33:33 +0000 2017"}, {"text": "Give the public a break - The FAKE NEWS media is trying to say that large scale immigration in Sweden is working out just beautifully. NOT!", "created_at": "Mon Feb 20 14:15:42 +0000 2017"}, {"text": "My statement as to what's happening in Sweden was in reference to a story that was broadcast on @FoxNews concerning immigrants &amp; Sweden.", "created_at": "Sun Feb 19 21:57:01 +0000 2017"}, {"text": "Getting ready to leave for Melbourne, Florida. See you all soon!", "created_at": "Sat Feb 18 20:26:31 +0000 2017"}, {"text": "Will be having many meetings this weekend at The Southern White House. Big 5:00 P.M. speech in Melbourne, Florida. A lot to talk about!", "created_at": "Sat Feb 18 13:51:20 +0000 2017"}, {"text": "Don't believe the main stream (fake news) media.The White House is running VERY WELL. I inherited a MESS and am in the process of fixing it.", "created_at": "Sat Feb 18 13:31:53 +0000 2017"}, {"text": "Looking forward to the Florida rally tomorrow. Big crowd expected!", "created_at": "Sat Feb 18 00:02:58 +0000 2017"}, {"text": "\"One of the most effective press conferences I've ever seen!\" says Rush Limbaugh. Many agree.Yet FAKE MEDIA  calls it differently! Dishonest", "created_at": "Fri Feb 17 23:15:56 +0000 2017"}, {"text": "The FAKE NEWS media (failing @nytimes, @NBCNews, @ABC, @CBS, @CNN) is not my enemy, it is the enemy of the American People!", "created_at": "Fri Feb 17 21:48:22 +0000 2017"}, {"text": "The FAKE NEWS media (failing @nytimes, @CNN, @NBCNews and many more)    is not my enemy, it is the enemy of the American people. SICK!", "created_at": "Fri Feb 17 21:32:29 +0000 2017"}, {"text": "General Keith Kellogg, who I have known for a long time, is very much in play for NSA - as are three others.", "created_at": "Fri Feb 17 13:16:22 +0000 2017"}, {"text": "Thank you for all of the nice statements on the Press Conference yesterday. Rush Limbaugh said one of greatest ever. Fake media not happy!", "created_at": "Fri Feb 17 11:43:10 +0000 2017"}, {"text": "Going to Charleston, South Carolina, in order to spend time with Boeing and talk jobs! Look forward to it.", "created_at": "Fri Feb 17 11:38:20 +0000 2017"}, {"text": "Despite the long delays by the Democrats in finally approving Dr. Tom Price, the repeal and replacement of ObamaCare is moving fast!", "created_at": "Fri Feb 17 10:13:32 +0000 2017"}, {"text": "The Democrats had to come up with a story as to why they lost the election, and so badly (306), so they made up a story - RUSSIA. Fake news!", "created_at": "Thu Feb 16 14:39:52 +0000 2017"}, {"text": "FAKE NEWS media, which makes up stories and \"sources,\" is far more effective than the discredited Democrats - but they are fading fast!", "created_at": "Thu Feb 16 14:10:49 +0000 2017"}, {"text": "The spotlight has finally been put on the low-life leakers! They will be caught!", "created_at": "Thu Feb 16 12:02:59 +0000 2017"}, {"text": "Leaking, and even illegal classified leaking, has been a big problem in Washington for years. Failing @nytimes (and others) must apologize!", "created_at": "Thu Feb 16 11:58:43 +0000 2017"}, {"text": "Stock market hits new high with longest winning streak in decades. Great level of confidence and optimism - even before tax plan rollout!", "created_at": "Thu Feb 16 11:34:46 +0000 2017"}, {"text": "The real scandal here is that classified information is illegally given out by \"intelligence\" like candy. Very un-American!", "created_at": "Wed Feb 15 13:13:10 +0000 2017"}, {"text": "Crimea was TAKEN by Russia during the Obama Administration. Was Obama too soft on Russia?", "created_at": "Wed Feb 15 12:42:20 +0000 2017"}, {"text": "This Russian connection non-sense is merely an attempt to cover-up the many mistakes made in Hillary Clinton's losing campaign.", "created_at": "Wed Feb 15 12:08:12 +0000 2017"}, {"text": "The real story here is why are there so many illegal leaks coming out of Washington? Will these leaks be happening as I deal on N.Korea etc?", "created_at": "Tue Feb 14 14:28:54 +0000 2017"}, {"text": "Just leaving Florida. Big crowds of enthusiastic supporters lining the road that the FAKE NEWS media refuses to mention. Very dishonest!", "created_at": "Sun Feb 12 22:19:05 +0000 2017"}, {"text": "Congratulations Stephen Miller- on representing me this morning on the various Sunday morning shows. Great job!", "created_at": "Sun Feb 12 15:41:55 +0000 2017"}, {"text": "I know Mark Cuban well. He backed me big-time but I wasn't interested in taking all of his calls.He's not smart enough to run for president!", "created_at": "Sun Feb 12 13:23:18 +0000 2017"}, {"text": "After two days of very productive talks, Prime Minister Abe is heading back to Japan. L", "created_at": "Sun Feb 12 13:04:49 +0000 2017"}, {"text": "While on FAKE NEWS @CNN, Bernie Sanders was cut off for using the term fake news to describe the network. They said technical difficulties!", "created_at": "Sun Feb 12 12:14:16 +0000 2017"}, {"text": "The crackdown on illegal criminals is merely the keeping of my campaign promise. Gang members, drug dealers &amp; others are being removed!", "created_at": "Sun Feb 12 11:34:45 +0000 2017"}, {"text": "A working dinner tonight with Prime Minister Abe of Japan, and his representatives, at the Winter White House (Mar-a-Lago). Very good talks!", "created_at": "Sat Feb 11 23:24:08 +0000 2017"}, {"text": "Played golf today with Prime Minister Abe of Japan and @TheBig_Easy, Ernie Els, and had a great time. Japan is very well represented!", "created_at": "Sat Feb 11 23:15:34 +0000 2017"}, {"text": "Playef golf today with Prime Minister Abe of Japan and @TheBig_Easy, Ernie Els, and had a great time. Japan is very well represented!", "created_at": "Sat Feb 11 23:07:52 +0000 2017"}, {"text": "I am so proud of my daughter Ivanka. To be abused and treated so badly by the media, and to still hold her head so high, is truly wonderful!", "created_at": "Sat Feb 11 23:00:21 +0000 2017"}, {"text": "Melania and I are hosting Japanese Prime Minister Shinzo Abe and Mrs. Abe at Mar-a-Lago in Palm Beach, Fla. They are a wonderful couple!", "created_at": "Sat Feb 11 13:33:53 +0000 2017"}, {"text": "...design or negotiations yet. When I do, just like with the F-35 FighterJet or the Air Force One Program, price will come WAY DOWN!", "created_at": "Sat Feb 11 13:24:32 +0000 2017"}, {"text": "I am reading that the great border WALL will cost more than the government originally thought, but I have not gotten involved in the.....", "created_at": "Sat Feb 11 13:18:43 +0000 2017"}, {"text": "Our legal system is broken! \"77% of refugees allowed into U.S. since travel reprieve hail from seven suspect countries.\" (WT)  SO DANGEROUS!", "created_at": "Sat Feb 11 12:12:51 +0000 2017"}, {"text": "The failing @nytimes does major FAKE NEWS China story saying \"Mr.Xi has not spoken to Mr. Trump since Nov.14.\" We spoke at length yesterday!", "created_at": "Fri Feb 10 13:35:50 +0000 2017"}, {"text": "LAWFARE: \"Remarkably, in the entire opinion, the panel did not bother even to cite this (the) statute.\" A disgraceful decision!", "created_at": "Fri Feb 10 13:15:27 +0000 2017"}, {"text": "SEE YOU IN COURT, THE SECURITY OF OUR NATION IS AT STAKE!", "created_at": "Thu Feb 09 23:35:49 +0000 2017"}, {"text": "..Ryan died on a winning mission ( according to General Mattis), not a \"failure.\" Time for the U.S. to get smart and start winning again!", "created_at": "Thu Feb 09 13:52:31 +0000 2017"}, {"text": "...long he doesn't know how to win anymore, just look at the mess our country is in - bogged down in conflict all over the place. Our hero..", "created_at": "Thu Feb 09 13:31:59 +0000 2017"}, {"text": "Sen. McCain should not be talking about the success or failure of a mission to the media. Only emboldens the enemy! He's been losing so....", "created_at": "Thu Feb 09 13:26:07 +0000 2017"}, {"text": "Chris Cuomo, in his interview with Sen. Blumenthal, never asked him about his long-term lie about his brave \"service\" in Vietnam. FAKE NEWS!", "created_at": "Thu Feb 09 13:19:08 +0000 2017"}, {"text": "Sen.Richard Blumenthal, who never fought in Vietnam when he said for years he had (major lie),now misrepresents what Judge Gorsuch told him?", "created_at": "Thu Feb 09 11:57:59 +0000 2017"}, {"text": "Big increase in traffic into our country from certain areas, while our people are far more vulnerable, as we wait for what should be EASY D!", "created_at": "Wed Feb 08 17:41:09 +0000 2017"}, {"text": "My daughter Ivanka has been treated so unfairly by @Nordstrom. She is a great person -- always pushing me to do the right thing! Terrible!", "created_at": "Wed Feb 08 15:51:01 +0000 2017"}, {"text": "I will be speaking at 9:00 A.M. today to Police Chiefs and Sheriffs and will be discussing the horrible, dangerous and wrong decision.......", "created_at": "Wed Feb 08 13:04:47 +0000 2017"}, {"text": "If the U.S. does not win this case as it so obviously should, we can never have the security and safety to which we are entitled. Politics!", "created_at": "Wed Feb 08 12:03:18 +0000 2017"}, {"text": "It is a disgrace that my full Cabinet is still not in place, the longest such delay in the history of our country. Obstruction by Democrats!", "created_at": "Wed Feb 08 01:04:00 +0000 2017"}, {"text": "I don't know Putin, have no deals in Russia, and the haters are going crazy - yet Obama can make a deal with Iran, #1 in terror, no problem!", "created_at": "Tue Feb 07 12:11:29 +0000 2017"}, {"text": "I don't know Putin, have no deals in Russia, and the haters are going crazy - yet Obama can make a deal with Iran, #1in terror, no problem!", "created_at": "Tue Feb 07 12:04:01 +0000 2017"}, {"text": "The threat from radical Islamic terrorism is very real, just look at what is happening in Europe and the Middle-East. Courts must act fast!", "created_at": "Tue Feb 07 02:49:28 +0000 2017"}, {"text": "The failing @nytimes was forced to apologize to its subscribers for the poor reporting it did on my election win. Now they are worse!", "created_at": "Tue Feb 07 02:33:55 +0000 2017"}, {"text": "Will be interviewed on @oreillyfactor tonight at 8:00 P.M.", "created_at": "Mon Feb 06 16:27:45 +0000 2017"}, {"text": "I call my own shots, largely based on an accumulation of data, and everyone knows it. Some FAKE NEWS media, in order to marginalize, lies!", "created_at": "Mon Feb 06 12:07:55 +0000 2017"}, {"text": "Any negative polls are fake news, just like the CNN, ABC, NBC polls in the election. Sorry, people want border security and extreme vetting.", "created_at": "Mon Feb 06 12:01:53 +0000 2017"}, {"text": "What an amazing comeback and win by the Patriots. Tom Brady, Bob Kraft and Coach B are total winners. Wow!", "created_at": "Mon Feb 06 03:36:54 +0000 2017"}, {"text": "Enjoy the #SuperBowl and then we continue: MAKE AMERICA GREAT AGAIN!", "created_at": "Sun Feb 05 22:49:42 +0000 2017"}, {"text": "I will be interviewed by @oreillyfactor at 4:00 P.M. (prior to the #SuperBowl Pre-game Show) on Fox Network. Enjoy!", "created_at": "Sun Feb 05 20:47:25 +0000 2017"}, {"text": "I have instructed Homeland Security to check people coming into our country VERY CAREFULLY. The courts are making the job very difficult!", "created_at": "Sun Feb 05 20:42:33 +0000 2017"}, {"text": "Just cannot  believe a judge would put our country in such peril. If something happens blame him and court system. People pouring in. Bad!", "created_at": "Sun Feb 05 20:39:05 +0000 2017"}, {"text": "The judge opens up our country to potential terrorists and others that do not have our best interests at heart. Bad people are very happy!", "created_at": "Sun Feb 05 00:48:12 +0000 2017"}, {"text": "Interview with @oreillyfactor on Fox Network - 4:00 P.M. (prior to Super Bowl). Enjoy!", "created_at": "Sun Feb 05 00:34:50 +0000 2017"}, {"text": "Why aren't the lawyers looking at and using the Federal Court decision in Boston, which is at conflict with ridiculous lift ban decision?", "created_at": "Sat Feb 04 23:37:59 +0000 2017"}, {"text": "Because the ban was lifted by a judge, many very bad and dangerous people may be pouring into our country. A terrible decision", "created_at": "Sat Feb 04 21:44:49 +0000 2017"}, {"text": "What is our country coming to when a judge can halt a Homeland Security travel ban and anyone, even with bad intentions, can come into U.S.?", "created_at": "Sat Feb 04 20:44:07 +0000 2017"}, {"text": "MAKE AMERICA GREAT AGAIN!", "created_at": "Sat Feb 04 14:26:10 +0000 2017"}, {"text": "After being forced to apologize for its bad and inaccurate coverage of me after winning the election, the FAKE NEWS @nytimes is still lost!", "created_at": "Sat Feb 04 13:39:27 +0000 2017"}, {"text": "The opinion of this so-called judge, which essentially takes law-enforcement away from our country, is ridiculous and will be overturned!", "created_at": "Sat Feb 04 13:12:02 +0000 2017"}, {"text": "Countries charge U.S. companies taxes or tariffs while the U.S. charges them nothing or little.We should charge them SAME as they charge us!", "created_at": "Sat Feb 04 03:07:47 +0000 2017"}, {"text": "We must keep \"evil\" out of our country!", "created_at": "Fri Feb 03 23:08:38 +0000 2017"}, {"text": "A new radical Islamic terrorist has just attacked in Louvre Museum in Paris. Tourists were locked down. France on edge again. GET SMART U.S.", "created_at": "Fri Feb 03 12:51:58 +0000 2017"}, {"text": "Professional anarchists, thugs and paid protesters are proving the point of the millions of people who voted to MAKE AMERICA GREAT AGAIN!", "created_at": "Fri Feb 03 11:48:16 +0000 2017"}, {"text": "Meeting with biggest business leaders this morning. Good jobs are coming back to U.S., health care and tax bills are being crafted NOW!", "created_at": "Fri Feb 03 11:41:11 +0000 2017"}, {"text": "Thank you to Prime Minister of Australia for telling the truth about our very civil conversation that FAKE NEWS media lied about. Very nice!", "created_at": "Fri Feb 03 11:34:32 +0000 2017"}, {"text": "Iran is playing with fire - they don't appreciate how \"kind\" President Obama was to them. Not me!", "created_at": "Fri Feb 03 11:28:02 +0000 2017"}, {"text": "Yes, Arnold Schwarzenegger did a really bad job as Governor of California and even worse on the Apprentice...but at least he tried hard!", "created_at": "Fri Feb 03 11:24:51 +0000 2017"}, {"text": "Iran was on its last legs and ready to collapse until the U.S. came along and gave it a life-line in the form of the Iran Deal: $150 billion", "created_at": "Thu Feb 02 11:39:49 +0000 2017"}, {"text": "Iran has been formally PUT ON NOTICE for firing a ballistic missile.Should have been thankful for the terrible deal the U.S. made with them!", "created_at": "Thu Feb 02 11:34:36 +0000 2017"}, {"text": "Attending Chief Ryan Owens' Dignified Transfer yesterday with my daughter Ivanka was my great honor. To a great and brave man - thank you!", "created_at": "Thu Feb 02 11:25:40 +0000 2017"}, {"text": "Congratulations to Rex Tillerson on being sworn in as our new Secretary of State. He will be a star!", "created_at": "Thu Feb 02 11:18:21 +0000 2017"}, {"text": "If U.C. Berkeley does not allow free speech and practices violence on innocent people with a different point of view - NO FEDERAL FUNDS?", "created_at": "Thu Feb 02 11:13:13 +0000 2017"}, {"text": "Do you believe it? The Obama Administration agreed to take thousands of illegal immigrants from Australia. Why? I will study this dumb deal!", "created_at": "Thu Feb 02 03:55:49 +0000 2017"}, {"text": "Iran is rapidly taking over more and more of Iraq even after the U.S. has squandered three trillion dollars there. Obvious long ago!", "created_at": "Thu Feb 02 03:06:14 +0000 2017"}, {"text": "Everybody is arguing whether or not it is a BAN. Call it what you want, it is about keeping bad people (with bad intentions) out of country!", "created_at": "Wed Feb 01 12:50:16 +0000 2017"}, {"text": "Hope you like my nomination of Judge Neil Gorsuch for the United States Supreme Court. He is a good and brilliant man, respected by all.", "created_at": "Wed Feb 01 03:45:26 +0000 2017"}, {"text": "Getting ready to deliver a VERY IMPORTANT DECISION!  8:00 P.M.", "created_at": "Wed Feb 01 00:31:08 +0000 2017"}, {"text": "When will the Democrats give us our Attorney General and rest of Cabinet! They should be ashamed of themselves! No wonder D.C. doesn't work!", "created_at": "Tue Jan 31 11:27:02 +0000 2017"}, {"text": "Nancy Pelosi and Fake Tears Chuck Schumer held a rally  at the steps of The Supreme Court and mic did not work (a mess)-just like Dem party!", "created_at": "Tue Jan 31 11:21:52 +0000 2017"}, {"text": "The Democrats are delaying my cabinet picks for purely political reasons. They have nothing going but to obstruct. Now have an Obama A.G.", "created_at": "Tue Jan 31 00:45:50 +0000 2017"}, {"text": "Where was all the outrage from Democrats and the opposition party (the media) when our jobs were fleeing our country?", "created_at": "Mon Jan 30 14:23:49 +0000 2017"}, {"text": "I have made my decision on who I will nominate for The United States Supreme Court. It will be announced live on Tuesday at 8:00 P.M. (W.H.)", "created_at": "Mon Jan 30 13:43:25 +0000 2017"}, {"text": "If the ban were announced with a one week notice, the \"bad\" would rush into our country during that week. A lot of bad \"dudes\" out there!", "created_at": "Mon Jan 30 13:31:00 +0000 2017"}, {"text": "There is nothing nice about searching for terrorists before they can enter our country. This was a big part of my campaign. Study the world!", "created_at": "Mon Jan 30 12:27:05 +0000 2017"}, {"text": "protesters and the tears of Senator Schumer. Secretary Kelly said that all is going well with very few problems. MAKE AMERICA SAFE AGAIN!", "created_at": "Mon Jan 30 12:20:49 +0000 2017"}, {"text": "Only 109 people out of 325,000 were detained and held for questioning. Big problems at airports were caused by Delta computer outage,.....", "created_at": "Mon Jan 30 12:16:30 +0000 2017"}, {"text": "I will be interviewed by @TheBrodyFile on @CBNNews tonight at 11pm. Enjoy!", "created_at": "Sun Jan 29 23:39:53 +0000 2017"}, {"text": "...Senators should focus their energies on ISIS, illegal immigration and border security instead of always looking to start World War III.", "created_at": "Sun Jan 29 21:49:32 +0000 2017"}, {"text": "Christians in the Middle-East have been executed in large numbers. We cannot allow this horror to continue!", "created_at": "Sun Jan 29 15:03:58 +0000 2017"}, {"text": "Our country needs strong borders and extreme vetting, NOW. Look what is happening all over Europe and, indeed, the world - a horrible mess!", "created_at": "Sun Jan 29 13:08:18 +0000 2017"}, {"text": "Somebody with aptitude and conviction should buy the FAKE NEWS and failing @nytimes and either run it correctly or let it fold with dignity!", "created_at": "Sun Jan 29 13:00:32 +0000 2017"}, {"text": "I will be interviewed by @TheBrodyFile on @CBNNews tonight at 11pm. Enjoy!", "created_at": "Sat Jan 28 22:50:06 +0000 2017"}, {"text": "...dwindling subscribers and readers.They got me wrong right from the beginning and still have not changed course, and never will. DISHONEST", "created_at": "Sat Jan 28 13:16:17 +0000 2017"}, {"text": "Thr coverage about me in the @nytimes and the @washingtonpost gas been so false and angry that the times actually apologized to its.....", "created_at": "Sat Jan 28 13:08:42 +0000 2017"}, {"text": "The failing @nytimes has been wrong about me from the very beginning. Said I would lose the primaries, then the general election. FAKE NEWS!", "created_at": "Sat Jan 28 13:04:58 +0000 2017"}, {"text": "The #MarchForLife is so important. To all of you marching --- you have my full support!", "created_at": "Fri Jan 27 16:27:02 +0000 2017"}, {"text": "Mexico has taken advantage of the U.S. for long enough. Massive trade deficits &amp; little help on the very weak border must change, NOW!", "created_at": "Fri Jan 27 13:19:10 +0000 2017"}, {"text": "Look forward to seeing final results of VoteStand. Gregg Phillips and crew say at least 3,000,000 votes were illegal. We must do better!", "created_at": "Fri Jan 27 13:12:52 +0000 2017"}, {"text": "Will be interviewed by @SeanHannity on @FoxNews at 10:00pm tonight. Enjoy!", "created_at": "Thu Jan 26 23:45:28 +0000 2017"}, {"text": "of jobs and companies lost. If Mexico is unwilling to pay for the badly needed wall, then it would be better to cancel the upcoming meeting.", "created_at": "Thu Jan 26 13:55:03 +0000 2017"}, {"text": "The U.S. has a 60 billion dollar trade deficit with Mexico. It has been a one-sided deal from the beginning of NAFTA with massive numbers...", "created_at": "Thu Jan 26 13:51:46 +0000 2017"}, {"text": "Ungrateful TRAITOR Chelsea Manning, who should never have been released from prison, is now calling President Obama a weak leader. Terrible!", "created_at": "Thu Jan 26 11:04:24 +0000 2017"}, {"text": "Interview with David Muir of @ABC News in 10 minutes. Enjoy!", "created_at": "Thu Jan 26 02:48:25 +0000 2017"}, {"text": "I will be making my Supreme Court pick on Thursday of next week.Thank you!", "created_at": "Wed Jan 25 12:17:01 +0000 2017"}, {"text": "even, those registered to vote who are dead (and many for a long time). Depending on results, we will strengthen up voting procedures!", "created_at": "Wed Jan 25 12:13:46 +0000 2017"}, {"text": "I will be asking for a major investigation into VOTER FRAUD, including those registered to vote in two states, those who are illegal and....", "created_at": "Wed Jan 25 12:10:01 +0000 2017"}, {"text": "Big day planned on NATIONAL SECURITY tomorrow. Among many other things, we will build the wall!", "created_at": "Wed Jan 25 02:37:48 +0000 2017"}, {"text": "If Chicago doesn't fix the horrible \"carnage\" going on, 228 shootings in 2017 with 42 killings (up 24% from 2016), I will send in the Feds!", "created_at": "Wed Jan 25 02:25:40 +0000 2017"}, {"text": "Congratulations to @FoxNews for being number one in inauguration ratings. They were many times higher than FAKE NEWS @CNN - public is smart!", "created_at": "Wed Jan 25 02:16:19 +0000 2017"}, {"text": "Will be meeting at 9:00 with top automobile executives concerning jobs in America. I want new plants to be built here for cars sold here!", "created_at": "Tue Jan 24 11:11:47 +0000 2017"}, {"text": "Busy week planned with a heavy focus on jobs and national security. Top executives coming in at 9:00 A.M. to talk manufacturing in America.", "created_at": "Mon Jan 23 11:38:16 +0000 2017"}, {"text": "Peaceful protests are a hallmark of our democracy. Even if I don't always agree, I recognize the rights of people to express their views.", "created_at": "Sun Jan 22 14:23:17 +0000 2017"}, {"text": "Wow, television ratings just out: 31 million people watched the Inauguration, 11 million more than the very good ratings from 4 years ago!", "created_at": "Sun Jan 22 12:51:36 +0000 2017"}, {"text": "Watched protests yesterday but was under the impression that we just had an election! Why didn't these people vote? Celebs hurt cause badly.", "created_at": "Sun Jan 22 12:47:21 +0000 2017"}, {"text": "Had a great meeting at CIA Headquarters yesterday, packed house, paid great respect to Wall, long standing ovations, amazing people. WIN!", "created_at": "Sun Jan 22 12:35:09 +0000 2017"}, {"text": "A fantastic day and evening in Washington D.C.Thank you to @FoxNews and so many other news outlets for the GREAT reviews of the speech!", "created_at": "Sat Jan 21 11:53:41 +0000 2017"}, {"text": "We will follow two simple rules: BUY AMERICAN &amp; HIRE AMERICAN!\n#InaugurationDay #MAGA🇺🇸", "created_at": "Fri Jan 20 17:55:44 +0000 2017"}, {"text": "We will bring back our jobs. We will bring back our borders. We will bring back our wealth - and we will bring back our dreams!", "created_at": "Fri Jan 20 17:54:36 +0000 2017"}, {"text": "The forgotten men and women of our country will be forgotten no longer. From this moment on, it’s going to be #AmericaFirst🇺🇸", "created_at": "Fri Jan 20 17:54:00 +0000 2017"}, {"text": "January 20th 2017, will be remembered as the day the people became the rulers of this nation again.", "created_at": "Fri Jan 20 17:53:17 +0000 2017"}, {"text": "What truly matters is not which party controls our government, but whether our government is controlled by the people.", "created_at": "Fri Jan 20 17:52:45 +0000 2017"}, {"text": "power from Washington, D.C. and giving it back to you, the American People. #InaugurationDay", "created_at": "Fri Jan 20 17:51:58 +0000 2017"}, {"text": "Today we are not merely transferring power from one Administration to another, or from one party to another – but we are transferring...", "created_at": "Fri Jan 20 17:51:25 +0000 2017"}, {"text": "It all begins today! I will see you at 11:00 A.M. for the swearing-in. THE MOVEMENT CONTINUES - THE WORK BEGINS!", "created_at": "Fri Jan 20 12:31:53 +0000 2017"}, {"text": "Great Concert at 4:00 P.M. today at Lincoln Memorial. Enjoy!", "created_at": "Thu Jan 19 20:18:32 +0000 2017"}, {"text": "the American people. I have no doubt that we will, together, MAKE AMERICA GREAT AGAIN!", "created_at": "Thu Jan 19 13:02:18 +0000 2017"}, {"text": "Getting ready to leave for Washington, D.C. The journey begins and I will be working and fighting very hard to make it a great journey for..", "created_at": "Thu Jan 19 13:00:13 +0000 2017"}, {"text": "\"It wasn't Donald Trump that divided this country, this country has been divided for a long time!\" Stated today by Reverend Franklin Graham.", "created_at": "Thu Jan 19 12:52:22 +0000 2017"}, {"text": "Looking forward to a speedy recovery for George and Barbara Bush, both hospitalized. Thank you for your wonderful letter!", "created_at": "Wed Jan 18 22:21:02 +0000 2017"}, {"text": ".@TheAlabamaBand was great last night in D.C. playing for 147 Diplomats and Ambassadors from countries around the world. Thanks Alabama!", "created_at": "Wed Jan 18 14:03:53 +0000 2017"}, {"text": "No wonder the Today Show on biased @NBC is doing so badly compared to its glorious past. Little credibility!", "created_at": "Wed Jan 18 13:06:58 +0000 2017"}, {"text": "\"Bayer AG has pledged to add U.S. jobs and investments after meeting with President-elect Donald Trump, the latest in a string...\" @WSJ", "created_at": "Wed Jan 18 13:00:51 +0000 2017"}, {"text": "to the U.S., but had nothing to do with TRUMP, is more FAKE NEWS. Ask top CEO's of those companies for real facts. Came back because of me!", "created_at": "Wed Jan 18 12:44:03 +0000 2017"}, {"text": "Will be interviewed by @ainsleyearhardt on @foxandfriends - Enjoy!", "created_at": "Wed Jan 18 11:53:24 +0000 2017"}, {"text": "Thank you to General Motors and Walmart for starting the big jobs push back into the U.S.!", "created_at": "Tue Jan 17 17:55:38 +0000 2017"}, {"text": "\"thought it would be hypocritical to attend Bush's swearing-in....he doesn't believe Bush is the true elected president.\" Sound familiar! WP", "created_at": "Tue Jan 17 14:52:39 +0000 2017"}, {"text": "John Lewis said about my inauguration, \"It will be the first one that I've missed.\" WRONG (or lie)! He boycotted Bush 43 also because he...", "created_at": "Tue Jan 17 14:46:27 +0000 2017"}, {"text": "country and with the massive cost reductions I have negotiated on military purchases and more, I believe the people are seeing \"big stuff.\"", "created_at": "Tue Jan 17 14:36:26 +0000 2017"}, {"text": "With all of the jobs I am bringing back into the U.S. (even before taking office), with all of the new auto plants coming back into our.....", "created_at": "Tue Jan 17 14:30:19 +0000 2017"}, {"text": "The same people who did the phony election polls, and were so wrong, are now doing approval rating polls. They are rigged just like before.", "created_at": "Tue Jan 17 13:11:56 +0000 2017"}, {"text": "People are pouring into Washington in record numbers. Bikers for Trump are on their way. It will be a great Thursday, Friday and Saturday!", "created_at": "Tue Jan 17 13:05:10 +0000 2017"}, {"text": "\"@drgoodspine: @realDonaldTrump @Ivanka Trump is great, a woman with real character and class.\"", "created_at": "Tue Jan 17 02:08:21 +0000 2017"}, {"text": "At 9:00 P.M. @CNN, of all places, is doing a Special Report on my daughter, Ivanka. Considering it is CNN, can't imagine it will be great!", "created_at": "Tue Jan 17 01:49:38 +0000 2017"}, {"text": "\"@levisteveholt: @realDonaldTrump I appreciate your use of Twitter to keep us informed and maintain transparency.\" Very dishonest media!", "created_at": "Tue Jan 17 01:42:18 +0000 2017"}, {"text": "Celebrate Martin Luther King Day and all of the many wonderful things that he stood for. Honor him for being the great man that he was!", "created_at": "Mon Jan 16 13:54:52 +0000 2017"}, {"text": "much worse - just look at Syria (red line), Crimea, Ukraine and the build-up of Russian nukes. Not good! Was this the leaker of Fake News?", "created_at": "Mon Jan 16 00:29:05 +0000 2017"}, {"text": ".@FoxNews \"Outgoing CIA Chief, John Brennan, blasts Pres-Elect Trump on Russia threat. Does not fully understand.\" Oh really, couldn't do...", "created_at": "Mon Jan 16 00:16:20 +0000 2017"}, {"text": ".@NBCNews is bad but Saturday Night Live is the worst of NBC. Not funny, cast is terrible, always a complete hit job. Really bad television!", "created_at": "Sun Jan 15 22:46:33 +0000 2017"}, {"text": "Thank you to Bob Woodward who said, \"That is a garbage document...it never should have been presented...Trump's right to be upset (angry)...", "created_at": "Sun Jan 15 20:04:38 +0000 2017"}, {"text": "For many years our country has been divided, angry and untrusting. Many say it will never change, the hatred is too deep. IT WILL CHANGE!!!!", "created_at": "Sun Jan 15 19:00:21 +0000 2017"}, {"text": "will only get higher. Car companies and others, if they want to do business in our country, have to start making things here again. WIN!", "created_at": "Sun Jan 15 14:02:41 +0000 2017"}, {"text": "The Democrats are most angry that so many Obama Democrats voted for me. With all of the jobs I am bringing back to our Nation, that number..", "created_at": "Sun Jan 15 13:59:29 +0000 2017"}, {"text": "Inauguration Day is turning out to be even bigger than expected. January 20th, Washington D.C. Have fun!", "created_at": "Sun Jan 15 01:58:57 +0000 2017"}, {"text": "Congressman John Lewis should finally focus on the burning and crime infested inner-cities of the U.S. I can use all the help I can get!", "created_at": "Sun Jan 15 00:22:01 +0000 2017"}, {"text": "INTELLIGENCE INSIDERS NOW CLAIM THE TRUMP DOSSIER IS \"A COMPLETE FRAUD!\"  @OANN", "created_at": "Sat Jan 14 13:14:13 +0000 2017"}, {"text": "mention crime infested) rather than falsely complaining about the election results. All talk, talk, talk - no action or results. Sad!", "created_at": "Sat Jan 14 13:07:12 +0000 2017"}, {"text": "Congressman John Lewis should spend more time on fixing and helping his district, which is in horrible shape and falling apart (not to......", "created_at": "Sat Jan 14 12:50:26 +0000 2017"}, {"text": "A beautiful funeral today for a real NYC hero, Detective Steven McDonald. Our law enforcement community has my complete and total support.", "created_at": "Fri Jan 13 17:42:42 +0000 2017"}, {"text": "The \"Unaffordable\" Care Act will soon be history!", "created_at": "Fri Jan 13 11:33:24 +0000 2017"}, {"text": "have been allowed to run - guilty as hell. They were VERY nice to her. She lost because she campaigned in the wrong states - no enthusiasm!", "created_at": "Fri Jan 13 11:25:54 +0000 2017"}, {"text": "What are Hillary Clinton's people complaining about with respect to the F.B.I. Based on the information they had she should never.....", "created_at": "Fri Jan 13 11:22:38 +0000 2017"}, {"text": "released by \"Intelligence\" even knowing there is no proof, and never will be. My people will have a full report on hacking within 90 days!", "created_at": "Fri Jan 13 11:16:54 +0000 2017"}, {"text": "Totally made up facts by sleazebag political operatives, both Democrats and Republicans - FAKE NEWS! Russia says nothing exists. Probably...", "created_at": "Fri Jan 13 11:11:13 +0000 2017"}, {"text": "It now turns out that the phony allegations against me were put together by my political opponents and a failed spy afraid of being sued....", "created_at": "Fri Jan 13 11:05:55 +0000 2017"}, {"text": "All of my Cabinet nominee are looking good and doing a great job. I want them to be themselves and express their own thoughts, not mine!", "created_at": "Fri Jan 13 10:49:34 +0000 2017"}, {"text": "Congrats to the Senate for taking the first step to #RepealObamacare- now it's onto the House!", "created_at": "Thu Jan 12 17:41:11 +0000 2017"}, {"text": ".@CNN is in a total meltdown with their FAKE NEWS because their ratings are tanking since election and their credibility will soon be gone!", "created_at": "Thu Jan 12 14:22:21 +0000 2017"}, {"text": "Thank you to Linda Bean of L.L.Bean for your great support and courage. People will support you even more now. Buy L.L.Bean. @LBPerfectMaine", "created_at": "Thu Jan 12 13:50:13 +0000 2017"}, {"text": "James Clapper called me yesterday to denounce the false and fictitious report that was illegally circulated. Made up, phony facts.Too bad!", "created_at": "Thu Jan 12 12:23:45 +0000 2017"}, {"text": "\"@zhu_amy3: @realDonaldTrump It's Morning in America again!!!  ☀️☀️☀️Thank you President-Elect Donald Trump!!! So proud of you!!!!\" THANKS!", "created_at": "Thu Jan 12 04:24:52 +0000 2017"}, {"text": "We had a great News Conference at Trump Tower today. A couple of FAKE NEWS organizations were there but the people truly get what's going on", "created_at": "Thu Jan 12 04:01:38 +0000 2017"}, {"text": "Intelligence agencies should never have allowed this fake news to \"leak\" into the public. One last shot at me.Are we living in Nazi Germany?", "created_at": "Wed Jan 11 12:48:52 +0000 2017"}, {"text": "I win an election easily, a great \"movement\" is verified, and crooked opponents try to belittle our victory with FAKE NEWS. A sorry state!", "created_at": "Wed Jan 11 12:44:05 +0000 2017"}, {"text": "Russia has never tried to use leverage over me. I HAVE NOTHING TO DO WITH RUSSIA - NO DEALS, NO LOANS, NO NOTHING!", "created_at": "Wed Jan 11 12:31:31 +0000 2017"}, {"text": "Russia just said the unverified report paid for by political opponents is \"A COMPLETE AND TOTAL FABRICATION, UTTER NONSENSE.\" Very unfair!", "created_at": "Wed Jan 11 12:13:40 +0000 2017"}, {"text": "FAKE NEWS - A TOTAL POLITICAL WITCH HUNT!", "created_at": "Wed Jan 11 01:19:23 +0000 2017"}, {"text": "It's finally happening - Fiat Chrysler just announced plans to invest $1BILLION in Michigan and Ohio plants, adding 2000 jobs. This after...", "created_at": "Mon Jan 09 14:14:10 +0000 2017"}, {"text": "\"groveling\" when he totally changed a 16 year old story that he had written in order to make me look bad. Just more very dishonest media!", "created_at": "Mon Jan 09 11:43:26 +0000 2017"}, {"text": "Hillary flunky who lost big. For the 100th time, I never \"mocked\" a disabled reporter (would never do that) but simply showed him.......", "created_at": "Mon Jan 09 11:36:02 +0000 2017"}, {"text": "Meryl Streep, one of the most over-rated actresses in Hollywood, doesn't know me but attacked last night at the Golden Globes. She is a.....", "created_at": "Mon Jan 09 11:27:50 +0000 2017"}, {"text": "Rupert Murdoch is a great guy who likes me much better as a very successful candidate than he ever did as a very successful developer!", "created_at": "Mon Jan 09 11:17:40 +0000 2017"}, {"text": "Dishonest media says Mexico won't be paying for the wall if they pay a little later so the wall can be built more quickly. Media is fake!", "created_at": "Mon Jan 09 04:05:31 +0000 2017"}, {"text": "Before I, or anyone, saw the classified and/or highly confidential hacking intelligence report, it was leaked out to @NBCNews. So serious!", "created_at": "Sun Jan 08 18:56:20 +0000 2017"}, {"text": "Kellyanne Conway went to @MeetThePress this morning for an interview with @chucktodd. Dishonest media cut out 9 of her 10 minutes. Terrible!", "created_at": "Sun Jan 08 16:46:07 +0000 2017"}, {"text": "I look very much forward to meeting Prime Minister Theresa May in Washington in the Spring. Britain, a longtime U.S. ally, is very special!", "created_at": "Sun Jan 08 02:07:09 +0000 2017"}, {"text": "both countries will, perhaps, work together to solve some of the many great and pressing problems and issues of the WORLD!", "created_at": "Sat Jan 07 15:21:42 +0000 2017"}, {"text": "have enough problems around the world without yet another one. When I am President, Russia will respect us far more than they do now and....", "created_at": "Sat Jan 07 15:10:46 +0000 2017"}, {"text": "Having a good relationship with Russia is a good thing, not a bad thing. Only \"stupid\" people, or fools, would think that it is bad! We.....", "created_at": "Sat Jan 07 15:02:20 +0000 2017"}, {"text": "Only reason the hacking of the poorly defended DNC is discussed is that the loss by the Dems was so big that they are totally embarrassed!", "created_at": "Sat Jan 07 12:03:31 +0000 2017"}, {"text": "Intelligence stated very strongly there was absolutely no evidence that hacking affected the election results. Voting machines not touched!", "created_at": "Sat Jan 07 11:56:29 +0000 2017"}, {"text": "Gross negligence by the Democratic National Committee allowed hacking to take place.The Republican National Committee had strong defense!", "created_at": "Sat Jan 07 03:53:38 +0000 2017"}, {"text": "Monitoring the terrible situation in Florida. Just spoke to Governor Scott. Thoughts and prayers for all. Stay safe!", "created_at": "Fri Jan 06 19:30:09 +0000 2017"}, {"text": "I am asking the chairs of the House and Senate committees to investigate top secret intelligence shared with NBC prior to me seeing it.", "created_at": "Fri Jan 06 16:51:37 +0000 2017"}, {"text": "Wow, the ratings are in and Arnold Schwarzenegger got \"swamped\" (or destroyed) by comparison to the ratings machine, DJT. So much for....", "created_at": "Fri Jan 06 12:34:37 +0000 2017"}, {"text": "Hopefully, all supporters, and those who want to MAKE AMERICA GREAT AGAIN, will go to D.C. on January 20th. It will be a GREAT SHOW!", "created_at": "Fri Jan 06 12:05:01 +0000 2017"}, {"text": "and knew they were in big trouble - which is why they cancelled their big fireworks at the last minute.THEY SAW A MOVEMENT LIKE NEVER BEFORE", "created_at": "Fri Jan 06 11:45:47 +0000 2017"}, {"text": "Hillary and the Dems were never going to beat the PASSION of my voters. They saw what was happening in the last two weeks before the......", "created_at": "Fri Jan 06 11:39:35 +0000 2017"}, {"text": "The dishonest media does not report that any money spent on building the Great Wall (for sake of speed), will be paid back by Mexico later!", "created_at": "Fri Jan 06 11:19:49 +0000 2017"}, {"text": "So how and why are they so sure about hacking if they never even requested an examination of the computer servers? What is going on?", "created_at": "Fri Jan 06 00:40:03 +0000 2017"}, {"text": "The Democratic National Committee would not allow the FBI to study or see its computer info after it was supposedly hacked by Russia......", "created_at": "Fri Jan 06 00:30:15 +0000 2017"}, {"text": "How did NBC get \"an exclusive look into the top secret report he (Obama) was presented?\" Who gave them this report and why? Politics!", "created_at": "Fri Jan 06 00:24:34 +0000 2017"}, {"text": "Toyota Motor said will build a new plant in Baja, Mexico, to build Corolla cars for U.S. NO WAY! Build plant in U.S. or pay big border tax.", "created_at": "Thu Jan 05 18:14:30 +0000 2017"}, {"text": "to make up their own minds as to the truth. The media lies to make it look like I am against \"Intelligence\" when in fact I am a big fan!", "created_at": "Thu Jan 05 13:45:57 +0000 2017"}, {"text": "The dishonest media likes saying that I am in Agreement with Julian Assange - wrong. I simply state what he states, it is for the people....", "created_at": "Thu Jan 05 13:25:30 +0000 2017"}, {"text": "...do the typical political thing and BLAME. The fact is ObamaCare was a lie from the beginning.\"Keep you doctor, keep your plan!\" It is....", "created_at": "Thu Jan 05 12:01:33 +0000 2017"}, {"text": "The Democrats, lead by head clown Chuck Schumer, know how bad ObamaCare is and what a mess they are in. Instead of working to fix it, they..", "created_at": "Thu Jan 05 11:57:57 +0000 2017"}, {"text": "Jackie Evancho's album sales have skyrocketed after announcing her Inauguration performance.Some people just don't understand the \"Movement\"", "created_at": "Wed Jan 04 18:52:09 +0000 2017"}, {"text": "massive increases of ObamaCare will take place this year and Dems are to blame for the mess. It will fall of its own weight - be careful!", "created_at": "Wed Jan 04 14:26:45 +0000 2017"}, {"text": "like the 116% hike in Arizona. Also, deductibles are so high that it is practically useless. Don't let the Schumer clowns out of this web...", "created_at": "Wed Jan 04 14:01:53 +0000 2017"}, {"text": "Republicans must be careful in that the Dems own the failed ObamaCare disaster, with its poor coverage and massive premium increases......", "created_at": "Wed Jan 04 13:55:53 +0000 2017"}, {"text": "things they did and said (like giving the questions to the debate to H). A total double standard! Media, as usual, gave them a pass.", "created_at": "Wed Jan 04 13:31:32 +0000 2017"}, {"text": "Somebody hacked the DNC but why did they not have \"hacking defense\" like the RNC has and why have they not responded to the terrible......", "created_at": "Wed Jan 04 13:27:03 +0000 2017"}, {"text": "Thank you to Ford for scrapping a new plant in Mexico and creating 700 new jobs in the U.S. This is just the beginning - much more to follow", "created_at": "Wed Jan 04 13:19:09 +0000 2017"}, {"text": "Julian Assange said \"a 14 year old could have hacked Podesta\" - why was DNC so careless? Also said Russians did not give him the info!", "created_at": "Wed Jan 04 12:22:38 +0000 2017"}, {"text": "The \"Intelligence\" briefing on so-called \"Russian hacking\" was delayed until Friday, perhaps more time needed to build a case. Very strange!", "created_at": "Wed Jan 04 01:14:52 +0000 2017"}, {"text": "I will be having a general news conference on JANUARY ELEVENTH in N.Y.C. Thank you.", "created_at": "Tue Jan 03 23:58:31 +0000 2017"}, {"text": "There should be no further releases from Gitmo. These are extremely dangerous people and should not be allowed back onto the battlefield.", "created_at": "Tue Jan 03 17:20:43 +0000 2017"}, {"text": "........may be, their number one act and priority. Focus on tax reform, healthcare and so many other things of far greater importance! #DTS", "created_at": "Tue Jan 03 15:07:41 +0000 2017"}, {"text": "With all that Congress has to work on, do they really have to make the weakening of the Independent Ethics Watchdog, as unfair as it", "created_at": "Tue Jan 03 15:03:29 +0000 2017"}, {"text": "The Democrat Governor.of Minnesota said \"The Affordable Care Act (ObamaCare) is no longer affordable!\" - And, it is lousy healthcare.", "created_at": "Tue Jan 03 12:51:15 +0000 2017"}, {"text": "People must remember that ObamaCare just doesn't work, and it is not affordable - 116% increases (Arizona). Bill Clinton called it \"CRAZY\"", "created_at": "Tue Jan 03 12:46:33 +0000 2017"}, {"text": "General Motors is sending Mexican made model of Chevy Cruze to U.S. car dealers-tax free across border. Make in U.S.A.or pay big border tax!", "created_at": "Tue Jan 03 12:30:05 +0000 2017"}, {"text": "North Korea just stated that it is in the final stages of developing a nuclear weapon capable of reaching parts of the U.S. It won't happen!", "created_at": "Mon Jan 02 23:05:44 +0000 2017"}, {"text": "I thought and felt I would win big, easily over the fabled 270 (306). When they cancelled fireworks, they knew, and so did I.", "created_at": "Mon Jan 02 18:44:04 +0000 2017"}, {"text": "Various media outlets and pundits say that I thought I was going to lose the election. Wrong, it all came together in the last week and.....", "created_at": "Mon Jan 02 18:37:10 +0000 2017"}, {"text": "Chicago murder rate is record setting - 4,331 shooting victims with 762 murders in 2016. If Mayor can't do it he must ask for Federal help!", "created_at": "Mon Jan 02 17:31:17 +0000 2017"}, {"text": "Well, the New Year begins. We will, together, MAKE AMERICA GREAT AGAIN!", "created_at": "Mon Jan 02 14:40:10 +0000 2017"}]